<!DOCTYPE HTML PUBLIC>
<meta name="viewport" content="width=device-width, initial-scale=1.0, minimum-scale=0.64">
<meta http-equiv="Cache-control" content="public, min-fresh:2400000">
<meta http-equiv="Content-Security-Policy" content="upgrade-insecure-requests">
<style type="text/css"> html { max-width:1024px;overflow:auto;} </style>
<script language="JavaScript" type="text/javascript">
if (window == top) { 
//document.write('<div style="height:30px;"></div><div id="content" style="max-width:1022px;overflow:auto">');
}
else {document.write('<div id="content" style="max-width:804px;overflow:auto">');} </script>

<script language="JavaScript" src="https://www.oocities.org/js_source/geovck08.js"></script>
<HTML>
<HEAD>
<TITLE>Volume 3 - Manual de Administração do Sistema do Linux</TITLE>
</HEAD>
<BODY LINK="#0000ff">

<B><FONT SIZE=5><P ALIGN="CENTER">MANUAL DE LINUX</P>
<P ALIGN="CENTER">VOLUME 3</P>
<P ALIGN="CENTER">ADMINISTRA&Ccedil;&Atilde;O DO SISTEMA</P>
<P ALIGN="CENTER">&nbsp;</P>
<P ALIGN="CENTER">&nbsp;</P>
</B></FONT><P>&nbsp;</P>
<P>T&Oacute;PICOS&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;P&Aacute;GINAS</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>1 – Informa&ccedil;&otilde;es sobre Linux (man, info, help, HOWTOs, FAQs, ...)&#9;.&#9;002</P>
<P>&nbsp;</P>
<P>2 - Estrutura de Diret&oacute;rios   .       .       .       .       &#9;.&#9;.&#9;.&#9;.&#9;004</P>
<P>&nbsp;</P>
<P>3 - Permiss&otilde;es dos Arquivos   .       .       .       .       .&#9;&#9;.&#9;.&#9;.&#9;023</P>
<P>&nbsp;</P>
<P>4 - Montagem Tempor&aacute;ria e Permanente de HD, FD e CDROM        &#9;.&#9;026</P>
<P>&nbsp;</P>
<P>5 - Gerenciamento de Mem&oacute;ria no Linux&#9;.&#9;.&#9;.&#9;.&#9;.&#9;028</P>
<P>&nbsp;</P>
<P>6 - Uso do sistema como "root" e como usu&aacute;rio comum   .       &#9;.&#9;.&#9;043</P>
<P>&nbsp;</P>
<P>7 - Dicas de Firewalling com IPFWADM&#9;.&#9;.&#9;.&#9;.&#9;.&#9;044</P>
<P>&nbsp;</P>
<P>8 -    X Window System .       .       .       .       .       .       &#9;&#9;.&#9;.&#9;054</P>
<P>&nbsp;</P>
<P>9 – Recompilando o Kernel&#9;.&#9;.&#9;.&#9;.&#9;.&#9;.&#9;.&#9;063</P>
<P>&nbsp;</P>
<P>10 -     Conex&atilde;o &agrave; Internet      .       .       .       .       .       &#9;.&#9;.&#9;.&#9;080</P>
<P>&nbsp;</P>
<P>11 -    Uso de programas para a Internet        .       .       .       .&#9;087</P>
<P>&nbsp;</P>
<P>12 – Dicas Gerais&#9;.&#9;.&#9;.&#9;.&#9;.&#9;.&#9;.&#9;.&#9;090</P>
<P>&nbsp;</P>
<P>13 -    REFER&Ecirc;NCIAS     .       .       .       .       .       .       .&#9;.&#9;.&#9;.&#9;101</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>1 – INFORMA&Ccedil;&Otilde;ES SOBRE LINUX</FONT> </P>
</B><P>&nbsp;</P>
<P>APRESENTA&Ccedil;&Atilde;O</P>
<P>&nbsp;</P>
<P>Este manual &eacute; fruto do trabalho em conjunto com um grande n&uacute;mero de usu&aacute;rios do Linux. V&aacute;rios colegas das  listas Linux-br e Linuxabc e v&aacute;rias p&aacute;ginas sobre Linux colaboraram com este manual. </P>
<P>&nbsp;</P>
<P>Vou resistir &agrave; tenta&ccedil;&atilde;o de  citar alguns nomes para n&atilde;o correr o risco de ser injusto ao esquecer de citar algu&eacute;m.</P>
<P>&nbsp;</P>
<P>Ressalte-se que tivemos a devida autoriza&ccedil;&atilde;o de alguns colegas (donos de sites) para divulgar aqui suas dicas.</P>
<P>&nbsp;</P>
<P>O objetivo deste manual &eacute; tornar o Linux mais acess&iacute;vel para os iniciantes, simplificando, traduzindo (algumas vezes) e desmistificando o "SO dos experts". </P>
<P>&nbsp;</P>
<P>Caso algu&eacute;m ache aqui algo de sua autoria e n&atilde;o tenha sido citado como tal, entre em contato que fa&ccedil;o as devidas altera&ccedil;&otilde;es.</P>
<P>&nbsp;</P>
<P>Gostaria de receber cr&iacute;ticas e sugest&otilde;es, tanto t&eacute;cnicas quanto em rela&ccedil;&atilde;o &agrave; nossa l&iacute;ngua t&atilde;o rica quanto complexa.</P>
<P>&nbsp;</P>
<P>Quanto a direitos autorais, sinceramente n&atilde;o pensamos muito nisso. Quem quiser copiar, imprimir, usar e abusar esteja a vontade.</P>
<P>&#9;&#9;&#9;&#9;&#9;&#9;</P><DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>

<P>Maicon Wendhausen (<A HREF="mailto:maicon@zaz.com.br">maicon@zaz.com.br</A>)</P></DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>

<P ALIGN="RIGHT">Ribamar F. Sousa (<A HREF="mailto:ribafs@fortalnet.com.br">ribafs@fortalnet.com.br</A>)</P><DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>

<P>Thiago Correia(<A HREF="mailto:thiagoacorrea@sti.com.br">thiagoacorrea@sti.com.br</A>)</P></DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>

<P>           &#9;&#9;&#9;&#9;&#9;&#9;      </P><DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>

<P>Maio de 1999</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P></DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>

<P>O Linux tem muita informa&ccedil;&atilde;o dispon&iacute;vel via INTERNET. Tem tamb&eacute;m muita informa&ccedil;&atilde;o on-line: HOWTOs, man pages, info pages e help.</P>
<P>&nbsp;</P>
<P>Os HOWTOs s&atilde;o informa&ccedil;&otilde;es muito detalhadas sobre todos os aspectos do Linux. V&ecirc;m em v&aacute;rios formatos, inclusive html. Sempre que instalar o Linux d&ecirc; prefer&ecirc;ncia a uma instala&ccedil;&atilde;o personalizada para poder ter certeza de que ir&aacute; instalar os HOWTOs e as man pages.</P>
<P>&nbsp;</P>
<P>Estes HOWTOs normalmente v&ecirc;m em ingl&ecirc;s, mas a Conectiva no Brasil e acho que outros est&atilde;o traduzindo este material (veja o coment&aacute;rio do Jorge mais abaixo).</P>
<P>&nbsp;</P>
<P>Atrav&eacute;s da INTERNET pode-se baixar vers&otilde;es mais atualizadas dos HOWTOs.</P>
<P>Vide site da Conectiva abaixo e no site oficial do Linux e muitos outros.</P>
<P>&nbsp;</P>
<P>Use o comando locate para localizar um HOWTO no seu disco.</P>
<P>&nbsp;</P>
<P>As man pages s&atilde;o p&aacute;ginas de manual que podem ser consultadas com facilidade:</P>
<P>man nome.do.comando. S&atilde;o p&aacute;ginas com muita informa&ccedil;&atilde;o.</P>
<P>&nbsp;</P>
<P>Tamb&eacute;m temos dispon&iacute;vel as info e o help. Uso: info nome.do.comando.</P>
<P>Help, uso: nome.do.comando --help.</P>
<P>&nbsp;</P>
<P>Quanto aos HOWTOs e p&aacute;ginas de manual, temos mais de 100 (acho que mais de 200) p&aacute;ginas em portugu&ecirc;s do Brasil dispon&iacute;veis em http://lie-br.conectiva.com.br para download. Os HOWTOs, em breve, estar&atilde;o dispon&iacute;veis tamb&eacute;m... E, a melhor fonte de informa&ccedil;&atilde;o continua sendo sempre aquela que lhe diz o porqu&ecirc; do que se est&aacute; fazendo e n&atilde;o a que diz apenas como se faz. O "como" agiliza, mas n&atilde;o ensina.</P>
<P>(Essa acima foi do Jorge Godoy.)</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2 - ESTRUTURA DE DIRET&Oacute;RIOS</P>
</B></FONT><P>&nbsp;</P>
<P>&nbsp;</P>
<P>A estrutura de diret&oacute;rios do Linux:</P>
<P>(&Eacute; bom lembrar aqui que o Linux - como Unix - &eacute; case sensitive, interpreta de maneira diferente comandos com mai&uacute;sculas de comandos com min&uacute;sculas, diferente do DOS/Windows). Em geral os nomes de comandos no Linux s&atilde;o em min&uacute;sculas (com algumas exce&ccedil;&otilde;es).</P>
<P>Agora vou mostrar um exemplo de diferen&ccedil;a:</P>
<P>&nbsp;</P>
<P>DOS:       C:\DOCS\LINUX\LINUXMAN.TEX</P>
<P>Linux:      /home/hugo/docs/linuxmanual.tex</P>
<P>Tabela 01</P>
<P>&#9;</P>
<P>bin  &#9;arquivos execut&aacute;veis(bin&aacute;rios) de comandos essenciais pertencentes ao </P>
<P>&#9;sistema   e que s&atilde;o usados com freq&uuml;&ecirc;ncia.  &#9;</P>
<P>Boot &#9;arquivos est&aacute;ticos de boot de inicializa&ccedil;&atilde;o(boot-loader)&#9;</P>
<P>Dev  &#9;arquivos de dispositivos de entrada/sa&iacute;da&#9;</P>
<P>Etc          Configura&ccedil;&atilde;o  do  sistema da  m&aacute;quina local com arquivos </P>
<P>&#9;diversos para a administra&ccedil;&atilde;o de sistema.</P>
<P>Home &#9;diret&oacute;rios  local(home) dos usu&aacute;rios.&#9;</P>
<P>Lib  &#9;arquivos da bibliotecas compartilhadas usados com freq&uuml;&ecirc;ncia&#9;</P>
<P>Mnt  &#9;Ponto de  montagem de parti&ccedil;&atilde;o tempor&aacute;rios&#9;</P>
<P>Root &#9;Diret&oacute;rio local do  superusu&aacute;rio (root)&#9;</P>
<P>Sbin &#9;Arquivos de sistema essenciais&#9;</P>
<P>Tmp  &#9;arquivos tempor&aacute;rios gerados por alguns utilit&aacute;rios&#9;</P>
<P>Usr  &#9;todos os arquivos de usu&aacute;rios devem estar aqui (segunda maior </P>
<P>&#9;hierarquia)&#9;</P>
<P>Var &#9;Informa&ccedil;&atilde;o vari&aacute;vel&#9;</P>
<P>&nbsp;</P>
<P>Cada diret&oacute;rio listado ser&aacute; discutido em detalhe em uma subse&ccedil;&atilde;o separada </P>
<P>mas adiante. /usr e /var, cada um tem seu pr&oacute;pria sess&atilde;o de documentos. </P>
<P>O kernel do  LINUX estaria localizado na raiz / ou no /boot. Se estiver </P>
<P>localizado  em / &eacute; recomendado usar O nome VMLINUX o VMLINUZ, nome que </P>
<P>dever&aacute; ser  usados em programas fonte do  kernel do  LINUX recentemente. </P>
<P>Mais informa&ccedil;&atilde;o da localiza&ccedil;&atilde;o do  kernel  pode-se encontrar na sess&atilde;o </P>
<P>sobre a raiz / neste trabalho.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.1 SUBDIRET&Oacute;RIO /BIN </P>
</FONT><P>&nbsp;</P>
</B><P>Composi&ccedil;&atilde;o : Arquivos Bin&aacute;rios de comandos essenciais de usu&aacute;rios </P>
<P>(dispon&iacute;veis para todos os usu&aacute;rios).</P>
<P>Cont&eacute;m  os comandos que podem ser utilizados pelos  usu&aacute;rios e pelo </P>
<P>administrador do  sistema, por&eacute;m que s&atilde;o requeridos no modo  mono-usu&aacute;rio </P>
<P>(single-user mode) pode tamb&eacute;m conter comandos que s&atilde;o utilizados </P>
<P>indiretamente por alguns scripts. </P>
<P>Todos os arquivos utilizados somente pelo root, tal como daemons, init, </P>
<P>gette, update, etc. &#9;Estariam localizados em /sbin ou /usr/sbin </P>
<P>dependendo se s&atilde;o ou n&atilde;o essenciais.   N&atilde;o abra subdiret&oacute;rios  dentro /bin.</P>
<P>Os arquivos dos comandos que n&atilde;o s&atilde;o suficientemente essenciais para estar </P>
<P>em /bin estar&atilde;o localizados em /usr/bin, os elementos que s&atilde;o utilizados </P>
<P>pelos usu&aacute;rios isoladamente (por&eacute;m n&atilde;o pelo root) (mail, chsh, etc.) </P>
<P>N&atilde;o s&atilde;o suficientemente essenciais para estar dentro da parti&ccedil;&atilde;o /.</P>
<P>Arquivos e/ou comandos dispon&iacute;veis em bin</P>
<P>&nbsp;</P>
<P>Os arquivos que devem estar em /bin s&atilde;o : comandos gerais e comandos de </P>
<P>rede.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.2 Comandos  gerais:</P>
</FONT><P>&nbsp;</P>
</B><P>Os seguintes comandos dever&atilde;o sido  inclu&iacute;dos porque s&atilde;o essenciais.</P>
<P>Alguns estar&atilde;o presente e tradicionalmente dever&atilde;o estado  em /bin.</P>
<P>{arch, cat, chgrp, chmod, chown, cp, date, dd, df, dmeg, echo, ed, false, </P>
<P>kill, in, login, mkdir, mknod, more, mount, mv, ps, pwd, rm, rmdir, sed, </P>
<P>setserial, sh, sfte , seu, sinc, true, umount, uname}.  </P>
<P>Se /bin/sh &eacute; bash, ent&atilde;o /bin/sh seria em links simb&oacute;lico a /bin/bash dado </P>
<P>que bash se comporta diferente quando  &eacute; carregado  como sh ou bash. </P>
<P>A pdksh que pode ser a /bin/sh nos discos de instala&ccedil;&atilde;o e seria igualmente </P>
<P>carregada a que /bin/sh faz um links simb&oacute;lico a /bin/ksh. Outros links </P>
<P>simb&oacute;licos de sistemas utilizando  outros programas, ent&atilde;o a parti&ccedil;&atilde;o </P>
<P>/ conter&aacute; os componente m&iacute;nimos necess&aacute;rios.</P>
<P>Por exemplos, muitos sistemas incluiria cpio como de segunda utilidade mais </P>
<P>&eacute; usado para reparos depois do tar. Por&eacute;m  jamais se espera restaurar o </P>
<P>sistema da  parti&ccedil;&atilde;o /, ent&atilde;o estes arquivos podem ser omitidos  (montar </P>
<P>/ em chip ROM, montar /usr no NFS). Se a restaura&ccedil;&atilde;o do  sistema se planeja </P>
<P>atrav&eacute;s da rede, Ent&atilde;o FTP o TFTP (junto com todo  o necess&aacute;rio para obter </P>
<P>uma conex&atilde;o FTP) estariam dispon&iacute;veis na parti&ccedil;&atilde;o /.</P>
<P>Os comandos de restaura&ccedil;&atilde;o podem aparecer em  /bin ou /usr/bin em sistemas </P>
<P>LINUX diferentes.</P>
<P>&nbsp;</P>
<P>Comandos  de redes.</P>
<P>&nbsp;</P>
<P>Estes s&atilde;o unicamente os arquivos de rede que os usu&aacute;rios e o root queiram </P>
<P>ou necessitem executar que n&atilde;o estejam no /usr/bin ou /usr/local/bin </P>
<P>{domain name, hostname, netstat, ping}.</P>
<P>Subdiret&oacute;rio /boot: </P>
<P>Composi&ccedil;&atilde;o : arquivos est&aacute;ticos do  boot de inicializa&ccedil;&atilde;o (boot loader).</P>
<P>&nbsp;</P>
<P>Este diret&oacute;rio cont&eacute;m tudo que &eacute; necess&aacute;rio para carregar o sistema, exceto</P>
<P>os arquivos de configura&ccedil;&atilde;o e o gerenciador de boot.  O /boot &eacute; utilizado </P>
<P>para qualquer coisa que se utiliza antes do kernel execute /sbin/init. </P>
<P>Este inclui setores master de inicializa&ccedil;&atilde;o (master boot sectors) guardados,</P>
<P>arquivos de mapa de setor e qualquer outra coisa que n&atilde;o &eacute; editada </P>
<P>manualmente. Os programas necess&aacute;rios para consertar o boot de inicializa&ccedil;&atilde;o</P>
<P>e capaz de carregar um arquivo (tal como o gerenciador de boot [lilo]) </P>
<P>estar&atilde;o localizados  em /sbin. Os arquivos de configura&ccedil;&atilde;o para carregar </P>
<P>de inicializa&ccedil;&atilde;o poderiam estar localizados  em /etc.</P>
<P>Como o exposto acima, o kernel do  LINUX pode estar localizado  em / ou </P>
<P>/boot, se  estiver em /boot, &eacute; recomendado usar um  nome mais descritivo.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.3 Subdiret&oacute;rio /dev </P>
<P>&nbsp;</P>
</B></FONT><P>Composi&ccedil;&atilde;o : arquivos de dispositivos de entrada/sa&iacute;da.</P>
<P>Este &eacute;  diret&oacute;rio dos dispositivos. Cont&eacute;m um arquivo para cada dispositivo </P>
<P>que o kernel do  LINUX pode suportar.</P>
<P>/dev tamb&eacute;m cont&eacute;m um script carregado MAKEDEV o qual pode criar </P>
<P>dispositivos quando necessitar. Pode conter um MAKEDEV local para </P>
<P>dispositivos locais.</P>
<P>MAKEDEV deve fazer previs&atilde;o para criar qualquer arquivo de dispositivo </P>
<P>especial listado  na lista de dispositivos suportados pelo Linux.</P>
<P>Os links simb&oacute;licos n&atilde;o devem ser distribu&iacute;dos no sistemas LINUX,  somente </P>
<P>como  prev&ecirc; na  lista de dispositivos de LINUX.  Isto &eacute; porque as </P>
<P>instala&ccedil;&otilde;es locais seguro diferem daquelas da m&aacute;quina do administrador. </P>
<P>Al&eacute;m disso, um script de instala&ccedil;&atilde;o configura links simb&oacute;licos na </P>
<P>instala&ccedil;&atilde;o, estes liga&ccedil;&atilde;o seguramente n&atilde;o se atualizaram se houverem </P>
<P>trocas locais no hardware. Quando  utilizados responsavelmente s&atilde;o de bom </P>
<P>uso.</P>
<P>A lista de dispositivos compat&iacute;vel com o LINUX, &eacute; mantida por Peter Anvin </P>
<P>(peter.anvin@linux.org). Estes arquivos especial de dispositivo est&atilde;o </P>
<P>dispon&iacute;vel no endere&ccedil;o eletr&ocirc;nico da INTERNET ftp.eggdrassiml.com,  no </P>
<P>diret&oacute;rio /pub/device-list.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.4 Subdiret&oacute;rio /etc </P>
</FONT><P>&nbsp;</P>
</B><P>Composi&ccedil;&atilde;o : Configura&ccedil;&atilde;o do sistema da m&aacute;quina local com arquivos diversos</P>
<P>para a administra&ccedil;&atilde;o de sistema.</P>
<P>&nbsp;</P>
<P>Cont&eacute;m  arquivos e diret&oacute;rios que s&atilde;o locais ao sistema atual.</P>
<P>&nbsp;</P>
<P>Nenhum arquivo deve ir diretamente dentro /etc. Os arquivos que nas </P>
<P>primeiras vers&otilde;es encontravam-se em /etc, ir&aacute; em /sbin ou /usr/sbin. Isto </P>
<P>inclui arquivos tal como init, gette e update, arquivos como hostname que </P>
<P>s&atilde;o utilizados por usu&aacute;rios comuns e pelo root n&atilde;o iriam em /sbin seriam </P>
<P>em /bin.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.5 Subdiret&oacute;rios de /etc</P>
</FONT><P>&nbsp;</P>
</B><P>Tipicamente /etc possui dois sudiret&oacute;rios :</P>
<P>&nbsp;</P>
<P>X11 &#9;arquivos de configura&ccedil;&atilde;o para Ox11</P>
<P>sk&#9;Esqueletos da configura&ccedil;&atilde;o usu&aacute;rios</P>
<P>&nbsp;</P>
<P>O /etc/sk  &eacute; a localidade para os chamados arquivos esqueletos de usu&aacute;rios, </P>
<P>que s&atilde;o os dados por default quando um novo usu&aacute;rio recebe uma conta, esta </P>
<P>diret&oacute;rio pode conter subdiret&oacute;rios para diferente grupos de usu&aacute;rios </P>
<P>(/etc/skell/apoio, /etc/skell/usu&aacute;rios).</P>
<P>O /etc/X11 &eacute; o lugar recomendado  para todos os arquivos de configura&ccedil;&atilde;o </P>
<P>X11 locais da m&aacute;quina. Este diret&oacute;rios &eacute; necess&aacute;rio para permitir o </P>
<P>controle local se /usr for colocado somente para leitura. Os arquivos que </P>
<P>devem ir neste diret&oacute;rio incluem Xconfig (e /o XF86Config) e Xmodmap. </P>
<P>O /etc/X11/xdm cont&eacute;m os arquivos de configura&ccedil;&atilde;o xdm. Estes s&atilde;o a maioria </P>
<P>dos arquivos normalmente gravados em /usr/lib/X11/xdm; veja /var/lib/xdm, </P>
<P>para maior informa&ccedil;&atilde;o.</P>
<P>Arquivos e/ou comandos dispon&iacute;veis em /etc Esta descri&ccedil;&atilde;o do conte&uacute;do &eacute; </P>
<P>gen&eacute;rica, portanto n&atilde;o est&aacute; totalmente completa, pode haver algumas </P>
<P>varia&ccedil;&otilde;es dependendo do distribuidor do Linux ou do administrador de </P>
<P>sistema. Os arquivos /etc s&atilde;o composto de :</P>
<P>Arquivos gerais;</P>
<P>Arquivos de rede.</P>
<P>Os arquivos gerais s&atilde;o necess&aacute;rios na maioria dos sistemas LINUX, tais </P>
<P>como :</P>
<P>{adjtime, csh.login, disktab, fdprm, fstab, gettedefs, group, inittab, </P>
<P>issue, ld.so.conf, lilo.conf, magic, motd, mtab, mtools, passwd, profile, </P>
<P>psdaTabelase, securette , shells, se sog.conf, tercamp, tte te pe}</P>
<P>&nbsp;</P>
<P>Os arquivos de Rede mais utilizados na  maioria dos sistemas LINUX s&atilde;o :</P>
<P>&nbsp;</P>
<P>{exports, ftpusers, gateway, hosts, host.conf, host.equiv, host.lpd, </P>
<P>inetd.conf, networks, printcap, protocols, reolv.conf.rpc, service}</P>
<P>&nbsp;</P>
<P>Existe dois modo para a instala&ccedil;&atilde;o dos scripts de comandos "rc" os quais </P>
<P>s&atilde;o chamados por init no momento de  carregar, ou o modo  /etc/rc.d/* etc </P>
<P>do System V.  Qualquer que seja o escolhido pode ser utilizado  uma </P>
<P>mescla dos dois.</P>
<P>Os sistemas com a senha de passwords sombreadas (shadow password) ter&atilde;o </P>
<P>arquivos de configura&ccedil;&atilde;o adicionais, em /etc (/etc/shadow e  outros) e </P>
<P>/usr/bin (useradd, usermod, e outros).</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.6 Subdiret&oacute;rio /home:</P>
</FONT><P>&nbsp;</P>
</B><P>Composi&ccedil;&atilde;o : diret&oacute;rios locais dos usu&aacute;rios  (opcional) </P>
<P>O subdiret&oacute;rio /home &eacute; claramente um sistema de arquivos espec&iacute;fico do  </P>
<P>diret&oacute;rio local. A regra de cri&aacute;-lo difere de m&aacute;quina para m&aacute;quina. </P>
<P>Descreve uma localiza&ccedil;&atilde;o  sugerida para os diret&oacute;rios local dos usu&aacute;rios, </P>
<P>assim, recomendamos que todas as distribui&ccedil;&otilde;es LINUX usem esta lugar como  </P>
<P>localiza&ccedil;&atilde;o  default dos diret&oacute;rios locais.</P>
<P>Em sistemas pequenos, cada diret&oacute;rio de usu&aacute;rio &eacute; um dos  subdiret&oacute;rios </P>
<P>debaixo /home, /home/dirson,  /home/raulison, /home/weslei, etc.</P>
<P>Em sistemas grande (especialmente quando  os diret&oacute;rios /home s&atilde;o </P>
<P>compartilhados entre v&aacute;rias m&aacute;quinas usando NFS) &eacute; &uacute;til subdividir os </P>
<P>diret&oacute;rios local .  A subdivis&atilde;o pode ser implementada utilizando </P>
<P>subdiret&oacute;rios tal como /home/apoio, /home/docs, /home/cartas, etc.  Muitas </P>
<P>pessoas preferem colocar as contas  dos usu&aacute;rios  numa variedade  de </P>
<P>lugares,  portanto, ningu&eacute;m dever&aacute; confiar nesta localiza&ccedil;&atilde;o.  Se voc&ecirc; </P>
<P>deseja  encontrar o diret&oacute;rio local de qualquer usu&aacute;rio, deveria  usar a </P>
<P>fun&ccedil;&atilde;o  de biblioteca getpwent em vez de contar com /etc/passwd, porque a </P>
<P>informa&ccedil;&atilde;o  pode estar armazenada remotamente usando sistemas como NIS.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.7 Sudiret&oacute;rio /lib: </P>
</B></FONT><P>Composi&ccedil;&atilde;o : Bibliotecas compartilhadas  e m&oacute;dulos do kernel essenciais.</P>
<P>&nbsp;</P>
<P>O diret&oacute;rio /lib cont&eacute;m aquelas bibliotecas compartilhadas que s&atilde;o </P>
<P>necess&aacute;ria para carregar o sistema e executar os comandos do sistema de </P>
<P>arquivos raiz.</P>
<P>M&oacute;dulos -&gt; M&oacute;dulos  de kernel carreg&aacute;veis.</P>
<P>Estes incluem em /lib/libc.so.*, /lib/libm.so.*, O linkador din&acirc;mico </P>
<P>compartilhado  /lib/ld.so.*, e outras bibliotecas  compartilhadas  </P>
<P>requeridas por arquivos em /bin e /sbin.</P>
<P>As bibliotecas  que s&atilde;o necess&aacute;rias somente  pelos arquivos /usr (como </P>
<P>qualquer arquivo  X Window) n&atilde;o pertencem a /lib.  S&oacute; as bibliotecas  </P>
<P>compartilhadas  requeridas para executar  os arquivos dentro de /bin e </P>
<P>/sbin devem estar ali.  A biblioteca libm.so.* poderia estar localizada </P>
<P>em /usr/lib se n&atilde;o &eacute; utilizada de nenhuma forma em /bin ou /sbin.</P>
<P>Por raz&atilde;o de compatibilidade, /lib/cpp necessita existir como uma </P>
<P>refer&ecirc;ncia ao pre-processador C instalado no sistema.  A localiza&ccedil;&atilde;o usual</P>
<P>do arquivo &eacute; /usr/lib/gcc-lib/ &lt;target&gt;/&lt;vers&atilde;o&gt;/cpp.  Pode existir links </P>
<P>/lib/cpp apontando para estes arquivo ou a qualquer outra refer&ecirc;ncia a ele </P>
<P>que exista no sistema de arquivos. </P>
<P>(Por exemplo, /usr/bin/cpp &eacute; utilizado freq&uuml;entemente). A especifica&ccedil;&atilde;o </P>
<P>para /lib/module ainda n&atilde;o foi definida, pois ainda n&atilde;o h&aacute; um consenso na </P>
<P>comunidade Linux.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.8 Subdiret&oacute;rio /mnt </P>
<P>&nbsp;</P>
</B></FONT><P>Composi&ccedil;&atilde;o : Utilizados para armazenamento de arquivos montados </P>
<P>temporariamente.</P>
<P>Este diret&oacute;rios foi previsto para o administrador poder montar </P>
<P>temporariamente sistemas de arquivos quando  necessitar.  O conte&uacute;do deste </P>
<P>diret&oacute;rio &eacute; um assunto local e n&atilde;o deve afetar a maneira que executamos </P>
<P>nenhum  programa. </P>
<P>&Eacute; recomendamos a n&atilde;o utiliza&ccedil;&atilde;o deste diret&oacute;rio para programas de </P>
<P>instala&ccedil;&atilde;o, e sugerimos utilizar um diret&oacute;rio tempor&aacute;rio adequado que n&atilde;o </P>
<P>esta em uso pelo sistema.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.9 Subdiret&oacute;rio /proc </P>
<P>&nbsp;</P>
</B></FONT><P>Composi&ccedil;&atilde;o : Sistema de arquivos virtual de informa&ccedil;&atilde;o de processos do  </P>
<P>kernel.</P>
<P>O sistema de arquivos proc &eacute; utilizado para  manipular informa&ccedil;&atilde;o de </P>
<P>processos e de sistema em vez de /dev/kmem e outros m&eacute;todos similares. </P>
<P>&Eacute; recomendado a utiliza&ccedil;&atilde;o deste para o armazenamento e obten&ccedil;&atilde;o </P>
<P>de informa&ccedil;&atilde;o de processos, assim como outras informa&ccedil;&atilde;o do kernel ou da </P>
<P>mem&oacute;ria.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.10 Subdiret&oacute;rio /root (opcional) </P>
<P>&nbsp;</P>
</B></FONT><P>Composi&ccedil;&atilde;o : Diret&oacute;rio local do superusu&aacute;rio (root)</P>
<P>O diret&oacute;rio / &eacute; tradicionalmente o diret&oacute;rio local do  usu&aacute;rio root nos </P>
<P>sistemas UNIX.  /root utiliza-se em muitos sistemas LINUX e em alguns </P>
<P>sistemas UNIX. O diret&oacute;rio local da conta do usu&aacute;rio root pode ser </P>
<P>determinada por prefer&ecirc;ncias locais.  As possibilidades &oacute;bvias inclui </P>
<P>em /, /root, e /home/root. Se o diret&oacute;rio local do root n&atilde;o esta </P>
<P>armazenado  na parti&ccedil;&atilde;o raiz, ser&aacute; necess&aacute;rio assegurar-se que tome </P>
<P>/ por default caso n&atilde;o seja localizado.</P>
<P>N&atilde;o &eacute; recomendado o uso da conta root para coisas corriqueiras tal como </P>
<P>ler o e-mail e ver as not&iacute;cias (mail &amp; news), recomenda-se que seja usada </P>
<P>somente para a administra&ccedil;&atilde;o do sistema. Por esta raz&atilde;o recomendamos </P>
<P>que n&atilde;o apare&ccedil;am subdiret&oacute;rios como Mail e News no diret&oacute;rio local da </P>
<P>conta do usu&aacute;rio root.  &Eacute; recomendado que o mail para root seja </P>
<P>redirecionados a um usu&aacute;rio mais adequado.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.11 Subdiret&oacute;rio /sbin:</P>
<P>&nbsp;</P>
</B></FONT><P>Composi&ccedil;&atilde;o : arquivos de  Sistema  (algumas vezes mantidos em /etc)</P>
<P>&nbsp;</P>
<P>Os utilit&aacute;rios usados pela administra&ccedil;&atilde;o do  sistema (e outros comandos </P>
<P>que somente o root utiliza) est&atilde;o armazenados em /sbin, /usr/sbin, e </P>
<P>/usr/local/sbin.  /sbin, tipicamente cont&eacute;m  arquivos essenciais para dar </P>
<P>boot ao sistema, al&eacute;m dos arquivos em /bin. Qualquer coisa que se executar </P>
<P>depois sabendo que /usr  foi montado (quando n&atilde;o h&aacute; problemas) deveria  </P>
<P>estar em /usr/sbin.  Os arquivos da administra&ccedil;&atilde;o do sistema root local </P>
<P>devem  estar em /usr/local/sbin.</P>
<P>Decidir que arquivos v&atilde;o no diret&oacute;rio de /sbin &eacute; dif&iacute;cil.  Se o usu&aacute;rio </P>
<P>necessitar execut&aacute;-lo, deve de ir para outro diret&oacute;rio.  Se somente o </P>
<P>administrador do  sistema ou o root necessitem executar, tais como scripts </P>
<P>da administra&ccedil;&atilde;o, ent&atilde;o deve ir em /sbin (n&atilde;o /usr/sbin ou  </P>
<P>/usr/local/sbin,  se o arquivo n&atilde;o &eacute; vital para a opera&ccedil;&atilde;o do sistema).</P>
<P>Arquivos como chfn que os usu&aacute;rios usam ocasionalmente devem estar em </P>
<P>/usr/bin. ping que &eacute; absolutamente necess&aacute;rio para o root &eacute; tamb&eacute;m </P>
<P>freq&uuml;entemente usado pelos usu&aacute;rios,  dever&atilde;o estar em /bin.  </P>
<P>Os usu&aacute;rios comuns n&atilde;o ter&atilde;o que por os diret&oacute;rios sbin em seu caminho </P>
<P>(path).</P>
<P>&Eacute; recomendado que os usu&aacute;rios tenham permiss&atilde;o de leitura e execu&ccedil;&atilde;o em </P>
<P>tudo que se encontra em /sbin exceto talvez certos programas; setuid e </P>
<P>setgid.  A divis&atilde;o entre /sbin e /bin n&atilde;o foi criada por motivos de </P>
<P>seguran&ccedil;a  para evitar que os usu&aacute;rios  violem o sistema operacional, foi </P>
<P>criada para promover uma boa parti&ccedil;&atilde;o entre arquivos que todos usam e os </P>
<P>que s&atilde;o utilizados principalmente para as tarefas administrativas. </P>
<P>N&atilde;o h&aacute; utilidade inerente na seguran&ccedil;a em fazer que /sbin esteja fora do </P>
<P>alcance dos usu&aacute;rios.</P>
<P>Arquivos e/ou comandos armazenados em /sbin</P>
<P>Arquivos armazenados s&atilde;o dos seguintes tipos :</P>
<P>comandos gerais;</P>
<P>comandos de sa&iacute;da;</P>
<P>comandos de manipular sistema de arquivos;</P>
<P>gerenciador de boot de inicializa&ccedil;&atilde;o e</P>
<P>comandos de rede.</P>
<P>Os comandos gerais s&atilde;o clock, gette, init, update, mkswap, swapon, swapoff,</P>
<P>telinit.</P>
<P>Os comandos de sa&iacute;da s&atilde;o fastboot, fasthalt, halt, reboot, shutdown.</P>
<P>Os comandos de manipular sistemas de arquivos s&atilde;o fdisk, fsck, fsck.*, </P>
<P>mkfs, mkfs.*, onde * = &eacute; um dos seguinte.  ext, ext2 minix, msdos, xia, e </P>
<P>talvez outros.</P>
<P>Os comandos do sistema de arquivos ext2 (opcional) s&atilde;o badbocks, dumpe2fs, </P>
<P>e2fsck, mke2fs, mkost+found, tune2fs.  O Gerenciador do  boot de </P>
<P>inicializa&ccedil;&atilde;o (lilo) e os comandos  de Rede : arp, ifconfig, route.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.11.1 Arquivos opcionais em /sbin:</P>
<P>&nbsp;</P>
</B></FONT><P>Os arquivos est&aacute;ticos (compilados estaticamente) est&atilde;o o sln e nc est&aacute;tico, nc s&atilde;o utilit&aacute;rios quando ocorrem erros. O principal uso do  sln (reparar links simb&oacute;licos incorretos em /lib depois de uma atualiza&ccedil;&atilde;o mal sucedidas) n&atilde;o &eacute; a preocupa&ccedil;&atilde;o maior, j&aacute; que existe o programa ldconfig (usualmente localizado em /usr/sbin) e pode atuar como um assistente guiando para atualizar as bibliotecas din&acirc;micas. O nc est&aacute;tico &eacute; &uacute;til em algumas ocasi&otilde;es de emerg&ecirc;ncia.  Note que estes n&atilde;o necessitam ser obrigatoriamente vers&otilde;es compiladas estaticamente dos ln e  nc, por&eacute;m podem ser compilados estaticamente.</P>
<P>O arquivo ldconfig &eacute; opcional em /sbin, dado que um usu&aacute;rio pode escolher executar  ldconfig ao dar boot, em vez de s&oacute; quando atualizam as bibliotecas compartilhadas . (N&atilde;o est&aacute; claro se &eacute; ou n&atilde;o vantajoso executar ldconfig em cada inicializa&ccedil;&atilde;o).  Assim, alguns que gostam de ter ldconfig a m&atilde;o na situa&ccedil;&atilde;o que se tem um sln, pois n&atilde;o se sabe como nomear os links.</P>
<B><FONT SIZE=4><P>2.12 Subdiret&oacute;rio /tmp  </P>
<P>&nbsp;</P>
</B></FONT><P>Composi&ccedil;&atilde;o : arquivos tempor&aacute;rios gerados por alguns arquivos utilit&aacute;rios.</P>
<P>&nbsp;</P>
<P>O /tmp &eacute; utilizado para arquivos tempor&aacute;rios, preferencialmente em </P>
<P>dispositivo r&aacute;pido (um sistema de arquivos baseados  em mem&oacute;ria por </P>
<P>exemplo).  A "perman&ecirc;ncia" da informa&ccedil;&atilde;o que &eacute; armazenada em /tmp &eacute; </P>
<P>diferente de aquela que &eacute; armazenada em /var/tmp.  /tmp pode ser limpo em </P>
<P>cada inicializa&ccedil;&atilde;o ou a intervalos relativamente freq&uuml;entemente.   </P>
<P>Portanto, n&atilde;o se deve operar a informa&ccedil;&atilde;o armazenada em /tmp permanecendo </P>
<P>por algum per&iacute;odo determinado de  tempo.</P>
<P>Os programas devem utilizar /tmp ou /var/tmp (que era originalmente </P>
<P>/usr/tmp) de acordo os requisitos esperados da informa&ccedil;&atilde;o, pois n&atilde;o devem </P>
<P>colocar nenhum arquivo particular em qualquer diret&oacute;rio de armazenamento </P>
<P>tempor&aacute;rio.</P>
<P>Os administradores  de sistemas podem querer ajuntar /tmp a algum outro </P>
<P>diret&oacute;rio, tal como /var/tmp.  Isto &eacute; &uacute;til, por exemplo, para conservar </P>
<P>espa&ccedil;o na parti&ccedil;&atilde;o raiz.  Se  est&aacute; &eacute; executada, ent&atilde;o a perman&ecirc;ncia de </P>
<P>arquivos em /var/tmp deve ser mesmo t&atilde;o grande como a de /tmp. O </P>
<P>subdiret&oacute;rio /tmp pode estar na mem&oacute;ria RAM, /var/tmp nunca poder&aacute; se l</P>
<P>ocalizar-se em algum dispositivo RAM.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.13 A hierarquia /usr.</P>
<P>&nbsp;</P>
</B></FONT><P>O subdiret&oacute;rio /usr &eacute; a segunda maior se&ccedil;&atilde;o do sistema de arquivos.  /usr </P>
<P>&eacute; informa&ccedil;&atilde;o compartilhada, somente de leitura, isto significa que /usr, </P>
<P>deve ser compartilhada entre v&aacute;rias m&aacute;quinas que utilizam o LINUX e n&atilde;o </P>
<P>deve exibir qualquer informa&ccedil;&atilde;o local de uma m&aacute;quina ou que varia com o </P>
<P>tempo, deve ser armazenada em outro lugar.</P>
<P>Nenhum pacote grande (como TeX o GNUEmacs) deve utilizar o subdiret&oacute;rio </P>
<P>direto  abaixo de /usr, em vez disso, deve haver um subdiret&oacute;rio dentro </P>
<P>/usr/lib (o /usr/local/lib caso tenha sido instalado localmente), a </P>
<P>prop&oacute;sito, como o sistema X Window faz-se uma exce&ccedil;&atilde;o permitindo  um </P>
<P>consider&aacute;vel precedente e a pr&aacute;tica amplamente aceita. Exemplo de um </P>
<P>subdiret&oacute;rio /usr t&iacute;pico :</P>
<P>&nbsp;</P>
<P>carvalho:/usr$ ls</P>
<P>X11@</P>
<P>Etc/</P>
<P>lib/</P>
<P>spool@</P>
<P>X11R6/</P>
<P>Games/</P>
<P>local/</P>
<P>src/</P>
<P>X386@</P>
<P>i486-linux/</P>
<P>man/</P>
<P>tclX/</P>
<P>adm@</P>
<P>i486-linuxaout/</P>
<P>openwin/</P>
<P>tkX/</P>
<P>bin/</P>
<P>i486-sysv4/</P>
<P>preserve@</P>
<P>tmp@</P>
<P>dict/</P>
<P>Include/</P>
<P>sbin/</P>
<P>doc/</P>
<P>Info/</P>
<P>share/</P>
<P>carvalho:/usr$</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.13.1 Subdiret&oacute;rios  /usr (permanente)</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;Em um sistema t&iacute;pico teremos mais ou menos os seguintes diret&oacute;rio :</P>
<P>X11R6</P>
<P>Sistema X Window Vers&atilde;o 11 release 6</P>
<P>X386</P>
<P>Sistema X Window Vers&atilde;o 11 release 5 em plataformas  X 386</P>
<P>Bin</P>
<P>A maioria dos comandos de usu&aacute;rio</P>
<P>Dict</P>
<P>Listas de palavras</P>
<P>Doc</P>
<P>Documenta&ccedil;&atilde;o miscel&acirc;nea</P>
<P>Etc</P>
<P>Configura&ccedil;&atilde;o do  Sistema</P>
<P>Games</P>
<P>Jogos e arquivos educacionais</P>
<P>Include</P>
<P>arquivos header(cabe&ccedil;alhos)  inclu&iacute;dos por programas C</P>
<P>Info</P>
<P>Diret&oacute;rio prim&aacute;rio, o  sistema GNU Info</P>
<P>Lib</P>
<P>Bibliotecas</P>
<P>Local</P>
<P>Hierarquia local </P>
<P>Man</P>
<P>Manual on line</P>
<P>Sbir</P>
<P>Arquivos de Administra&ccedil;&atilde;o do  Sistema n&atilde;o vitais</P>
<P>Share</P>
<P>Informa&ccedil;&atilde;o  independente da arquitetura</P>
<P>Src</P>
<P>C&oacute;digo fonte</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Os seguinte links simb&oacute;licos a diret&oacute;rios podem estar presentes.  Esta </P>
<P>possibilidade baseia-se na necessidade de preservar a compatibilidade com </P>
<P>sistemas anteriores haja visto que em todas as implementa&ccedil;&otilde;es pode </P>
<P>assumir o uso da hierarquia /var, poder&atilde;o existir os seguintes links :</P>
<P>&nbsp;</P>
<P>/usr/adm&#9;&#9;------------------&gt;&#9;/var/adm&#9;</P>
<P>/usr/pr&eacute;erve&#9;------------------&gt;&#9;/var/pr&eacute;erve&#9;</P>
<P>/usr/spool&#9;&#9;------------------&gt;&#9;/var/spool&#9;</P>
<P>/usr/tmp&#9;&#9;------------------&gt;&#9;/var/tmp&#9;</P>
<P>/var/spool/locks&#9;------------------&gt;&#9;/var/lock&#9;</P>
<P>&#9;</P>
<P>Uma vez que o sistema n&atilde;o precise mais de alguns dos liks anteriores, deve </P>
<P>existir um links deste /usr/X11 apontando para a hierarquia do  sistema X </P>
<P>Window atual.</P>
<P>Subdiret&oacute;rio /usr/X386</P>
<P>&Eacute; composta do sistema X Window, vers&atilde;o 11 release 5 em plataformas X 86, </P>
<P>esta hierarquia &eacute; geralmente id&ecirc;ntica a /usr/X11R6, exceto que os links </P>
<P>simb&oacute;licos de /usr devem  estar ausente se estiver instalado  /usr/X11R6.</P>
<P>Subdiret&oacute;rio /usr/bin  </P>
<P>&Eacute; composta da maioria dos comandos do  usu&aacute;rio, este &eacute; o diret&oacute;rio </P>
<P>principal  de comandos execut&aacute;veis no sistema possui o mh (comandos para o </P>
<P>sistema de manipular  e-mail MH) e o X11 (link simb&oacute;lico at&eacute; </P>
<P>/usr/X11R6/bin).</P>
<P>Os interpretadores de scripts dos shell (invocados com #! &lt;rota&gt; na </P>
<P>primeira linha do  script de shell) n&atilde;o podem depender de uma rota, &eacute; </P>
<P>vantajoso o padronizar a localiza&ccedil;&atilde;o  dos elos.  A shell Bourne e C &eacute; t&atilde;o </P>
<P>fixos em /bin, pois Perl, Pethon, Tlc se encontram em muitos lugares </P>
<P>diferentes /usr/bin/perl, /usr/bin/pethon e /usr/bin/tcl devem possuir </P>
<P>refer&ecirc;ncias a os interpretador de shell perl, pethon e tcl respectivamente.</P>
<P>Estes podem ser links simb&oacute;licos a  localiza&ccedil;&atilde;o  f&iacute;sica dos interpretador </P>
<P>da shell.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.13.2 Subdiret&oacute;rio /usr/dict - Listas de palavras </P>
<P>&nbsp;</P>
</B></FONT><P>Arquivos recomendados em /usr/dict (words), tradicionalmente esta diret&oacute;rio</P>
<P>cont&eacute;m somente arquivos words de palavras inglesas, o qual &eacute; utilizado  por "look" para v&aacute;rios programas de ortografia, words pode utilizar </P>
<P>ortografia americana ou brit&acirc;nica.  Os usu&aacute;rios que precisam ambos, podem </P>
<P>concatenar words a /usr/dict/american-english ou /usr/dict/ </P>
<P>british-english.</P>
<P>As listas de palavras para outros linguagem pode usar o nome em ingl&ecirc;s </P>
<P>para a linguagem, por exemplo, /usr/dict/french, /usr/dict/danish, etc.  </P>
<P>Estes devem, se poss&iacute;vel, utilizar o jogos de caracteres ISO 8859 que </P>
<P>faz apropriado  para linguagem em quest&atilde;o, e se  poss&iacute;vel, o jogo de </P>
<P>caracteres ISO 8859-1 (Atin1) deve ser utilizado  (muito raramente &eacute; </P>
<P>poss&iacute;vel faz&ecirc;-lo). Qualquer outra lista de palavras, tal como o diret&oacute;rio </P>
<P>web2, deve ser inclu&iacute;do  aqui. &Eacute; razo&aacute;vel ter aqui s&oacute; as listas de palavras,</P>
<P>e que elas s&atilde;o os &uacute;nicos arquivos comum a todos os verificadores de </P>
<P>ortografia.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.13.3 Subdiret&oacute;rio /usr/etc</P>
<P>&nbsp;</P>
</B></FONT><P>Cont&eacute;m a configura&ccedil;&atilde;o do sistema, por&eacute;m armazenar a configura&ccedil;&atilde;o /usr/etc </P>
<P>do  software que se encontra em /usr/bin e /usr/sbin &eacute; um problema. </P>
<P>Montar /usr somente para leitura  de um CD-ROM ou atrav&eacute;s de NFS &eacute; dif&iacute;cil </P>
<P>no melhor dos casos.</P>
<P>Uma poss&iacute;vel solu&ccedil;&atilde;o que considerada foi eliminar completamente /usr/etc e </P>
<P>especificar que todas as configura&ccedil;&otilde;es se armazenem em /etc.  Acontece que </P>
<P>existe a  possibilidade de que muitos site podem querer ter alguns arquivos </P>
<P>de configura&ccedil;&atilde;o que n&atilde;o estejam na sua m&aacute;quina local.</P>
<P>Eventualmente, decide-se que /etc dever&aacute; ser o &uacute;nico diret&oacute;rio que seja </P>
<P>referenciado pelos programas (Isto &eacute;, todos devem buscar configura&ccedil;&otilde;es em </P>
<P>/etc e n&atilde;o /usr/etc).  Qualquer arquivo de configura&ccedil;&atilde;o que necess&aacute;rio </P>
<P>para todo o sistema e que n&atilde;o era necess&aacute;rio antes de montar /usr (em uma </P>
<P>situa&ccedil;&atilde;o de emerg&ecirc;ncia deve estar localizado em /usr/etc).  Arquivos </P>
<P>espec&iacute;ficos em /etc, em m&aacute;quinas espec&iacute;ficas podem ter ou n&atilde;o um link </P>
<P>simb&oacute;licos aos arquivos de configura&ccedil;&atilde;o localizados em /usr/etc. Isto </P>
<P>tamb&eacute;m significa que /usr/etc &eacute; tecnicamente um diret&oacute;rio opcional no </P>
<P>sentido restrito, mesmo assim recomendamos que todos os sistemas LINUX o </P>
<P>incorporem.</P>
<P>N&atilde;o &eacute; recomendado que /usr/etc contenha links simb&oacute;licos que apontem para </P>
<P>arquivos /etc. Isto &eacute; desnecess&aacute;rio e interferem no controle local das </P>
<P>m&aacute;quinas que compartem  o diret&oacute;rio/usr.</P>
<P>Subdiret&oacute;rio  /usr/include</P>
<P>Neste diret&oacute;rio &eacute; onde todos os arquivos include de uso geral do sistema </P>
<P>para programa&ccedil;&atilde;o em linguagem C e C++ podem ser localizados.</P>
<P>&nbsp;</P>
<P>Descri&ccedil;&atilde;o dos principais subdiret&oacute;rios de /usr/include :&#9;</P>
<P>/usr/include&#9;arquivos include&#9;&#9;</P>
<P>X11&#9;Link simb&oacute;lico at&eacute; /usr/X11R6/include/X11&#9;&#9;</P>
<P>arpa&#9;Defini&ccedil;&atilde;o do  protocolo definido  por  ARPNET.&#9;&#9;</P>
<P>asm&#9;Link simb&oacute;lico at&eacute; /usr/scr/linux/include/asm-&lt;arch&gt;.&#9;&#9;</P>
<P>bsd&#9;arquivos include de compatibilidade com BSD.&#9;&#9;</P>
<P>g++&#9;arquivos include de GNU C++.&#9;&#9;</P>
<P>gnu&#9;arquivos include GNU.&#9;&#9;</P>
<P>linux&#9;Link simb&oacute;lico a /usr/src/linux/include/linux.&#9;&#9;</P>
<P>net&#9;Defini&ccedil;&atilde;o gen&eacute;ricas relacionadas com rede.&#9;&#9;</P>
<P>netax25&#9;Defini&ccedil;&atilde;o espec&iacute;ficas a  +AX25 ( ARRL AX25).&#9;&#9;</P>
<P>Netinet&#9;Defini&ccedil;&atilde;o espec&iacute;ficas a  TCP/IP.&#9;&#9;</P>
<P>netipx&#9;Defini&ccedil;&atilde;o espec&iacute;ficas a +IPX (NovOIPX/SPX).&#9;&#9;</P>
<P>protocols&#9;Defini&ccedil;&atilde;o de protocolos( baseadas em  INET)&#9;&#9;</P>
<P>readline&#9;A biblioteca readline GNU.&#9;&#9;</P>
<P>rpc&#9;Defini&ccedil;&atilde;o RPC de Sun Microsystem.&#9;&#9;</P>
<P>Rpcsvc&#9;Defini&ccedil;&atilde;o de servi&ccedil;os RPC de Sun Microsystem.&#9;&#9;</P>
<P>sys&#9;arquivos  include de gera&ccedil;&atilde;o de sistemas&#9;</P>
<P>&nbsp;</P>
<P>O subdiret&oacute;rio arpa cont&eacute;m  defini&ccedil;&otilde;es de header de protocolos para os </P>
<P>protocolos ARPANET, TCP/IP, defini&ccedil;&otilde;es para ftp, prot&oacute;tipos telnet e </P>
<P>material similar.</P>
<P>O subdiret&oacute;rio net cont&eacute;m  defini&ccedil;&otilde;es gen&eacute;ricas relacionadas com a rede, </P>
<P>define a interface sistema vs. kernel, detalhes da fam&iacute;lia de protocolo,etc.</P>
<P>O subdiret&oacute;rio netinet cont&eacute;m  defini&ccedil;&otilde;es espec&iacute;ficas de INET (DARPA </P>
<P>Internet, que tamb&eacute;m &eacute; contida no TCP/IP )</P>
<P>ARRL AX.25 &eacute; melhor conhecido como pacote de transmiss&atilde;o via radio (packet </P>
<P>radio). Os protocolos novell IPX/SPX s&atilde;o parte dos servi&ccedil;os de arquivos </P>
<P>Novell Netware.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.13.4  Subdiret&oacute;rio /usr/lib</P>
<P>&nbsp;</P>
</B></FONT><P>Inclui as bibliotecas para programas e pacotes, inclui as bibliotecas </P>
<P>objeto, arquivos de  programa compilador, informa&ccedil;&atilde;o est&aacute;tica de v&aacute;rias </P>
<P>casos, ambos, c&oacute;digos execut&aacute;vel (por exemplo os arquivos internos de gcc </P>
<P>est&atilde;o localizados  abaixo /usr/lib/gcc-lib) e outros tipos de informa&ccedil;&atilde;o. </P>
<P>&nbsp;</P>
<P>/usr/lib/ - bibliotecas para programa&ccedil;&atilde;o e pacotes:</P>
<P>&nbsp;</P>
<P>X11&#9;Link simb&oacute;lico para /usr/X11R6/lib/X11&#9;</P>
<P>emacs&#9;arquivos de suporte est&aacute;ticos para o editor GNUEmacs.&#9;</P>
<P>games&#9;arquivos de dados est&aacute;ticos para /usr/games.&#9;</P>
<P>groff&#9;Bibliotecas / diret&oacute;rios  para GNU groff&#9;</P>
<P>gcc-lib&#9;arquivos/diret&oacute;rios  espec&iacute;ficos do  sistema para gcc.&#9;</P>
<P>kbd&#9;Tabelas de tradu&ccedil;&atilde;o de teclado e informa&ccedil;&atilde;o  relacionada.&#9;</P>
<P>Mh&#9;Bibliotecas para o sistema de manipular  e-mail MH:&#9;</P>
<P>news&#9;Cnews/INN.&#9;</P>
<P>smail&#9;Smail.&#9;</P>
<P>terminfo&#9;diret&oacute;rios  para a base de dados terminfo.&#9;</P>
<P>texmf&#9;TeX/MF ( e ATeX ) bibliotecas  de informa&ccedil;&atilde;o.&#9;</P>
<P>uucp&#9;Comandos  de  UUCP.&#9;</P>
<P>zoneinfo&#9;Configura&ccedil;&atilde;o e informa&ccedil;&atilde;o  da zona hor&aacute;ria.&#9;</P>
<P>&nbsp;</P>
<P>Historicamente, /usr/lib &eacute; inclu&iacute;do al&eacute;m disso alguns comandos execut&aacute;veis </P>
<P>tais como sendmail e makewhatis.</P>
<P>Dado  que makewhatis n&atilde;o &eacute; referenciado  por outros programas, n&atilde;o h&aacute; </P>
<P>problemas ao mover para um diret&oacute;rio de arquivos execut&aacute;veis. Arquivos que </P>
<P>os usu&aacute;rios precisam para usar makewhatis, /usr/lib de onde pertencem. </P>
<P>O arquivo catman que repassa ao script makewhatis em muitos sistemas LINUX,</P>
<P>deve tamb&eacute;m estar em usr/bin.</P>
<P>O arquivo sendmail &eacute; referenciado  por muitos programas com seu nome </P>
<P>hist&oacute;rico /usr/lib/sendmail. Este deve ser um links simb&oacute;lico, a  </P>
<P>localiza&ccedil;&atilde;o layout  para os agente de transfer&ecirc;ncia de e-mail com uma </P>
<P>interface de linha de comando compat&iacute;vel com o sendmail, /usr/bin/sendmail.</P>
<P>Em sistemas que utilizam smail devem localizar smail em /usr/sbin/smail e </P>
<P>/usr/bin/sendmail deve ser um links simb&oacute;lico a smail.</P>
<P>Este regra vai de encontro tamb&eacute;m com a  nova ocorr&ecirc;ncia no layout sendmail </P>
<P>definida em Sendmail 8.6.x e BSD 4.4.</P>
<P>Note que esta localiza&ccedil;&atilde;o requer que /usr/sbin e /usr/sbin/sendmail devem </P>
<P>ser execut&aacute;veis para usu&aacute;rios  normais.</P>
<P>Qualquer pacote de programa que contenha  e precisa  informa&ccedil;&atilde;o  que n&atilde;o </P>
<P>necessite ser modificada deve armazenar tal informa&ccedil;&atilde;o em /usr/lib (o </P>
<P>/usr/local/lib, esta instalado  localmente). Recomenda-se a utiliza&ccedil;&atilde;o </P>
<P>de um subdiret&oacute;rio em /usr/lib para este prop&oacute;sito.</P>
<P>A informa&ccedil;&atilde;o de jogos armazenada em /usr/lib/games deve ser apenas </P>
<P>informa&ccedil;&atilde;o  est&aacute;tica. Qualquer arquivo modific&aacute;vel  tal como arquivos </P>
<P>demarcado, registros de jogos e similar, devem de ser localizados em </P>
<P>/var/lib. </P>
<P>&Eacute; necess&aacute;rio para compatibilidade de jogos, pode-se usar um links simb&oacute;lico </P>
<P>desde /usr/games/lib at&eacute; /usr/lib/games.</P>
<P>Nota: nenhuma informa&ccedil;&atilde;o especifica de host para o sistema X Window deve </P>
<P>armazenar-se em /usr/lib/X11 (que &eacute; realmente /usr/X11R6/lib/X11). Os </P>
<P>arquivos de configura&ccedil;&atilde;o espec&iacute;ficos do host tal como Xconfig o XF86Config </P>
<P>devem ser armazenados  em /etc/X11. Este deve incluir informa&ccedil;&atilde;o  de </P>
<P>configura&ccedil;&atilde;o como o stem.twmrc, se for somente um links simb&oacute;lico, um </P>
<P>arquivo de configura&ccedil;&atilde;o mais global (talvez em /usr/etc/X11 ou </P>
<P>/usr/X11R6/lib/X11).</P>
<P>&nbsp;</P>
<P>Subdiret&oacute;rio /usr/local</P>
<P>A hierarquia /usr/local est&aacute; para ser utilizada pelo administrador de </P>
<P>sistemas quando  instala o Linux localmente. Necessita ficar a salvo de </P>
<P>ser sobrescrito quando  o software  do  sistema se atualiza. Pode ser usado</P>
<P>por programas e por informa&ccedil;&atilde;o  que s&atilde;o compat&iacute;vel entre um grupo m&aacute;quinas,</P>
<P>pois n&atilde;o se encontram em /usr.</P>
<P>&nbsp;</P>
<P>/usr/local&#9;Diret&oacute;rios da Hierarquia local</P>
<P>bin&#9;&#9;arquivos&#9;</P>
<P>doc&#9;&#9;Documenta&ccedil;&atilde;o local&#9;</P>
<P>etc&#9;&#9;arquivos de configura&ccedil;&atilde;o utilizados somente no local&#9;</P>
<P>games&#9;Jogos instalados localmente&#9;</P>
<P>lib&#9;&#9;Bibliotecas para /usr/local&#9;</P>
<P>info&#9;&#9;P&aacute;ginas de informa&ccedil;&atilde;o local&#9;</P>
<P>man&#9;Hierarquias de p&aacute;ginas de manual para /usr/local&#9;</P>
<P>sbin&#9;Administra&ccedil;&atilde;o do  sistema&#9;</P>
<P>scr&#9;&#9;C&oacute;digo fonte local.&#9;</P>
<P>&nbsp;</P>
<P>Este diret&oacute;rio deve estar vazio ao terminar de instalar o LINUX pela </P>
<P>primeira vez. N&atilde;o deve haver exce&ccedil;&otilde;es  a regra , exceto os subdiret&oacute;rios </P>
<P>vazios listados.</P>
<P>O software  instalado localmente deve estar localizado  dentro de </P>
<P>/usr/local, em vez de /usr a menos que esteja sendo  instalado  para </P>
<P>reimplantar ou atualizar software em /usr.</P>
<P>Note que o software localizado em / ou em /usr pode ser sobrescrito por </P>
<P>atualiza&ccedil;&otilde;es do sistema (assim mesmo, &eacute; recomendado que as distribui&ccedil;&otilde;es </P>
<P>n&atilde;o sobrescrevam informa&ccedil;&otilde;es /etc fora destas circunst&acirc;ncias). </P>
<P>Por esta raz&atilde;o, o software local n&atilde;o deve se colocado fora de /usr/local </P>
<P>sem uma boa causa.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>2.13.5 Subdiret&oacute;rio  /usr/man </P>
<P>&nbsp;</P>
</B></FONT><P>Inclui as paginas do  manual, &#9;detalha a organiza&ccedil;&atilde;o das p&aacute;ginas do </P>
<P>manual atrav&eacute;s do  sistema, devem estar dentro de /usr/man.</P>
<P>As p&aacute;ginas do  manual est&atilde;o armazenadas &lt;mandir&gt;/&lt;locais&gt;/man [1-9]. </P>
<P>Faremos uma pequena listagem de &lt;mandir&gt; e &lt;locais&gt; :</P>
<P>&nbsp;</P>
<P>&lt;mandir&gt;/&lt;locais&gt; &#9;uma hierarquia de p&aacute;ginas de manual.&#9;</P>
<P>man1&#9;Programas para usu&aacute;rios.&#9;</P>
<P>man2&#9;Chamadas do sistema.&#9;</P>
<P>man3&#9;Subrotinas e fun&ccedil;&otilde;es de biblioteca.&#9;</P>
<P>man4&#9;Dispositivos.&#9;</P>
<P>man5&#9;Formatos  arquivos.&#9;</P>
<P>man6&#9;Jogos.&#9;</P>
<P>man7&#9;Miscel&acirc;neas.&#9;</P>
<P>man8&#9;Administra&ccedil;&atilde;o do  Sistema.&#9;</P>
<P>man9&#9;Fun&ccedil;&otilde;es e vari&aacute;veis internas do  kernel.&#9;</P>
<P>&nbsp;</P>
<P>O &lt;mandir&gt; prim&aacute;rio do sistema &eacute; /usr/man cont&eacute;m informa&ccedil;&atilde;o do manual para </P>
<P>comandos e informa&ccedil;&atilde;o abaixo dos sistemas de arquivos / e /usr. Obviamente </P>
<P>n&atilde;o h&aacute; p&aacute;ginas de manual em  / porque n&atilde;o se necessitam  para carregar nas </P>
<P>emerg&ecirc;ncias.</P>
<P>Deve-se fazer reserva na estrutura de /usr/man para o suporte de p&aacute;ginas do</P>
<P>manual que est&atilde;o escritas em diferentes idiomas (m&uacute;ltiplos idiomas). Estas </P>
<P>provid&ecirc;ncias devem levar em conta o armazenamento e refer&ecirc;ncia destas </P>
<P>p&aacute;ginas do  manual. Os fatores relevantes incluir no idioma (inclui </P>
<P>diferen&ccedil;as baseadas na geografia) e c&oacute;digo do  conjunto  caracteres.</P>
<P>Esta nomenclatura dos subdiret&oacute;rios de idiomas de /usr/man esta baseada no </P>
<P>ap&ecirc;ndice e do padr&atilde;o POSIX 1003.1 que descreve a cadeia de identifica&ccedil;&atilde;o </P>
<P>locais.</P>
<P>O m&eacute;todo  mas aceito para descrever um ambiente cultural. A cadeia &lt;locais&gt;</P>
<P>&eacute;:&lt;idioma&gt;[&lt;_territorio&gt;][.&lt;conjunto_de_caracteres&gt;][,&lt;vers&atilde;o&gt;]</P>
<P>O campo &lt;idioma&gt; vem do  ISO639 (um c&oacute;digo para a representa&ccedil;&atilde;o dos nomes </P>
<P>dos idiomas).  Seja os caracteres especificado no padr&atilde;o ISO, com </P>
<P>min&uacute;sculas somente.</P>
<P>O campo &lt;_territ&oacute;rio&gt; ser&aacute; o c&oacute;digo  das letras de ISO3116 (uma </P>
<P>especifica&ccedil;&atilde;o da representa&ccedil;&atilde;o dos nomes dos pa&iacute;ses, se  poss&iacute;vel (muita </P>
<P>gente est&aacute; familiarizada com o c&oacute;digo  2 letras espelhado no c&oacute;digo  pa&iacute;s </P>
<P>como e-mail).</P>
<P>O campo &lt;conjunto _de _caracteres&gt; deve representar o layout que descreve o</P>
<P>c&oacute;digo  caracteres. Se o campo &lt;conjunto _de _caracteres&gt; &eacute; s&oacute; uma </P>
<P>especifica&ccedil;&atilde;o num&eacute;rica, o n&uacute;mero representa o n&uacute;mero do  layout </P>
<P>internacional que descreve o conjunto  caracteres.  Recomenda-se que </P>
<P>utilizar uma representa&ccedil;&atilde;o num&eacute;rica, sempre que for poss&iacute;vel (especialmente</P>
<P>o padr&atilde;o ISO), que n&atilde;o inclua s&iacute;mbolos de pontua&ccedil;&atilde;o e que todas as letras </P>
<P>sejam min&uacute;sculas.</P>
<P>Um par&acirc;metro que especifique &lt;vers&atilde;o&gt; do  perfil pode ser colocada depois </P>
<P>do  campo &lt;conjunto _de _caracteres &gt;. Esta pode utilizar-se para </P>
<P>diferenciar as necessidade culturais.</P>
<P>Em sistemas que usem s&oacute; um idioma e um c&oacute;digo do conjunto de caracteres </P>
<P>para todas as p&aacute;ginas do  manual, pode-se omitir a subcadeia &lt;locais&gt; e </P>
<P>armazenar todas as p&aacute;ginas do  manual em &lt;mandir&gt;. Por exemplo no  sistemas </P>
<P>que s&oacute; tem p&aacute;ginas do  manual em ingl&ecirc;s codificados  na ASCII, podem </P>
<P>armazenar as p&aacute;ginas do manual (Os diret&oacute;rios  man[1-9]) diretamente em </P>
<P>/usr/man.</P>
<P>Em pa&iacute;ses nos quais existe um c&oacute;digo do conjunto  caracteres no layout, </P>
<P>pode omitir o campo &lt;conjunto _de _caracteres&gt;, por&eacute;m &eacute; bastante </P>
<P>recomendado que a inclua,  especialmente para pa&iacute;ses com v&aacute;rios layouts.</P>
<P>Exemplos de v&aacute;rios manuais encontrados : </P>
<P>&nbsp;</P>
<P>Idioma</P>
<P>Pa&iacute;ses</P>
<P>Conjunto  caracteres</P>
<P>Diret&oacute;rio </P>
<P>Ingl&ecirc;s</P>
<P>-</P>
<P>ASCII</P>
<P>/usr/man/em</P>
<P>Ingl&ecirc;s</P>
<P>Reino Unido</P>
<P>ASCII</P>
<P>/usr/man/em_GB</P>
<P>Ingl&ecirc;s</P>
<P>Estados Unidos</P>
<P>ASCII</P>
<P>/usr/man/em_US</P>
<P>Franc&ecirc;s</P>
<P>Canad&aacute;</P>
<P>ISO8859-1</P>
<P>/usr/man/fr_CA</P>
<P>Franc&ecirc;s</P>
<P>Fran&ccedil;a</P>
<P>ISO8859-1</P>
<P>/usr/man/fr_FR</P>
<P>Alem&atilde;o</P>
<P>Alemanha</P>
<P>ISO646-DE</P>
<P>/usr/man/de_DE646de</P>
<P>Alem&atilde;o</P>
<P>Alemanha</P>
<P>ISO6937</P>
<P>/usr/man/de_DE6937</P>
<P>Alem&atilde;o</P>
<P>Alemanha</P>
<P>ISO8859-1</P>
<P>/usr/man/de_DE.88591</P>
<P>Alem&atilde;o</P>
<P>Su&iacute;&ccedil;a</P>
<P>ISO646-CH</P>
<P>/usr/man/de_CH.646ch</P>
<P>Japon&ecirc;s</P>
<P>Jap&atilde;o</P>
<P>JIS</P>
<P>/usr/man/ja_JP.jis</P>
<P>Japon&ecirc;s</P>
<P>Jap&atilde;o</P>
<P>SJCS</P>
<P>/usr/man/ja_JP.sjis</P>
<P>Japon&ecirc;s</P>
<P>Jap&atilde;o</P>
<P>UJ (&oacute; EUC-J)</P>
<P>/usr/man/ja_JP.ujis</P>
<P>&nbsp;</P>
<P>As p&aacute;ginas do manual para os comandos e informa&ccedil;&atilde;o que se encontra abaixo </P>
<P>/usr/local est&atilde;o armazenadas em /usr/local/man. As p&aacute;ginas do manual para </P>
<P>o sistema X Window est&atilde;o armazenadas em /usr/X11R6/man. Logo todas as </P>
<P>hierarquias de p&aacute;ginas do  manual no sistema devem ter a mesma estrutura </P>
<P>que /usr/man. Os diret&oacute;rios  vazios podem ser omitidos da hierarquia de </P>
<P>p&aacute;ginas do manual. Por exemplo se, /usr/local/man n&atilde;o tem p&aacute;ginas do  </P>
<P>manual na  se&ccedil;&atilde;o 4 (dispositivos) ent&atilde;o se pode omitir /usr/local/man/man4.</P>
<P>As se&ccedil;&otilde;es da p&aacute;ginas cat (cat[1-9]) que cont&eacute;m p&aacute;ginas do manual formatadas,</P>
<P>tamb&eacute;m se encontram dentro os subdiret&oacute;rios /&lt;mandir&gt;/&lt;locais&gt;, pois n&atilde;o </P>
<P>s&atilde;o requeridas nem devem ser distribu&iacute;das no lugar das fonte nroff das </P>
<P>p&aacute;ginas do manual.</P>
<P>As p&aacute;ginas do Manual do sistema de manipula&ccedil;&atilde;o de e-mail  mh devem ter o </P>
<P>prefixo mh em todos os nomes de arquivos das p&aacute;ginas.</P>
<P>As p&aacute;ginas do  sistema X Window devem de ter o prefixo X em todos os nomes </P>
<P>dos arquivos das p&aacute;ginas. </P>
<P>A pr&aacute;tica de colocar as p&aacute;ginas do  manual de diferentes idiomas, nos </P>
<P>subdiret&oacute;rios apropriados de /usr/man tamb&eacute;m se aplica a as outras </P>
<P>hierarquias de p&aacute;ginas do  manual, tais como /usr/local/man e </P>
<P>/usr/X11R6/man. </P>
<P>Isto tamb&eacute;m &eacute; aplic&aacute;vel a estrutura opcional de /var/catman, mostrada no </P>
<P>subdiret&oacute;rio /var.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>Subdiret&oacute;rio /usr/sbin</P>
<P>&nbsp;</P>
</B></FONT><P>Este diret&oacute;rio cont&eacute;m quaisquer arquivo n&atilde;o essenciais utilizado </P>
<P>exclusivamente pelo administrador  do  sistema.</P>
<P>Os programas de administra&ccedil;&atilde;o do sistema que sejam utilizados para a </P>
<P>repara&ccedil;&atilde;o do  sistema, montado no /usr, outras fun&ccedil;&otilde;es essenciais devem </P>
<P>localizar-se em /sbin em vez de /usr/bin.</P>
<P>Tipicamente /usr/sbin cont&eacute;m os deamons de rede, quaisquer ferramenta de </P>
<P>administra&ccedil;&atilde;o n&atilde;o essenciais e arquivos para programas servidores n&atilde;o - </P>
<P>cr&iacute;ticos. Estes inclui os deamons da INTERNET que s&atilde;o chamados por inted </P>
<P>(chamados in.*) tais como in.telnetd e in.fingerd e os deamons baseados em </P>
<P>rpc manipulados por portmap (chamados rcp.*), tais como rcp.infsd e </P>
<P>rcp.mountd.</P>
<P>Estes programas servidores s&atilde;o utilizados quando ocorre um estado  que o </P>
<P>System  V conhece como "run levO2" (estado multiusu&aacute;rio) e o "run levO3" </P>
<P>(estado em rede) ou estado  que o BSD conhece como "modo multi - usu&aacute;rio", </P>
<P>neste ponto ficam dispon&iacute;veis os servi&ccedil;os para os usu&aacute;rios (suporte de </P>
<P>impress&atilde;o) e at&eacute; outras m&aacute;quinas (por exemplo, exportar NFS).</P>
<P>Os programas administrativos instalados localmente devem estar localizados  </P>
<P>em: /usr/local/sbin.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>Subdiret&oacute;rio /usr/share </P>
<P>&nbsp;</P>
</B></FONT><P>S&atilde;o informa&ccedil;&atilde;o  que independente da arquitetura, quaisquer especifica&ccedil;&atilde;o </P>
<P>para /usr/share ser&aacute; inclu&iacute;da em um documento suplementar ao FSSTND, de </P>
<P>acordo com a Linux Organization, os pesquisadores do FSSTND acham que </P>
<P>/usr/share n&atilde;o &eacute; necess&aacute;rio na maioria dos sistemas Linux.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>Subdiret&oacute;rio /usr/src </P>
<P>&nbsp;</P>
</B></FONT><P>Cont&eacute;m o  C&oacute;digo fonte para o kernel do Linux, qualquer c&oacute;digo fonte n&atilde;o </P>
<P>local deve localizar-se neste diret&oacute;rio . O &uacute;nico c&oacute;digo fonte que sempre </P>
<P>deve localizar-se em um lugar espec&iacute;ficos &eacute; o c&oacute;digo do  kernel(quando  </P>
<P>exista ou  esteja enla&ccedil;ado como parte de uma estrutura /usr/include). </P>
<P>Podem-se usar subdiret&oacute;rios que desejar.</P>
<P>O c&oacute;digo fonte para Kernel deve sempre estar em seu lugar mesmos. Os </P>
<P>arquivos include do  c&oacute;digo do  kernel. Esses arquivos est&atilde;o localizados  </P>
<P>neste diret&oacute;rios.</P>
<P>&nbsp;</P>
<P>/usr/src/linux/include/asm-&lt;arch&gt;</P>
<P>/usr/src/linux/include/linux</P>
<P>&nbsp;</P>
<P>/usr/include deve conter links a estes diret&oacute;rios, chamados asm e linux, </P>
<P>dados que s&atilde;o necessitados pelo compilador de C, ao menos estes arquivos </P>
<P>include devem sempre ser distribu&iacute;dos nas instala&ccedil;&otilde;es que incluem </P>
<P>um compilador  C. Devem ser distribu&iacute;dos no diret&oacute;rio/usr/src/linux de </P>
<P>forma que n&atilde;o existam problemas quanto os administradores  do  sistema </P>
<P>atualizem sua vers&atilde;o do  kernel pela primeira vez.</P>
<P>&nbsp;</P>
<P>/usr/src/linux pode tamb&eacute;m ser um links simb&oacute;lico a um &aacute;rvore de c&oacute;digo </P>
<P>fonte do  kernel.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>2.14 A Hierarquia /var</P>
<P>&nbsp;</P>
</B></FONT><P>/var</P>
<P>Informa&ccedil;&atilde;o  vari&aacute;vel</P>
<P>Adm</P>
<P>Informa&ccedil;&otilde;es administrativa do  sistema (obsoleto). Link simb&oacute;lico at&eacute;</P>
<P>&nbsp;</P>
<P> /var/og</P>
<P>Catman</P>
<P>P&aacute;ginas do  manual formatadas localmente</P>
<P>Lib</P>
<P>Informa&ccedil;&atilde;o  do estado das  aplica&ccedil;&otilde;es</P>
<P>Local</P>
<P>Informa&ccedil;&atilde;o  vari&aacute;vel do  software de /usr/local</P>
<P>Ock</P>
<P>Arquivos de bloqueio</P>
<P>Og</P>
<P>Arquivos de Agenda</P>
<P>Named</P>
<P>Arquivos DNS, somente rede</P>
<P>Nis</P>
<P>Arquivos base de dados NIS</P>
<P>Nis</P>
<P>Arquivos base de dados NIS</P>
<P>Nis</P>
<P>Arquivos base de dados NIS</P>
<P>Run</P>
<P>arquivos relevantes a processos execu&ccedil;&atilde;o do sistema</P>
<P>spool&#9;</P>
<P>Diret&oacute;rios de trabalhos  em fila para realizar-se depois</P>
<P>tmp&#9;</P>
<P>arquivos tempor&aacute;rios, utilizado  para manter /tmp menor poss&iacute;vel</P>
<P>&nbsp;</P>
<P>/var cont&eacute;m arquivos com informa&ccedil;&atilde;o  vari&aacute;vel. Esta incluem arquivos e </P>
<P>diret&oacute;rios  em fila de execu&ccedil;&atilde;o, informa&ccedil;&atilde;o  de ordem administrativa e </P>
<P>arquivos tempor&aacute;rios e transit&oacute;rios.</P>
<P>Algumas por&ccedil;&atilde;o de /var s&atilde;o n&atilde;o compat&iacute;vel entre diferentes sistemas. Por </P>
<P>exemplo, /var/og, /var/ock e /var/run. Outras por&ccedil;&atilde;o s&atilde;o compat&iacute;vel, </P>
<P>notoriamente /var/spool/mail e  /var/spool/news.</P>
<P>/var &eacute; especificada aqui para fazer poss&iacute;vel montar /usr somente para </P>
<P>leitura. Tudo  aquilo que alguma vez ficou em /usr &eacute; escrito durante a </P>
<P>opera&ccedil;&atilde;o normal do sistema (n&atilde;o durante a instala&ccedil;&atilde;o e manuten&ccedil;&atilde;o do </P>
<P>software) deve ir em /var.</P>
<P>Se /var n&atilde;o pode ser uma participa&ccedil;&atilde;o separada, &eacute; prefer&iacute;vel mover /var </P>
<P>para fora do diret&oacute;rio raiz, pois dentro da parti&ccedil;&atilde;o /usr (Isto se fazia </P>
<P>algumas vezes para reduzir o tamanho da parti&ccedil;&atilde;o raiz ou quando  h&aacute; pouco </P>
<P>espa&ccedil;o na parti&ccedil;&atilde;o raiz). Sendo assim,  /var n&atilde;o deve ser enla&ccedil;ada a /usr, </P>
<P>porque fazia que a separa&ccedil;&atilde;o entre /usr e /var seja mais dif&iacute;cil e </P>
<P>seguramente criar&aacute; um conflito do  nomes, em vez links /var e / usr/var.</P>
<P>/var/adm : Agenda do sistema e arquivos contabilizados (obsoleto)</P>
<P>&nbsp;</P>
<P>Este diret&oacute;rio tem sido  repassado  para /var/og e outros diret&oacute;rios . Deve </P>
<P>ser um links simb&oacute;lico a /var/og at&eacute; que todos os programas  n&atilde;o se refiram </P>
<P>mas a algum arquivo em /var/adm.</P>
<P>utmp seja movido  a /var/run. Todos os arquivos agendas  v&atilde;o  ser movidos  </P>
<P>a /var/og incluindo o arquivo wtmp.</P>
<P>O suporte de empacotamento das  distribui&ccedil;&otilde;es deve armazenar em </P>
<P>/var/lib/&lt;nome&gt;.</P>
<P>Nota: O links simb&oacute;lico /var/adm n&atilde;o deve ser necess&aacute;rio a maioria dos </P>
<P>sistemas Linux-i386ELF dado que Otroca foi</P>
<P>introduzido  antes que ELF fora liberado ao p&uacute;blico.</P>
<P>/var/catman : P&aacute;ginas do  Manual Formatadas localmente (opcional)</P>
<P>Este diret&oacute;rio proporcionara uma localiza&ccedil;&atilde;o  padr&atilde;o  para os computadores </P>
<P>que utilizam uma parti&ccedil;&atilde;o /usr somente para leitura , pois desejam permitir</P>
<P>o armazenamento tempor&aacute;rio de p&aacute;ginas do  manual formatados localmente. </P>
<P>Os administradores que montaram /usr como escrita (instala&ccedil;&otilde;es </P>
<P>mono-usu&aacute;rios) podem escolher n&atilde;o usar /var/catman e exibir as p&aacute;ginas do  </P>
<P>manual formatadas dentro dos diret&oacute;rios cat[1-9] dentro /usr diretamente. </P>
<P>Recomendamos que a maioria dos administradores utilizem uma das seguintes </P>
<P>op&ccedil;&otilde;es em seu lugar.</P>
<P>Preformatando todas as p&aacute;ginas do  manual dentro /usr com o programa </P>
<P>(catman).</P>
<P>N&atilde;o ser&aacute; permitido o armazenamento tempor&aacute;rio das p&aacute;ginas formatadas do  </P>
<P>manual e precise que se execute nroff cada vez que  necessite uma p&aacute;gina.</P>
<P>Se permita o armazenamento tempor&aacute;rio local das p&aacute;ginas do  manual em </P>
<P>/var/catman.</P>
<P>A estrutura de /var/catman necessita refrear ambos, O trecho  da exist&ecirc;ncia </P>
<P>de m&uacute;ltiplas hierarquias de p&aacute;gina do  manual e a possibilidade do  uso de </P>
<P>m&uacute;ltiplos idiomas.</P>
<P>Dada uma p&aacute;gina do  manual sem formatar que normalmente aparece em </P>
<P>/usr/&lt;rota1&gt;/man/man[1-9], a vers&atilde;o formatada armazenada temporariamente </P>
<P>deve ir em /var/catman/&lt;rota2&gt;/cat[1-9], aonde &lt;rota2&gt; &eacute; &lt;rota1&gt;. Os </P>
<P>componentes &lt;rota2&gt; e &lt;rota1&gt; est&atilde;o ausente no caso de /usr/man e </P>
<P>/var/catman.</P>
<P>Por exemplo, /usr/man/man1/ls.1 &eacute; formatado em /var/catman/cat1/ls.1 e </P>
<P>/usr/X11R6/man/&lt;locais&gt;/man3/XtCass.3x esta formatado em /var/catman/X11R6/</P>
<P>&lt;locais&gt;/cat3/XtCass.3x .</P>
<P>As p&aacute;ginas do  manual escritas em /var/catman/cat[1-9] podem eventualmente,</P>
<P>transferir-se a /usr/&lt;rota&gt;/cat[1-9]. De igual forma as p&aacute;ginas do  manual </P>
<P>formatadas dentro de /usr/&lt;rota&gt;/cat[1-9] podem expirar se n&atilde;o s&atilde;o aceitas </P>
<P>num per&iacute;odo do  tempo.</P>
<P>Se tivessem p&aacute;ginas do manual preformatadas com um sistema Linux num meio </P>
<P>somente para leitura (por exemplo um CD-ROM), devem estar instaladas em </P>
<P>/usr/&lt;rota&gt;/cat[1-9]. /var/catman est&aacute; reenviado para um lugar de </P>
<P>armazenamento tempor&aacute;rio para p&aacute;ginas de manual formatados.</P>
<P>/var/lib : &#9;Informa&ccedil;&atilde;o  de Estado das  Aplica&ccedil;&otilde;es.</P>
<P>emacs&#9;Diret&oacute;rio do  estado do  Emacs&#9;</P>
<P>games&#9;Informa&ccedil;&atilde;o  vari&aacute;vel de jogos&#9;</P>
<P>news&#9;Arquivos vari&aacute;veis de Cnews/INN&#9;</P>
<P>texmf&#9;Informa&ccedil;&atilde;o  vari&aacute;vel associada com TeX&#9;</P>
<P>xdm&#9;arquivos de autentica&ccedil;&atilde;o e c&oacute;digo de erros de aplica&ccedil;&otilde;es X Window.&#9;</P>
<P>&nbsp;</P>
<P>/var/lib/&lt;nome&gt; &eacute; o lugar apropriado  para o suporte de empacotamento de </P>
<P>todas as distribui&ccedil;&otilde;es. Diferentes distribui&ccedil;&otilde;es de Linux podem utilizar </P>
<P>diferentes nomes para suporte.</P>
<B><FONT SIZE=4><P>&nbsp;</P>
</B></FONT><P>&nbsp;</P>
<B><FONT SIZE=4><P>3 - PERMISS&Otilde;ES DE ARQUIVOS</P>
</B></FONT><P>&nbsp;</P>
<P>Como d&aacute; para concluir, permiss&otilde;es de arquivos (e diret&oacute;rios) diz respeito ao que  &eacute; permitido ao usu&aacute;rio fazer em rela&ccedil;&atilde;o aos arquivos/diret&oacute;rios. Como o Linux &eacute;  um SO multiusu&aacute;rio (mesmo que seja instalado em um micro isolado do mundo e sem placa d rede ou modem), ele divide os usu&aacute;rios em tr&ecirc;s grupos: o do dono do arquivo, o dos usu&aacute;rios do mesmo grupo do dono e o dos demais usu&aacute;rios. </P>
<P>&nbsp;</P>
<P>Ao executar o comando ls -la em um diret&oacute;rio, cada arquivo aparece com suas permiss&otilde;es &agrave; esquerda, assim: drwxrwxrwr</P>
<P>                     &#9;&#9;&#9;  0111222333</P>
<P>&nbsp;</P>
<P>a) A primeira letra "d" 0 (zero) indica o tipo do arquivo (arquivo ou diret&oacute;rio)</P>
<P>&nbsp;</P>
<P>b) As letras seguintes s&atilde;o agrupadas de tr&ecirc;s em tr&ecirc;s "rwx" a cada conjunto  indica o acesso que voc&ecirc; vai permitir a:</P>
<P>&nbsp;</P>
<P>        1 - o dono do arquivo - primeiro grupo</P>
<P>        2 - usu&aacute;rios do mesmo grupo do dono - segundo grupo</P>
<P>        3 - demais usu&aacute;rios - terceiro grupo</P>
<P>c)      r --&gt; permiss&atilde;o de leitura (Read)</P>
<P>        w --&gt; permiss&atilde;o de escrita (Write)</P>
<P>        x --&gt; permiss&atilde;o para executar (eXecute)</P>
<P>&nbsp;</P>
<P>d) Cada grupo de tr&ecirc;s letra &eacute; representado por um n&uacute;mero octal, para alterar as permiss&otilde;es voc&ecirc; s&oacute; precisa fazer o seguinte:</P>
<P>&nbsp;</P>
<P>I - Divida como voc&ecirc; quer setar as permiss&otilde;es e escreva um n&uacute;mero bin&aacute;rios com elas (se quer setar bote 1 sen&atilde;o bote 0). Veja o seu exemplo</P>
<P>&nbsp;</P>
<P>        "drwxr-x--x"</P>
<P>          111101001</P>
<P>&nbsp;</P>
<P>        separando para visualizar melhor temos:</P>
<P>&nbsp;</P>
<P>        "d rwx r-x --x"</P>
<P>           111 101 001</P>
<P>&nbsp;</P>
<P>        II - Agora pegue cada um dos n&uacute;meros bin&aacute;rios resultantes e transforme no seu equivalente em octal (em decimal d&aacute; a mesma coisa). ent&atilde;o temos:</P>
<P>&nbsp;</P>
<P>        "d rwx r-x --x"</P>
<P>           111 101 001</P>
<P>            7   5   5</P>
<P>&nbsp;</P>
<P>e) Agora voc&ecirc; s&oacute; precisa fazer 'chmod 755 &lt;arquivo&gt;' para ter a permiss&atilde;o que voc&ecirc; queria. </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Ou seja, o comando chmod usado dessa forma indica as permiss&otilde;es dos tr&ecirc;s grupos de usu&aacute;rios vistos acima, cada n&uacute;mero representa as permiss&otilde;es do  respectivo grupo. Aqui no exemplo diz: 7 representa as permiss&otilde;es do primeiro grupo (o dono do arquivo) e significa que ele pode ler, gravar e executar. J&aacute; o segundo algarismo (do segundo grupo) o 5 diz que o segundo grupo pode ler, n&atilde;o pode gravar e pode executar. O terceiro algarismo, (do terceiro grupo) o algarismo 5 diz, que esse grupo pode apenas executar.</P>
<P>&nbsp;</P>
<P>S&oacute; quem pode mudar as permiss&otilde;es do arquivo &eacute; o dono dele ou ent&atilde;o o root.</P>
<P>&nbsp;</P>
<P>Usando o comando chmod para tornar um arquivo execut&aacute;vel: chmod +x arquivo.extensao.</P>
<P>&nbsp;</P>
<P>Obs.: O texto acima foi colocado numa lista de discuss&atilde;o por um colega que n&atilde;o anotei o nome, mas fica aqui a cita&ccedil;&atilde;o do colega an&ocirc;nimo. Agora veja uma tabela com os valores baseada nas v&aacute;rias combina&ccedil;&otilde;es poss&iacute;veis das permiss&otilde;es, nos algarismos usados pelo chmod (em The Linux Manual, do Hugo Cisneiros).</P>
<P>&nbsp;</P>
<P>0 - nenhuma permiss&atilde;o                     4 - permiss&atilde;o para ler</P>
<P>1 - permiss&atilde;o para executar              5 - permiss&atilde;o para ler e executar</P>
<P>2 - permiss&atilde;o para gravar                  6 - permiss&atilde;o para ler e gravar</P>
<P>3 - permiss&atilde;o para gravar/executar   7 - permiss&atilde;o para ler/gravar/</P>
<P>              &#9;                                        /executar</P>
<P>&nbsp;</P>
<P><A NAME="_Toc445960949">Permiss&otilde;es e Ownership</A></P>
<P>&nbsp;</P>
<P>Arquivos e diret&oacute;rios do DOS tem os seguintes atributos: <FONT FACE="Arial">A (archive), H (hidden), R (read-oly) e S (system).</P>
</FONT><P>No UNIX um arquivo tem "permiss&otilde;es" de acesso e um <I>propriet&aacute;rio </I>(<B>owner</B>), que pertence a um <I>grupo </I>(<B>group</B>). Veja o exemplo:</P>
<P>&nbsp;</P>
<P>$ ls -l /bin/ls</P>
<P>-rwxr-xr-x  1  root  bin  27281 Aug 15 1995 /bin/ls*</P>
<P>&nbsp;</P>
<P>O primeiro campo cont&eacute;m as permiss&otilde;es do arquivo <FONT FACE="Arial">/bin/ls</FONT>, que pertence ao root, no grupo bin. Deixando o restante da informa&ccedil;&atilde;o de lado, lembre se que -rwxr-xr-x significa, da esquerda para a direita:</P>
<P>&quot;-&quot; (h&iacute;fen) &eacute; o tipo de arquivo ( - = arquivo comum, d = diret&oacute;rio, l = link, etc); </P>
<P>rwx s&atilde;o as permiss&otilde;es para o dono do arquivo (owner) (read, write, execute); </P>
<P>r-x s&atilde;o as permiss&otilde;es para o grupo do dono do arquivo (read, execute); </P>
<P>r-x s&atilde;o permiss&otilde;es de todos os outros usu&aacute;rios (read, execute).</P>
<P>&nbsp;</P>
<P>O diret&oacute;rio /bin tem permiss&otilde;es tamb&eacute;m, por isso voc&ecirc; n&atilde;o pode deletar o arquivo /bin/ls a menos que voc&ecirc; seja o root. Para alterar as permiss&otilde;es de um arquivo, o comando &eacute;:</P>
<P>&nbsp;</P>
<P>$ chmod &lt;quemXperm&gt; &lt;arquivo&gt;</P>
<P>&nbsp;</P>
<P>Onde <B>quem</B> &eacute; u (user, que &eacute; o dono (owner)), g (group(grupo)), o (other(outros)), <B>X</B> &eacute; tanto + ou -, <B>perm</B> &eacute; r (read), w (write), ou x (execute). Exemplos comuns do uso de chmod:</P>
<P>&nbsp;</P>
<P>$ chmod +x file&#9;&#9;isto atribui permiss&atilde;o de execu&ccedil;&atilde;o ao arquivo.</P>
<P>&nbsp;</P>
<P>$ chmod go-rw file&#9;isto remove permiss&otilde;es de leitura (read) e escrita (write) para todos, exceto para o dono do arquivo (owner).</P>
<P>$ chmod ugo+rwx file&#9;isto d&aacute; a todos direitos de leitura (read), escrita (write) e execu&ccedil;&atilde;o (execute).</P>
<P>&nbsp;</P>
<P># chmod +s file&#9;&#9;isto faz, o assim chamado "setuid" ou "suid" arquivo --- um arquivo que todos podem executar com seus pr&oacute;prios privil&eacute;gios (permiss&otilde;es/direitos). Estes s&atilde;o normalmente arquivos importantes do sistema como o servidor X.</P>
<P>&nbsp;</P>
<P>Existe um meio mais r&aacute;pido de se referir a permiss&otilde;es, com d&iacute;gitos: rwxr-xr-x pode ser expresso por 755 (cara letra corresponde a um bit: --- e 0, ---x e 1, -w- e 2, -wx e 3 ...). Isto parece dif&iacute;cil, mas com um pouco de pratica voc&ecirc; entende o conceito.</P>
<P> </P>
<P>Root, como sendo o superusu&aacute;rio, pode modificar as permiss&otilde;es de arquivos de qualquer usu&aacute;rio no sistema. Leia os <B>man pages </B>para informa&ccedil;&otilde;es adicionais.</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P><A NAME="_Toc445960954">PERMISS&Otilde;ES DE DIRET&Oacute;RIOS</A></P>
</B></FONT><P>&nbsp;</P>
<P>Diret&oacute;rios, como os arquivos tamb&eacute;m tem permiss&otilde;es. O que voc&ecirc; viu na sess&atilde;o "Permiss&otilde;es e Ownership" se aplica a diret&oacute;rios tamb&eacute;m. Para um diret&oacute;rio, &quot;rx&quot; significa que voc&ecirc; pode "ler" o diret&oacute;rio (cd), e &quot;w&quot; significa que voc&ecirc; pode deletar um arquivo no diret&oacute;rio (de acordo com as permiss&otilde;es do arquivo), ou o pr&oacute;prio diret&oacute;rio.</P>
<P>&nbsp;</P>
<P>Por exemplo, para prevenir outros usu&aacute;rios de bisbilhotar em /home/guido/text, digite:</P>
<P>&nbsp;</P>
<P>$ chmod o-rwx /home/guido/text</P>
<P>&nbsp;</P>
<P>4<B><FONT SIZE=4> - MONTAGEM TEMPOR&Aacute;RIA DE HD, DISQUETE E CD-ROM</P>
</B></FONT><P>&nbsp;</P>
<P>Fisicamente, formatar um disco &eacute; uma coisa, fazer um sistema de arquivos nele &eacute; outra. Em DOS, o comando FORMAT A: faz as duas coisas, mas no Linux existem comandos separados para cada uma dessas tarefas. Exemplo: para criar um sistema de arquivos...</P>
<P>&nbsp;</P>
<P># mkfs -t ext2 -c /dev/fd0H1440</P>
<P>&nbsp;</P>
<P>Uma vez que o disco estiver preparado, monte-o usando o comando</P>
<P>&nbsp;</P>
<P>No Linux, para voc&ecirc; utilizar disquetes e CDs, deve-se antes montar essas unidades e antes de retir&aacute;-las do drive, deve-se desmont&aacute;-las.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>4.1 - MONTAGEM DE HD</P>
</B></FONT><P>&nbsp;</P>
<P>- Montar parti&ccedil;&atilde;o w95/98 no Linux:</P>
<P>  Criar um diret&oacute;rio: mkdir /windows ou /mnt/win95</P>
<P>  Montar: mount -t vfat /dev/hda1 /windows (supondo que hda1 &eacute; a parti&ccedil;&atilde;o w95/98)</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>4.2 - MONTAGEM DE DISQUETE</P>
</B></FONT><P>&nbsp;</P>
<P>Criar um diret&oacute;rio: mkdir /mnt/floppy (caso ainda n&atilde;o tenha sido criado)</P>

<UL>
<LI>Montar: mount /dev/fd0 /mnt/floppy</LI></UL>

<P>Voc&ecirc; pode usar os formatos minix, vfat, dos ao inv&eacute;s de ext2.</P>
<P>&nbsp;</P>
<P>- Depois de montado, basta usar o diret&oacute;rio /mnt/floppy para ler/gravar no  disquete.</P>
<P>&nbsp;</P>
<P>Antes de retirar o disquete do drive deve-se desmont&aacute;-lo.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>4.3 - DESMONTAR UM DISQUETE:</P>
</B></FONT><P>&nbsp;</P>
<P>umount /mnt/floppy</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>4.4 - MONTANDO UM CD-ROM:</P>
</B></FONT><P>&nbsp;</P>
<P>- Montar: mount /dev/cdrom /mnt/cdrom   Se n&atilde;o funcionar:</P>
<P>- Criar um diret&oacute;rio: mkdir /mnt/cdrom e  mount -t iso9660 /dev/hdb /mnt/cdrom </P>
<P>(supondo que o drive de CD seja hdb)</P>
<P>&nbsp;</P>
<P>Tamb&eacute;m como o disquete, o CD-ROM deve ser desmontado antes de ser retirado do drive (observe que quando montado ele n&atilde;o sai do drive, pode pressionar o bot&atilde;o para ejetar que n&atilde;o adianta, s&oacute; obedece ap&oacute;s ser desmontado.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>4.5 - DESMONTAR UM CD-ROM:</P>
</B></FONT><P>&nbsp;</P>
<P>umount /mnt/cdrom</P>
<P>&nbsp;</P>
<P> </P>
<B><FONT SIZE=4><P>4.6 - MONTAGEM PERMANENTE DE CD-ROM, HD E FLOPPY:</P>
</B></FONT><P>&nbsp;</P>
<P>Os pontos de montagem para ficarem permanentes devem ser adicionados logo na instala&ccedil;&atilde;o (quando s&atilde;o colocados no arquivo /etc/fstab) ou ap&oacute;s a instala&ccedil;&atilde;o, tamb&eacute;m sendo inseridos no /etc/fstab:</P>
<P>&nbsp;</P>
<P>Para montar permanentemente uma parti&ccedil;&atilde;o w95/98 no Linux:</P>
<P>- Criar o diret&oacute;rio (ou ponto de montagem): mkdir /win95 ou /mnt/w95;</P>
<P>- Editar o /etc/fstab: vi /etc/fstab e adicionar a linha abaixo</P>
<P>/dev/hda1       /windows        vfat            noauto  0 0</P>
<P>- Editar o /etc/mtab: vi /etc/fstab e adicionar</P>
<P>/dev/hda1 /windows vfat rw 0 0</P>
<P>Veja os outros exemplos no /etc/fstab, para disquetes e CD-ROM.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>5</FONT><FONT SIZE=5> –</FONT><FONT SIZE=4> GERENCIAMENTO DE MEM&Oacute;RIA NO LINUX</P>
<P>&nbsp;</P>
</B></FONT><P>5.1 Gerenciamento de Mem&oacute;ria do Linux (LMM)A execu&ccedil;&atilde;o do LMM (Linux Memory Manager) exige uma estrat&eacute;gia de pagina&ccedil;&atilde;o com uma copy-on-write confiando nas 386 p&aacute;ginas auxiliares. Um processo </P>
<P>alcan&ccedil;a suas tabelas de p&aacute;ginas de seu parent (durante um fork ) com as </P>
<P>entradas marcadas como read-only ou trocado. Ent&atilde;o, se o processo tenta </P>
<P>escrever para este espa&ccedil;o de mem&oacute;ria e a p&aacute;gina &eacute; uma copy on write page, </P>
<P>isto &eacute; copiado e a p&aacute;gina marcada read-write. Um exec ( ) resulta na </P>
<P>leitura de uma p&aacute;gina ou mais do execut&aacute;vel. O processo ent&atilde;o erra em </P>
<P>qualquer outra p&aacute;gina que precisar.</P>
<P>Cada processo tem uma tabela de p&aacute;gina que significa que pode acessar 1 Kb </P>
<P>de tabela de p&aacute;gina indicando para 1 Kb de 4 Kb, p&aacute;ginas que &eacute; 4 Gb de </P>
<P>mem&oacute;ria. Um diret&oacute;rio de p&aacute;gina do processo &eacute; iniciado durante um Fork por </P>
<P>copy-page-tables. O processo inativo tem seu diret&oacute;rio de p&aacute;gina </P>
<P>inicializado durante a seq&uuml;&ecirc;ncia de inicializa&ccedil;&atilde;o.</P>
<P>Cada processo usu&aacute;rio tem uma tabela descrita no local que cont&eacute;m um c&oacute;digo</P>
<P>de segmento e um segmento de dados. Estes segmentos usu&aacute;rios estendem de 0 </P>
<P>para 3 Gb (0 X c 0000000). Nos espa&ccedil;os usu&aacute;rios, endere&ccedil;os lineares e </P>
<P>endere&ccedil;os l&oacute;gicos s&atilde;o id&ecirc;nticos.</P>
<P>No 80386, endere&ccedil;os lineares  v&atilde;o de 0 Gb para 4 Gb. Um endere&ccedil;o linear </P>
<P>indica uma posi&ccedil;&atilde;o particular de mem&oacute;ria dentro deste espa&ccedil;o. Um endere&ccedil;o </P>
<P>linear n&atilde;o &eacute; um endere&ccedil;o f&iacute;sico --- isto &eacute; um endere&ccedil;o virtual. Um endere&ccedil;o</P>
<P>l&oacute;gico consiste de um seletor e um offset. O seletor indica para um segmento</P>
<P>e o offset diz que dist&acirc;ncia na se&ccedil;&atilde;o o endere&ccedil;o &eacute; localizado.</P>
<P>O c&oacute;digo Kernel e o segmento de dados s&atilde;o se&ccedil;&otilde;es privilegiados definidos na</P>
<P>tabela descritora global e estende de 3Gb para 4Gb. O Swapper - page - dir </P>
<P>&eacute; organizado para que estes endere&ccedil;os l&oacute;gicos e f&iacute;sicos sejam id&ecirc;nticos no </P>
<P>espa&ccedil;o Kernel.</P>
<P>O espa&ccedil;o 3Gb acima aparece no process page directory como indicadores para </P>
<P>tabelas de p&aacute;ginas Kernel. Este espa&ccedil;o &eacute; invis&iacute;vel para o processo no user </P>
<P>mode, mas o modo privilegiado &eacute; acionado, por exemplo, para sustentar um </P>
<P>sistema de liga&ccedil;&atilde;o. O modo supervisor &eacute; inserido dentro do contexto do </P>
<P>processo atual ent&atilde;o a tradu&ccedil;&atilde;o do endere&ccedil;o ocorre com respeito ao </P>
<P>diret&oacute;rio de p&aacute;gina do processo, mas usando segmentos Kernel. </P>
<P>Isto &eacute; id&ecirc;ntico no mapeamento produzido com o uso de swapper - pg - dir e </P>
<P>segmentos Kernel como ambos diret&oacute;rios de p&aacute;ginas usa a mesma tabela de </P>
<P>p&aacute;gina neste espa&ccedil;o. Apenas task [0] (A tarefa inativa, &aacute;s vezes chamada </P>
<P>de "tarefa trocadora"  por raz&otilde;es hist&oacute;ricas, mesmo assim isto n&atilde;o tem </P>
<P>rela&ccedil;&atilde;o com trocas nos implementos Linux) usa o swapper - pg - dir </P>
<P>diretamente.</P>
<P>O segmento base do processo usu&aacute;rio = o X 00, page - dir particular, para o </P>
<P>processo.</P>
<P>O processo usu&aacute;rio faz um sistema de liga&ccedil;&atilde;o : segment base = 0 X c 0000000</P>
<P>page - dir = mesmo usu&aacute;rio page dir.</P>
<P>swapper - pg - dir cont&eacute;m um mapeamento para todas as p&aacute;ginas f&iacute;sicas de 0 </P>
<P>X 0000000 para 0 X c 0000000 + and_mem, ent&atilde;o as primeiras 768 entradas em </P>
<P>swapper - pg - dir s&atilde;o 0's, e ent&atilde;o h&aacute; 4 ou mais que indicam na tabela de </P>
<P>p&aacute;ginas Kernel.</P>
<P>O user page directories t&ecirc;m as mesmas entradas como swapper - pg - dir dos </P>
<P>768 acima. As primeiras 768 entradas mapeiam o espa&ccedil;o usu&aacute;rio.</P>
<P>A vantagem &eacute; que sempre que o endere&ccedil;o linear &eacute; acima de 0 X c 0000000 </P>
<P>tudo usa a mesma tabela de p&aacute;ginas Kernel (Kernel page Tables).</P>
<P>O monte usu&aacute;rio permanece no topo do segmento de dados do usu&aacute;rio e desce. </P>
<P>O Kernel Stack n&atilde;o &eacute; uma bonita estrutura ou segmento de dados que eu possa </P>
<P>apontar com um "aqui &eacute; um Kernel Stack". Um Kernel Stack_frame (uma p&aacute;gina) </P>
<P>&eacute; associada com cada novo processo criado e &eacute; usado sempre que o Kernel </P>
<P>opera dentro do contexto deste processo. Coisas ruins aconteceriam se </P>
<P>Kernel Stack descesse abaixo de seu corrente stack frame. [ Onde o Kernel </P>
<P>Stack &eacute; guardado? Eu sei que h&aacute; um para cada processo, mas onde isto &eacute; </P>
<P>armazenado quando isto n&atilde;o est&aacute; sendo usado? ]</P>
<P>P&aacute;ginas usu&aacute;rios podem ser roubados ou trocados - Um user page &eacute; um que &eacute; </P>
<P>mapeado abaixo de 3 Gb em uma tabela de p&aacute;ginas usu&aacute;rios. Esta regi&atilde;o n&atilde;o </P>
<P>cont&eacute;m page directories ou page tables. Apenas p&aacute;ginas sujas s&atilde;o trocadas.</P>
<P>Menores altera&ccedil;&otilde;es s&atilde;o necess&aacute;rias em alguns lugares ( testes para limites </P>
<P>de mem&oacute;ria vem para a mente) para prover suporte para definidos segmentos </P>
<P>programados. [ H&aacute; agora uma modifica&ccedil;&atilde;o - |c| + O sistema de liga&ccedil;&atilde;o usado </P>
<P>por dosane, Wine, Twin, and Wabi para criar segmentos arbitr&aacute;rios. </P>
<P>&nbsp;</P>
<P>5.2 Mem&oacute;ria F&iacute;sica</P>
<P>&nbsp;</P>
<P>Aqui est&aacute; um mapa de mem&oacute;ria f&iacute;sica antes que qualquer processo de usu&aacute;rio </P>
<P>for executado. A coluna da esquerda mostra o endere&ccedil;o de partida do item e </P>
<P>os n&uacute;meros em negrito s&atilde;o aproximados.</P>
<P>A coluna do meio mostra os nomes dos itens. A grande coluna da direita </P>
<P>mostra a rotina relevante ou o nome vari&aacute;vel ou explica&ccedil;&otilde;es para ingresso.</P>
<P>&nbsp;</P>
<P>* Projeto - Inits que adquirem mem&oacute;ria s&atilde;o (principais.c) profil - buffer, </P>
<P>com, init, psaux, init, rd, , init, scsi.dev - init.</P>
<P>Note que toda mem&oacute;ria n&atilde;o marcada como livre &eacute; reservada (mem-init). </P>
<P>P&aacute;ginas reservadas pertencem ao Kernel e nunca est&atilde;o livres ou trocadas.</P>
<P>Uma vis&atilde;o de mem&oacute;ria do user process.</P>
<P>O c&oacute;digo de segmento e dados do segmento estendem todo o caminho de 0 X 00 </P>
<P>para 3 Gb. Correntemente o page fault handler do wp_page confere para </P>
<P>assegurar que um processo n&atilde;o escreve para seu c&oacute;digo de espa&ccedil;o.</P>
<P>De qualquer modo, pegando o sinal segu, &eacute; poss&iacute;vel escrever para o code </P>
<P>space, causando ocorr&ecirc;ncia de um copy - on - write. O Handler do_no_page </P>
<P>assegura que qualquer p&aacute;gina nova que o processo adquira perten&ccedil;a ao </P>
<P>execut&aacute;vel, uma biblioteca dividida, ao stack, ou dentro do valor do brK.</P>
<P>Um usu&aacute;rio de processo pode reordenar seu valor brK chamando sbrK ( ). </P>
<P>Isto &eacute; o que malloc ( ) faz quando precisa. O texto e a por&ccedil;&atilde;o de dados </P>
<P>s&atilde;o distribu&iacute;dos em p&aacute;ginas separadas ao menos que algu&eacute;m escolha o N op&ccedil;&atilde;o </P>
<P>composta. A biblioteca dividida carrega endere&ccedil;os s&atilde;o correntemente </P>
<P>tornadas da imagem dividida por ele mesmo.</P>
<P>O endere&ccedil;o &eacute; entre 1.5 Gb e 3 Gb, exceto em casos especiais.</P>
<P>Distribui&ccedil;&atilde;o da mem&oacute;ria do processo usu&aacute;rio</P>
<P>O Stack, shlibs e os dados s&atilde;o muito afastados um do outro para serem </P>
<P>spanned por uma tabela de p&aacute;gina. </P>
<P>Todas KPT s&atilde;o divididas por todos processo e deste modo eles n&atilde;o est&atilde;o na </P>
<P>lista. Apenas p&aacute;ginas sujas s&atilde;o trocadas. P&aacute;ginas limpas s&atilde;o roubadas e </P>
<P>deste modo o processo pode t&ecirc;-los de volta para o execut&aacute;vel se for </P>
<P>desejado. A maioria das vezes apenas as p&aacute;ginas limpas s&atilde;o divididas. Uma </P>
<P>p&aacute;gina suja termina dividida sobre um fork at&eacute; que parent ou child escolham</P>
<P>para escrever isto de novo.</P>
<P>Administra&ccedil;&atilde;o dos dados da mem&oacute;ria na tabela do processo.</P>
<P>Aqui est&aacute; um sum&aacute;rio de algum dos dados mantidos na tabela do processo que </P>
<P>&eacute; usado para administra&ccedil;&atilde;o da mem&oacute;ria.</P>
<P>Limites do processo da mem&oacute;ria.</P>
<P>Ulong - start_code - and_code - and_data - brk, atart – stock</P>
<P>Erro de contagem de p&aacute;gina.</P>
<P>&nbsp;</P>
<P>Tabela do descritor local.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Struct desc - sturct ldt {32} &eacute; a mesa descritora local para tarefa.</P>
<P>N&uacute;meros de p&aacute;ginas residentes.</P>
<P>Swappable – troc&aacute;veis</P>
<P>Se ent&atilde;o as p&aacute;ginas do processo n&atilde;o ser&atilde;o trocados.</P>
<P>Kernel Stack page</P>
<P>Indicador para a p&aacute;gina distribu&iacute;da no fork.</P>
<P>Saved – Kernel – Stack</P>
<P>V86 modo material (stuff)</P>
<P>stract tss</P>
<P>pilha de segmentos (stack segments)</P>
<P>indicador da pilha Kernel</P>
<P>Kernel stack pointer</P>
<P>Segmento da pilha Kernel</P>
<P>Kernel stack segment (0X10)</P>
<P>ssi = esp 2 = ss2 = 0</P>
<P>&nbsp;</P>
<P>N&iacute;veis de privil&eacute;gio n&atilde;o usados.</P>
<P>Segmentos seletores. Ds=es=fs=gs=ss=ok17,cs—</P>
<P>Todos indicam para segmentos no corrente 1 dt [ ]</P>
<P>c r 3 : indicam para o page directory para este processo</P>
<P>1 dt - LDT (n) seletores para tarefas correntes do LDT</P>
<P>Inicializa&ccedil;&atilde;o da mem&oacute;ria</P>
<P>&nbsp;</P>
<P>No Start Kernel (main.c) h&aacute; 3 vari&aacute;veis relatadas para inicializa&ccedil;&atilde;o da </P>
<P>mem&oacute;ria:</P>
<P>&nbsp;</P>
<P>memory_start &#9;&#9;come&ccedil;a a 1 Mb atualizado pelo projeto de </P>
<P>inicializa&ccedil;&atilde;o.</P>
<P>memory_end&#9;&#9;t&eacute;rmino da mem&oacute;ria f&iacute;sica: 8 Mb, 16 Mb, ou qualquer outro.</P>
<P>Low memory_start&#9;t&eacute;rmino do c&oacute;digo Kernel e dados que &eacute; carregado </P>
<P>inicialmente</P>
<P>&nbsp;</P>
<P>Cada projeto init tipicamente torna memory_start e retorna um valor </P>
<P>atualizado, se distribui espa&ccedil;os no memory_start (simplesmente pegando-a). </P>
<P>Paging init ( ) inicializa a page-tables no { \ tt swapper - pg - dir} </P>
<P>(come&ccedil;ando a 0 X 0000000)  para cobrir toda a mem&oacute;ria f&iacute;sica do </P>
<P>memory_start para memory_end. Na verdade o primeiro 4 Mb &eacute; feito no </P>
<P>startup_32 (heads).memory_start &eacute; incrementado se quaisquer nova </P>
<P>page-tables s&atilde;o adicionados.</P>
<P>A primeira p&aacute;gina &eacute; zerada para bloquear os indicadores das refer&ecirc;ncias do </P>
<P>al&ccedil;ap&atilde;o nulo no Kernel.</P>
<P>No sched_init ( ) o 1 dt e tss descritores para tarefa [0] s&atilde;o postos no </P>
<P>GDT, e carregado para dentro do TR e LDTR (a &uacute;nica vez que isto &eacute; feito </P>
<P>explicitamente). Um trap gate (0X80) &eacute; ordenado para system-call.( ).</P>
<P>A bandeira tarefa aninhada &eacute; desligada na prepara&ccedil;&atilde;o para entrada do modo </P>
<P>usu&aacute;rio: O cron&ocirc;metro &eacute; ligado. </P>
<P>O task-struct para task [0] aparece por inteiro em &lt; linux / sched.h &gt;</P>
<P>mem_map &eacute; ent&atilde;o constru&iacute;do por mem_init ( ) para refletir o corrente uso </P>
<P>das p&aacute;ginas f&iacute;sicas. Este &eacute; o estado refletido no mapa da mem&oacute;ria f&iacute;sica </P>
<P>da se&ccedil;&atilde;o anterior. Ent&atilde;o Dinux move para dentro do modo usu&aacute;rio com um iret </P>
<P>ap&oacute;s empurrar o corrente ss, esp, etc.</P>
<P>Claro que o segmento usu&aacute;rio para task [0] s&atilde;o mapeados bem sobre os </P>
<P>segmentos Kernel e deste modo a execu&ccedil;&atilde;o continua exatamente onde isto </P>
<P>termina.</P>
<P>Task [0]:</P>
<P>&nbsp;</P>
<P>pg_dir = swapper - pg - dir que significa apenas endere&ccedil;os mapeados est&atilde;o </P>
<P>no alcance 3 Gb para 3 Gb + High memory.</P>
<P>&nbsp;</P>
<P>LTD [1] = c&oacute;digo usu&aacute;rio, base = 0 x 0000000, tamanho = 640 K</P>
<P>LDT [2] = dados usu&aacute;rios, base = 0 x 0000000, tamanho = 640 k</P>
<P>&nbsp;</P>
<P>O primeiro exec ( ) p&otilde;e a LTD entrada para task [1] para os valores </P>
<P>usu&aacute;rios da base = 0x0, limite = task_size = 0 x c 0000000. Depois disso, </P>
<P>nenhum processo v&ecirc; os segmentos Kernel enquanto no modo usu&aacute;rio.</P>
<P>Processos e a Administra&ccedil;&atilde;o da Mem&oacute;ria.</P>
<P>Mem&oacute;ria relacionada trabalho feito por fork ( ):</P>
<P>distribui&ccedil;&atilde;o de mem&oacute;ria</P>
<P>1 p&aacute;gina para o Task-struct</P>
<P>1 p&aacute;gina para o Kernel Stack</P>
<P>1 para o pg_dir e algumas para pg_tables (c&oacute;pias - p&aacute;ginas - tabelas)</P>
<P>Outras mudan&ccedil;as</P>
<P>sso p&otilde;e para o segmento Kernel stack (0x10) para ter certeza?</P>
<P>espo p&otilde;e para o topo da nova distribui&ccedil;&atilde;o Kernel - stack - page.</P>
<P>c r 3 p&otilde;e por copy - page - tables ( ) para indicar para nova p&aacute;gina de </P>
<P>diret&oacute;rio distribu&iacute;da1 dt = LDT (task_nr) cria novo 1 dt descritor</P>
<P>descritores p&otilde;e no gdt para novo tss e 1 dt [ ]</P>
<P>Os registros restantes s&atilde;o herdados do parent.</P>
<P>Os processos resultam dividindo seus c&oacute;digos e segmentos de dados (embora </P>
<P>eles tenham tabelas descritoras locais separados, as entradas indicam para </P>
<P>os mesmos segmentos). O stack e p&aacute;ginas de dados ser&atilde;o copiados </P>
<P>quando o parent ou child escreve para eles ( copy-on-write).</P>
<P>Mem&oacute;ria relacionada trabalho feito por exec ( ):</P>
<P>distribui&ccedil;&atilde;o de mem&oacute;ria</P>
<P>1 p&aacute;gina para exec header para omagic</P>
<P>1 p&aacute;gina ou mais para stack (max_arg_pages)</P>
<P>clear-p&aacute;gina-tables ( ) usado para remover p&aacute;ginas velhas.</P>
<P>change 1 dt ( ) p&otilde;e os descritores no novo 1 dt [ ]</P>
<P>1 dt [1] = c&oacute;digo base = 0 x  00, limite = task - size</P>
<P>1 dt [2] = data base = 0 x 00, limite = task - size</P>
<P>&#9;Estes segmentos s&atilde;o dpl = 3, p=1, s=1, g=1. Tipo = a (c&oacute;digo or 2 </P>
<P>dados)</P>
<P>Eleva para MAX_ARG_PAGES p&aacute;ginas sujas de arqu e enup s&atilde;o distribu&iacute;dos e </P>
<P>guardado ao topo do segmento de dados para o novo usu&aacute;rio pilha criado.</P>
<P>Ponha os indicadores de instru&ccedil;&atilde;o do caller cip = ex.a_cutry</P>
<P>Ponha o stack indicador do caller para o stack criado (esp=stack indicador).</P>
<P>Este ser&atilde;o eliminados do Stack quando o caller resume.</P>
<P>&nbsp;</P>
<P>5.3 Limites de Mem&oacute;ria Atualizados</P>
<P>&nbsp;</P>
<P>cud_code = ex.a_text</P>
<P>cud_data = cud_code + &amp;x.d_data</P>
<P>brK = end_data + ex.ª_bss</P>
<P>&nbsp;</P>
<P>Interrup&ccedil;&otilde;es e traps s&atilde;o sustentadas dentro do contexto da corrente tarefa.</P>
<P>Em particular, o diret&oacute;rio de p&aacute;ginas do corrente processo &eacute; usado na </P>
<P>tradu&ccedil;&atilde;o de endere&ccedil;os. Os segmentos, de qualquer modo, s&atilde;o segmentos </P>
<P>Kernel para que todos os endere&ccedil;os lineares apontem para dentro da mem&oacute;ria </P>
<P>Kernel quer acessar uma vari&aacute;vel no endere&ccedil;o 0 x 01. O endere&ccedil;o linear &eacute; </P>
<P>0 x 00000001 (usando segmentos Kernel) e o endere&ccedil;o f&iacute;sico &eacute; 0 x 01. O </P>
<P>&uacute;ltimo &eacute; porque a p&aacute;gina do processo diret&oacute;rio mapeia esta extens&atilde;o </P>
<P>exatamente como page_pg_dir.</P>
<P>O espa&ccedil;o Kernel (0 x c 0000000 + high - memory) e mapeado pela tabela de </P>
<P>p&aacute;ginas Kernel que s&atilde;o eles mesmos parte da mem&oacute;ria reservada. Eles s&atilde;o </P>
<P>consequentemente divididas por todos processos. Durante um fork </P>
<P>copy-page-tables ( ) trata tabela de p&aacute;ginas reservadas diferentemente. </P>
<P>Isto p&otilde;e indicadores no diret&oacute;rio de p&aacute;ginas de processo para indicar para </P>
<P>tabelas de p&aacute;gina Kernel e na verdade n&atilde;o distribui novas tabelas de p&aacute;ginas</P>
<P>como isto faz normalmente. Como um exemplo o Kernel - Stack - page </P>
<P>( que ocupa algum lugar no espa&ccedil;o Kernel ) n&atilde;o precisa de um associado </P>
<P>page - table distribu&iacute;dos no pg-dir do processo para mape&aacute;-lo.</P>
<P>O interruptor de instru&ccedil;&otilde;es p&otilde;e o indicador stack e o segmento stack do </P>
<P>privil&eacute;gio valor salvo no Tss do corrente task. Note que o Kernel stack &eacute; </P>
<P>um objeto realmente fragmentado - Isto n&atilde;o &eacute; um objeto &uacute;nico, mas sim um </P>
<P>grupo de stack frames. Cada um distribu&iacute;do quando um processo &eacute; criado e </P>
<P>deixado quando ele sai. O Kernel stack n&atilde;o deveria crescer t&atilde;o rapidamente </P>
<P>dentro de um contexto de um processo que estende abaixo da corrente frame.</P>
<P>Adquirindo e liberando mem&oacute;rias</P>
<P>&nbsp;</P>
<P>Quando qualquer rotina Kernel precisa de mem&oacute;ria isto acaba chamando </P>
<P>get-free-page ( ). Este est&aacute; num n&iacute;vel mais baixo do que Kmallor ( ) </P>
<P>(de fato Kmalloc ( ) get-free-page ( ) quando isto precisa mais mem&oacute;ria).</P>
<P>Get-free-page ( ) toma um par&acirc;metro, a prioridade.</P>
<P>Poss&iacute;veis valores s&atilde;o gfp_buffer_gfp, Kernel, gfp,nfs e gfp atomic. Isto </P>
<P>tira uma p&aacute;gina do the free-page-list, atualizados mem_map, zeram a p&aacute;gina </P>
<P>e retorna o endere&ccedil;o f&iacute;sico da p&aacute;gina (note que Kmalloc) retorna um endere&ccedil;o</P>
<P>f&iacute;sico. A l&oacute;gica do mm depende do mapa da identidade entre o endere&ccedil;o </P>
<P>l&oacute;gico e f&iacute;sico.</P>
<P>Isto &eacute; por ele mesmo bastante simples. O problema &eacute; claro, &eacute; que o </P>
<P>free-page-list pode estar vazio. Se voc&ecirc; n&atilde;o requisitar uma opera&ccedil;&atilde;o </P>
<P>at&ocirc;mica, nesta etapa, voc&ecirc; entra dentro do dom&iacute;nio de uma page stealing e </P>
<P>que n&oacute;s discutiremos em um momento. Como um &uacute;ltimo recurso ( e para </P>
<P>requisitos at&ocirc;micos) uma p&aacute;gina &eacute; separada do secundary-page-list (como </P>
<P>voc&ecirc; pode ter achado, quando p&aacute;ginas s&atilde;o libertadas, o secundary-</P>
<P>page-list enche primeiro a manipula&ccedil;&atilde;o atual da page-list e mem-map ocorre </P>
<P>neste misterioso macro chamado remove-from-mem-queve ( ) que voc&ecirc; </P>
<P>provavelmente nunca quer investigar. O suficiente para dizer que </P>
<P>interrup&ccedil;&otilde;es s&atilde;o incapacitados. [Eu penso que isto deveria ser explicado </P>
<P>aqui. Isto n&atilde;o &eacute; t&atilde;o dif&iacute;cil...]</P>
<P>Agora de volta ao "Roubando p&aacute;ginas" get-free-page ( ) chame </P>
<P>try-to-fre-page ( ) que chame repetidamente shrink_buffers ( ) e swap-out </P>
<P>( ) nesta ordem at&eacute; conseguir liberar uma p&aacute;gina. A prioridade &eacute; aumentada </P>
<P>em cada iteration sucessiva para que estas duas rotinas processem suas </P>
<P>page-sterling-loops mais freq&uuml;entemente. </P>
<P>Aqui est&aacute; um exemplo do processo swap-out:</P>
<P>Fa&ccedil;a a tabela do processo e adquira uma swappable task, por exemplo, Q.</P>
<P>Ache um user page-table (n&atilde;o reservado) no espa&ccedil;o de Q.</P>
<P>Para cada p&aacute;gina na tabela try-to-swap-out (page)</P>
<P>Termina quando a p&aacute;gina &eacute; liberada.</P>
<P>&nbsp;</P>
<P>Note que swap-out ( ) (chamada try-to-free-page ( )) mant&eacute;m vari&aacute;veis </P>
<P>estat&iacute;sticas e deste modo isto pode resumir a procura onde terminar a </P>
<P>chamada anterior try-to-swap-out ( ) examine os page-tables de todos usar </P>
<P>process e obrigue o sterling policy:</P>
<P>1) &#9;N&atilde;o brincar com as p&aacute;ginas (reserved) reservadas</P>
<P>2) &#9;Envelhecer a p&aacute;gina se ela &eacute; marcada acessada (1 bit)</P>
<P>3) &#9;N&atilde;o mexa com p&aacute;gina adquirida recentemente (last-free-pages ( ))</P>
<P>4) &#9;Deixe p&aacute;ginas sujas com map-counts &gt; 1 intocadas</P>
<P>5) &#9;Diminua o map-count das p&aacute;ginas limpas</P>
<P>6) &#9;Libere p&aacute;ginas limpas se elas n&atilde;o s&atilde;o mapeadas</P>
<P>7) &#9;Troque p&aacute;ginas sujas com um map-count de 1</P>
<P>&nbsp;</P>
<P>De todas essas a&ccedil;&otilde;es, 6 e 7 v&atilde;o parar o processo porque eles resultam na </P>
<P>libera&ccedil;&atilde;o atual de uma p&aacute;gina f&iacute;sica.</P>
<P>A quinta a&ccedil;&atilde;o resulta uma dos processos perdendo uma p&aacute;gina limpa n&atilde;o </P>
<P>dividida que n&atilde;o foi acessada recentemente (diminuindo Q &agrave; rss) que n&atilde;o &eacute; </P>
<P>t&atilde;o ruim, mas os efeitos cumulativos de algumas iterations pode atrasar o </P>
<P>processo muito. No presente, h&aacute; 6 iterations, deste modo uma p&aacute;gina </P>
<P>dividida por 6 processos pode ser roubada se est&aacute; limpa. Page table ent&atilde;o </P>
<P>s&atilde;o atualizados e o TLB invalidado. O trabalho atual de liberar uma p&aacute;gina </P>
<P>&eacute; feito por free-page ( ), a complementa&ccedil;&atilde;o de get-free-page ( ). Isto </P>
<P>ignora p&aacute;ginas reservadas, atualiza mem-map, e libera a p&aacute;gina e atualiza </P>
<P>o page-list (s) se n&atilde;o &eacute; mapeada. Para troca (em 6 em cima), </P>
<P>write-swap-page ( ) &eacute; chamada e n&atilde;o faz nada not&aacute;vel da perspectiva da </P>
<P>administra&ccedil;&atilde;o da mem&oacute;ria. Os detalhes de shink-buffers ( ) nos levaria </P>
<P>muito longe. Essencialmente isto procura free "buffers" (buffers s&atilde;o </P>
<P>uma parte da mem&oacute;ria que segura informa&ccedil;&atilde;o temporariamente quando dados </P>
<P>transferem de um lugar para outro) em seguida escreve buffers sujos, e </P>
<P>depois come&ccedil;a com buffers ocupados e chama free-page ( ) quando </P>
<P>pode liberar todos os buffers numa p&aacute;gina.</P>
<P>Note que page directories, page-table, e reserved pages n&atilde;o s&atilde;o trocadas,  </P>
<P>roubadas ou envelhecidas. Eles s&atilde;o </P>
<P>mapeadas no process page directories com reserved page tables. Eles s&atilde;o </P>
<P>liberados somente na sa&iacute;da do processo.</P>
<P>The page Fault Handles</P>
<P>Quando um processo &eacute; criado por fork, ele come&ccedil;a com um page directory e </P>
<P>uma p&aacute;gina ou mais do execut&aacute;vel. Deste modo the page fault handles &eacute; a </P>
<P>forte da maioria da mem&oacute;ria do processo. The page fault handles do </P>
<P>page-fault ( ) recupera o endere&ccedil;o faltando no registro c r 2. O c&oacute;digo do </P>
<P>erro ( recobrado no sys-call.s) diferencia o acesso do user / supervisor e </P>
<P>a regi&atilde;o para o fault-write prote&ccedil;&atilde;o de uma p&aacute;gina faltando. </P>
<P>O anterior &eacute; sustentado pelo do-wp-page ( ) e o posterior pelo do-no-page </P>
<P>( ). Se o endere&ccedil;o faltando &eacute; maior do que Task-Size, o processo recebe um </P>
<P>SIGKILL [ Por que este controle? Isto pode acontecer somente em Kernel mode</P>
<P>por causa da prote&ccedil;&atilde;o do n&iacute;vel do segmento. Estas rotinas tem algumas </P>
<P>sutilezas como elas podem ser chamadas num interrompimento. Voc&ecirc; n&atilde;o ode </P>
<P>supor que &eacute; a tarefa corrente que est&aacute; executando de-no-page ( ) sustenta </P>
<P>tr&ecirc;s situa&ccedil;&otilde;es poss&iacute;veis:</P>
<P>1) &#9;A p&aacute;gina &eacute; trocada</P>
<P>2) &#9;A p&aacute;gina pertence a biblioteca execut&aacute;vel ou dividida.</P>
<P>3) &#9;A p&aacute;gina est&aacute; faltando – uma p&aacute;gina de dados n&atilde;o foi distribu&iacute;da</P>
<P>Em todas as causas get-empty-pgtable ( ) &eacute; chamada primeiro para assegurar </P>
<P>a exist&ecirc;ncia de uma page table que cobre o endere&ccedil;o faltando. No terceiro </P>
<P>para providenciar uma p&aacute;gina no endere&ccedil;o requerido e no caso de uma p&aacute;gina </P>
<P>trocada, swap-in ( ) &eacute; chamado. No segundo caso, o handles calls share-page</P>
<P>( ) para ver se a p&aacute;gina pode ser dividida com algum outro processo. Se </P>
<P>isto falhar leia a p&aacute;gina do execut&aacute;vel ou biblioteca (Isto repete a </P>
<P>chamada para Share-page ( ) se um outro processo fez o mesmo enquanto isso).</P>
<P>Qualquer por&ccedil;&atilde;o da p&aacute;gina fora do valor brK &eacute; zerada.</P>
<P>A p&aacute;gina lida do disco &eacute; contada como um erro maior. Isto acontece com um </P>
<P>swap-in ( ) ou quando &eacute; lida da execut&aacute;vel ou uma biblioteca. Outras casos </P>
<P>s&atilde;o consideradas erros menores (mim-flt). Quando uma p&aacute;gina divis&iacute;vel &eacute; </P>
<P>achada ela &eacute; corite-protected. Um processo que escreve para uma p&aacute;gina </P>
<P>dividida vai precisar passar por um do-wp-page ( ) que faz o copy-on-write.</P>
<P>Do-wp-page ( ) fa&ccedil;a o seguinte:</P>
<P>Mande SIGSEGV se qualquer usar process o est&aacute; escrevendo para o corrente </P>
<P>code-space.</P>
<P>Se a p&aacute;gina velha n&atilde;o &eacute; dividida, ent&atilde;o simplesmente n&atilde;o proteja-o.</P>
<P>Sen&atilde;o get-free-page ( ) and copy-page ( ). A p&aacute;gina adquirir a bandeira </P>
<P>suja da p&aacute;gina velha. Diminua a conta do mapa da p&aacute;gina velha.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>5.4 Paginando (Paging)</P>
<P>&nbsp;</P>
<P>Paginando &eacute; a troca numa base da p&aacute;gina melhor do que os processos inteiros.</P>
<P>N&oacute;s vamos usar trocando aqui para referir &agrave; "paginando" , uma vez que </P>
<P>apenas Linux p&aacute;gina, e n&atilde;o trocar, e pessoas s&atilde;o mais acostumadas &agrave; palavra</P>
<P>"Swap" / "trocar" do que "page" / "paginar". Kernel pages nunca s&atilde;o trocadas</P>
<P>p&aacute;ginas limpas tamb&eacute;m n&atilde;o s&atilde;o escritas para trocar. Elas s&atilde;o liberadas e </P>
<P>recarregadas quando &eacute; requerida. O trocador mant&eacute;m um &uacute;nico bit de </P>
<P>informa&ccedil;&atilde;o de envelhecimento nas P&aacute;ginas acessadas bit da page table </P>
<P>cutries - [ O que s&atilde;o os detalhes de manuten&ccedil;&atilde;o? Como isto &eacute; usado?]</P>
<P>Linux suporta m&uacute;ltiplos swap files ou projetos que podem ser ligados ou </P>
<P>desligados pelas liga&ccedil;&otilde;es de swapoff system. Cada swap file ou projeto &eacute; </P>
<P>descrito por uma strut-swap-info.</P>
<P>O campo das bandeiras (SWP-USED ou SWP-WRITE ok) &eacute; usado para controlar </P>
<P>acesso para o swap files. </P>
<P>Quando SWP- WRITE ok &eacute; desligado, o espa&ccedil;o n&atilde;o vai ser distribu&iacute;do neste </P>
<P>arquivo. Isto &eacute; usado por Swapoff quando isto tenta de n&atilde;o usar um arquivo. </P>
<P>Quando swapoff adiciona um arquivo de troca nova isto aplica SWP-USED. Um </P>
<P>vari&aacute;vel im&oacute;vel no Swap files armazena o n&uacute;mero dos arquivos ativos </P>
<P>correntemente ativos. &#9;Os campos lowest - bit e hihgest - bit limitam a </P>
<P>regi&atilde;o livre na pasta de troca e s&atilde;o usadas para adiantar a procura por </P>
<P>espa&ccedil;o de troca livre.</P>
<P>O programa do usu&aacute;rio m | &lt; swap inicializa um swap device ou file. A </P>
<P>primeira p&aacute;gina cont&eacute;m uma assinatura (swap-space) nos &uacute;ltimos 10 bytes, e </P>
<P>cont&eacute;m um mapa de bit. Inicialmente 1's no bitmap significam p&aacute;ginas ruins </P>
<P>A'1' no bitmap significa que a p&aacute;gina correspondente &eacute; livre. Esta p&aacute;gina </P>
<P>nunca &eacute; distribu&iacute;da deste modo a inicializa&ccedil;&atilde;o precisa ser feita somente </P>
<P>uma vez.</P>
<P>The Syscall Swapor ( ) &eacute; chamado pelo user program swapon tipicamente de </P>
<P>/ etc / rc. Algumas p&aacute;ginas da mem&oacute;ria s&atilde;o distribu&iacute;das por swap-map e </P>
<P>swap-lockmap, swap-map cont&eacute;m um byte para cada p&aacute;gina no swapfile. Isto &eacute; </P>
<P>inicializado do bitmap para conter 0 para p&aacute;ginas dispon&iacute;veis e 128 para </P>
<P>p&aacute;ginas que n&atilde;o pode ser usadas. Isto &eacute; para manter uma conta das peti&ccedil;&otilde;es </P>
<P>da troca em cada p&aacute;gina no swap file. Swap-lockmap cont&eacute;m um bit para cada</P>
<P>p&aacute;gina que &eacute; usada para assegurar exclus&atilde;o m&uacute;tua quando lendo ou escrevendo</P>
<P>swap-files.</P>
<P>Quando uma p&aacute;gina da mem&oacute;ria est&aacute; para ser trocada, um &iacute;ndice para posi&ccedil;&atilde;o </P>
<P>da troca &eacute; obtido com uma chamada para get-swap-page ( ). Este &iacute;ndice &eacute; </P>
<P>deste modo guardado em bits 1-31 da page table entry para que a p&aacute;gina </P>
<P>trocada possa ser localizada pela page fault handles, do-no-page ( ) quando</P>
<P> necess&aacute;rio.</P>
<P>Os 7 bits mais altos do &iacute;ndice d&atilde;o o swap file ( ou projeto) e os 24 bits </P>
<P>mais baixos d&atilde;o o n&uacute;mero da p&aacute;gina neste projeto. Isto faz at&eacute; 128 swap </P>
<P>files, cada um com espa&ccedil;o para mais ou menos 64 Gb, mas o espa&ccedil;o em cima </P>
<P>devido o swap map seria grande. Ao inv&eacute;s o tamanho do swap file &eacute; limitado </P>
<P>para 16 Mb, porque o swap map ent&atilde;o toma 1 p&aacute;gina.</P>
<P>A fun&ccedil;&atilde;o swap-duplicate ( ) &eacute; usado por copy-page-tables ( ) para deixar o </P>
<P>processo da child herdar p&aacute;ginas trocadas durante um fork. Isto somente </P>
<P>incrementa a conta mantendo no Swap-map para aquela p&aacute;gina. Cada processo </P>
<P>vai trocar numa c&oacute;pia da p&aacute;gina separa quando acess&aacute;-la. Swap-free diminui </P>
<P>a conta mantendo no swap-map. Quando a conta abaixa para 0 a p&aacute;gina pode </P>
<P>ser redistribu&iacute;da por get-swap-page ( ). Isto &eacute; chamado cada vez que uma </P>
<P>p&aacute;gina trocada &eacute; lida na mem&oacute;ria ( swap-inc ) ou quando uma p&aacute;gina est&aacute; </P>
<P>para ser descartada ( free-one-table ( ), etc ).</P>
<P>5.5 Gerenciamento de Mem&oacute;ria Cache</P>
<P>&nbsp;</P>
<P>5.5.1 Arquitetura de Mem&oacute;ria Cache do Linux (Linux Flush Architecture)</P>
<P>&nbsp;</P>
<P>O TBL &eacute; mais uma entidade virtual do que um modelo estrito quanto a Linux </P>
<P>flush architecture e concernida. </P>
<P>As caracter&iacute;stica &uacute;nica s&atilde;o isto mant&eacute;m em ordem o mapeamento do processo </P>
<P>kernel de algum modo, queira software ou hardware. </P>
<P>C&oacute;digo espec&iacute;fico de arquitetura pode precisar ser modificado quando o </P>
<P>kernel tiver mudado um processo/mapeamento kernel.</P>
<P>O shell (um lugar seguro p/ guardar dinheiro ou coisas) esta entidade &eacute; </P>
<P>essencialmente &quot;memory state&quot;/&quot;estado da mem&oacute;ria&quot; como o flush architecture</P>
<P>o v&ecirc;. Em geral isto tem as propriedades seguintes:</P>
<P>Isto sempre vai segurar c&oacute;pias de dados que podem ser visto como atualizado </P>
<P>pelo processo local.</P>
<P>O funcionamento pr&oacute;prio pode ser relacionado ao TLB e o mapeamento do </P>
<P>processo/Kernel page de algum jeito, isto &eacute; para dizer que eles podem </P>
<P>depender um do outro.</P>
<P>Isto pode, numa configura&ccedil;&atilde;o cache virtual, causar problemas &quot;aliasing&quot; se </P>
<P>uma p&aacute;gina f&iacute;sica &eacute; mapeada no mesmo tempo da que duas p&aacute;ginas virtuais e </P>
<P>por causa dos bits de um endere&ccedil;o usado para catalogar a linha cache, a </P>
<P>mesma por&ccedil;&atilde;o do dedo pode acabar residindo no cache duas vezes, deixando </P>
<P>resultados incompat&iacute;veis.</P>
<P>Projetos e DMA podem ou n&atilde;o ter capacidade para ver a c&oacute;pia de um dedo </P>
<P>mais atualizado que resida no cache do processo local.</P>
<P>Corretamente, &eacute; suposto que a coer&ecirc;ncia num ambiente multiprocessador &eacute; </P>
<P>mantida pelo subsistema cache/mem&oacute;ria. Isto que dizer que, quando um </P>
<P>processador requerer um dado no memory bus de maneira e um outro </P>
<P>processador tem uma c&oacute;pia mais atualizada, de qualquer jeito o requisitor </P>
<P>vai obter uma c&oacute;pia atualizada que perten&ccedil;a um outro processador.</P>
<P>(NOTA: SMP arquiteturas sem hardware cache conferece mechanism s&atilde;o </P>
<P>realmente poss&iacute;veis, o arquitetura current flush n&atilde;o sustenta isto </P>
<P>corretamente, se em algum ponto o Linux apontar em algum sistema onda isto </P>
<P>&eacute; uma quest&atilde;o debatida, eu vou adicionar os ganchos necess&aacute;rios mas n&atilde;o vai</P>
<P>ser bonito)</P>
<P>Sobre o que o Fluch Architecture se importa: sempre, a vis&atilde;o da </P>
<P>administra&ccedil;&atilde;o de mem&oacute;ria hardware de um conjunto de mapeamento do processo </P>
<P>Kernel ser&atilde;o consistentes com aqueles do Kernel page tables.</P>
<P>Se o memory management kernel code faz uma modifica&ccedil;&atilde;o para a user process </P>
<P>page modificando o dado via kernel space alias da p&aacute;gina f&iacute;sica subjacente,</P>
<P>o fio controle de usu&aacute;rio vai ser o dado correto antes que &eacute; permitido </P>
<P>continuar a execu&ccedil;&atilde;o, indiferente da cache architecture e/ou a sem&acirc;ntica.</P>
<P>Em geral, quando o estado do espa&ccedil;o de endere&ccedil;o &eacute; mudado somente (em c&oacute;digo </P>
<P>gen&eacute;rico da administra&ccedil;&atilde;o da mem&oacute;ria kernel nome de generic kernel </P>
<P>management cade) o fluch architecture hook apropriado vai ser chamado </P>
<P>descrevendo que o estado muda totalmente.</P>
<P>Sobre o que o flush architecture n&atilde;o importa: que o mapeamento do DMA </P>
<P>&quot;DMA/driver coer&ecirc;ncia. Isto inclui DMA mappings (no sentido do MMU mappings)</P>
<P>e o cache/DMA dado consist&ecirc;ncia. Estes tipos dez assuntos n&atilde;o devem esta no </P>
<P>flush architecture, veja embaixo como eles devem ser manuseados.</P>
<P>Split Instruction/data cache consist&ecirc;ncia com respeito as modifica&ccedil;&otilde;es </P>
<P>feito para processo de instru&ccedil;&atilde;o de espa&ccedil;o realizado pelo c&oacute;digo de sinal </P>
<P>de despacho signal dispatch cade. De novo, veja embaixo como isto devem ser </P>
<P>manuseado de um outro jeito.</P>
<P>As interfaces para a flushachitesture e como execut&aacute;-los em geral todas as </P>
<P>rotinas descritos embaixo v&atilde;o ser chamados na seq&uuml;&ecirc;ncia seguinte: </P>
<P>Fluch-cache-foo(...); </P>
<P>modify-address-space ();</P>
<P>clush - tlb-foo (...)</P>
<P>a l&oacute;gica aqui &eacute;: Isto pode ser ilegal num arquitetura dada por um peda&ccedil;o de </P>
<P>dado cache para ensistir quando o mapeamento por aquele dado n&atilde;o existe, </P>
<P>portanto o flush deve ocorrer antes que a mudan&ccedil;a &eacute; feita.</P>
<P>&Eacute; poss&iacute;vel para uma arquitetura de MMU/TLB dada realizar um andamento da </P>
<P>tabela hardware table wolk dos kernel page tables, portanto o TLV flush &eacute; </P>
<P>feito depois que os page tables terem sido mudados para que depois o </P>
<P>hardware s&oacute; pode carregar a c&oacute;pia nova da informa&ccedil;&atilde;o de page table para o </P>
<P>TLB void flush - cache - all (void);</P>
<P>void flush - tlb - all (void);</P>
<P>Essas rotinas s&atilde;o para notificar o architecture specific  cade que  </P>
<P>mapeamento do espa&ccedil;o do endere&ccedil;o kernel uma mudan&ccedil;a foi feita ao kernel </P>
<P>address space mappings, que significa que os mapeamentos de todos processos</P>
<P>foram efetivamente mudados.</P>
<P>&nbsp;</P>
<P>5.5.2 Implementa&ccedil;&atilde;o da Mem&oacute;ria Cache </P>
<P>&nbsp;</P>
<P>Uma implementa&ccedil;&atilde;o deve:</P>
<P>&nbsp;</P>
<P>Eliminar todos os entradas do cache que s&atilde;o v&aacute;lidas neste momento quando </P>
<P>flush-cache-all &eacute; invocado isto refere-se ao virtual cache architecture, </P>
<P>se a cache is write-back, essa rotina vai submeter o dado da cache para </P>
<P>mem&oacute;ria antes do que invalidar cada ingresso. Para caches f&iacute;sicos, n&atilde;o &eacute; </P>
<P>necess&aacute;rio realizar uma a&ccedil;&atilde;o j&aacute; que mapeamento f&iacute;sico n&atilde;o tem ponto de </P>
<P>apoio no address space translations.</P>
<P>Para flush-tlb-all todos TLB mappings para o kernel address space devem </P>
<P>ser feito consistente com os OS page tables de qualquer maneira. Norte que </P>
<P>com um arquitetura que possua a na&ccedil;&atilde;oPara flush-tlb-mm, o tlb/mmu hardware </P>
<P>&eacute; para estar localizado num estado onde isto vai ver (agora corrente) </P>
<P>kernel page table entradas para o espa&ccedil;o de endere&ccedil;o pelo mm-strust.</P>
<P>flush_cache_range(struct mm_struct *mm, unsigned long start,</P>
<P>                unsigned long end);</P>
<P>flush_tlb_range(struct mm_struct *mm, unsigned long start,</P>
<P>                unsigned long end);</P>
<P>uma chance para uma particular range do user address no adelrass space </P>
<P>descrito pelo mm-struct passada esta ocorrendo. As duas notas acima para </P>
<P>FLUSH - mm( ) relacionando a mm-struct passada aplicam-se aqui tamb&eacute;m.</P>
<P>Para Flush-cache-range num virtualmente cached system, todas entradas cache </P>
<P>que s&atilde;o colidas pena a range partem para o fim no address space descrito </P>
<P>pelo mm-struect s&atilde;o para ser invalidadas.</P>
<P>Para Flush-tlb-range, qualquer a&ccedil;&atilde;o necess&aacute;ria para causar o MMUITLB </P>
<P>hardware n&atilde;o conter tradu&ccedil;&otilde;es estragados s&atilde;o para ser realizados. Isso </P>
<P>significa que quaisquer tradu&ccedil;&otilde;es est&atilde;o no Kernel page tables no range </P>
<P>start para acabar no address space descrito pelo mm-struet s&atilde;o para que a </P>
<P>administra&ccedil;&atilde;o da mem&oacute;ria hardware ser&aacute; deste ponto avan&ccedil;ado, por qualquer </P>
<P>significado.</P>
<P>void flush_cache_page(struct vm_area_struct *vma, unsigned long address);</P>
<P>void flush_tlb_page(struct vm_area_struct *vma, unsigned long address);</P>
<P>Uma chance para uma &uacute;nica p&aacute;gina no address dentro do usar space para o </P>
<P>address space descrito pelo um area-struet passado esta ocorrendo. Uma </P>
<P>efetiva&ccedil;&atilde;o, se necess&aacute;ria, pode obter na mm-struet  associado para </P>
<P>este address space via uma um - Flags. Este caminho em uma efetiva&ccedil;&atilde;o onde </P>
<P>a instru&ccedil;&atilde;o e dar&aacute; space n&atilde;o s&atilde;o unificados, algu&eacute;m pode conferir para ver </P>
<P>se um-exee esta posto no uma-sum-flags para possivelmente avistar </P>
<P>flushing o instruction space, por exemplos:</P>
<P>As duas notas acima para flush-*-mm( ) concernindo o mm-struct (passado </P>
<P>indiretamente via uma -um-mm) aplica aqui tamb&eacute;m.</P>
<P>&nbsp;</P>
<P>&#9;A implementa&ccedil;&atilde;o deve tamb&eacute;m :</P>
<P>&nbsp;</P>
<P>Para flush-cache-range, num virtualmente cache system, todas entradas cacha </P>
<P>que s&atilde;o validas para a p&aacute;gina no address no address space descrito pelo uma</P>
<P>s&atilde;o para ser invalidados.</P>
<P>Para flush-tlb-range, qualquer a&ccedil;&atilde;o necess&aacute;ria para causar o MMU/TLB </P>
<P>hardware para n&atilde;o conter tradu&ccedil;&otilde;es estragadas s&atilde;o para ser efetuadas. Isto </P>
<P>significa que quaisquer tradu&ccedil;&otilde;es est&atilde;o nos kernel page tables para a </P>
<P>p&aacute;gina no address space descrito pelo uma passado s&atilde;o para que a </P>
<P>administra&ccedil;&atilde;o de mem&oacute;ria hardware, ser&atilde;o vistas deste ponto avan&ccedil;ado de </P>
<P>qualquer maneira.</P>
<P>&nbsp;</P>
<P>5.5.2.1 Carregando o Flush-PAGE para a RAM (Unsigned Long Page);</P>
<P>&nbsp;</P>
<P>Este &eacute; o patinho feio. Mas ser&aacute; sem&acirc;ntica &eacute; necess&aacute;rio em muitas </P>
<P>arquiteturas que precisei para adicionar isto para a arquitetura flush para</P>
<P>linux. Brevemente, quando (como um exemplo) serve um kernel um enode cow, </P>
<P>isto usa o &quot;suposto&quot; mapeamento de todas mem&oacute;rias f&iacute;sicas no espa&ccedil;o kernel</P>
<P>para efetuar a c&oacute;pia da p&aacute;gina em quest&atilde;o para uma nova p&aacute;gina. Este </P>
<P>apresenta um problema para caches virtualmente catalogados que s&atilde;o </P>
<P>write-back escritos de volta na natureza. Neste caso, o Kernel toca duas </P>
<P>p&aacute;ginas f&iacute;sicas no espa&ccedil;o Kernel. A seq&uuml;&ecirc;ncia do c&oacute;digo sendo descrito aqui </P>
<P>essencialmente</P>
<P>&nbsp;</P>
<P> parece como:</P>
<P>do_wp_page()</P>
<P>{</P>
<P>&#9;[ ... ]</P>
<P>&#9;&#9;copy_cow_page(old_page,new_page);</P>
<P>&#9;&#9;flush_page_to_ram(old_page);</P>
<P>&#9;&#9;flush_page_to_ram(new_page);</P>
<P>&#9;&#9;flush_cache_page(vma, address);</P>
<P>&#9;&#9;modify_address_space();</P>
<P>&#9;&#9;free_page(old_page);</P>
<P>&#9;&#9;flush_tlb_page(vma, address);</P>
<P>&#9;[ ... ]</P>
<P>}</P>
<P>&nbsp;</P>
<P>&#9;Alguns dos c&oacute;digos atuais tem sido simplificados para prop&oacute;sitos </P>
<P>espec&iacute;ficos.</P>
<P>&nbsp;</P>
<P>Considere um cache virtualmente catalogados que &eacute; escrito de volta </P>
<P>write-back. Neste momento que a c&oacute;pia da p&aacute;gina acontece para o suposto </P>
<P>espa&ccedil;o kernel, &eacute; poss&iacute;vel para usar space a vis&atilde;o da p&aacute;gina original para </P>
<P>estar no caches (no endere&ccedil;o do usu&aacute;rio, por exemplo, onde o erro esta </P>
<P>ocorrendo). A c&oacute;pia da p&aacute;gina pode trazer este dado (para a p&aacute;gina velha) </P>
<P>dentro do caches. &#9;Ser&aacute; tamb&eacute;m colocado o dado (no novo suporte </P>
<P>kernel mapeado da p&aacute;gina) sendo copiado para dentro da cache, e para </P>
<P>write-back escrever de volta chachas este dado vai ser sujo ou modificado </P>
<P>no cache.</P>
<P>Em tal caso a mem&oacute;ria principal n&atilde;o ser&aacute; a c&oacute;pia mais recente do dado. Os </P>
<P>caches s&atilde;o est&uacute;pidos, ent&atilde;o para a nova p&aacute;gina que estamos dando ao </P>
<P>usu&aacute;rio, sem for&ccedil;ar o dado cached no suposto kernel para a mem&oacute;ria </P>
<P>principal o processo ser&aacute; o conte&uacute;do velho da p&aacute;gina. (Por exemplo </P>
<P>qualquer lixo que estarem l&aacute; antes da c&oacute;pia ter sido feita pelo </P>
<P>processamento COW acima).</P>
<P>Exemplo concreto de flush-page</P>
<P>Considere um processo que divide uma p&aacute;gina, l&ecirc; somente READ-ONLY com </P>
<P>maior uma tarefa (ou varias) no endere&ccedil;o virtual Ox2000, no usar space. </P>
<P>E para prop&oacute;sito espec&iacute;ficos deixe nos dizer que este endere&ccedil;o virtual </P>
<P>mapeia para a p&aacute;gina f&iacute;sica 0x14000.</P>
<P>Se a tarefa 2 tenha escrever para a p&aacute;gina l&ecirc; apenas no endere&ccedil;o 0x2000 n&oacute;s </P>
<P>alteremos um esso e (eventual fragmento do c&oacute;digo) mente resultado no code </P>
<P>fragment mostrando acima no do-WP-PAGE ( ).</P>
<P>O Kernel vai obter uma nova p&aacute;gina para tarefa 2, deixe-nos dizer que esta </P>
<P>e uma p&aacute;gina f&iacute;sica 0x2600, e deixe-nos tamb&eacute;m dizer que os mapeamentos do </P>
<P>suposto Kernel para p&aacute;ginas f&iacute;sicas 0x14000 e 0x26000 podem residir em dias </P>
<P>&uacute;nicos linhas cache ao mesmo tempo buscando no esquema da linha catalogada </P>
<P>deste cache.</P>
<P>O conte&uacute;do da p&aacute;gina e copiado do mapeamento Kernel para p&aacute;gina f&iacute;sica </P>
<P>0x14000 para uns para p&aacute;gina f&iacute;sica 0x26000.</P>
<P>Neste momento, numa arquitetura cache virtualmente catalogada write - back </P>
<P>nos temos uma inconsist&ecirc;ncia potencial. O novo dado copiado dentro da </P>
<P>p&aacute;gina f&iacute;sica 0x26000 n&atilde;o e necess&aacute;rio na mem&oacute;ria principal neste </P>
<P>momento, de fato isto poder&aacute; estar toda no cache apenas no suposto kernel </P>
<P>do endere&ccedil;o f&iacute;sico.</P>
<P>Tamb&eacute;m, o (n&atilde;o modificando, por exemplo, limpo) dado para a (velha) p&aacute;gina </P>
<P>original esta no cache do suposto kernel para p&aacute;gina f&iacute;sica 0x14000, isto </P>
<P>pode produzir uma inconsist&ecirc;ncia mais tarde, ent&atilde;o para proteger isto e </P>
<P>melhor eliminar as c&oacute;pias cached deste dado tamb&eacute;m.</P>
<P>Deixe-nos dizer n&atilde;o escrevemos os dados de volta para a p&aacute;gina no 0x256000 </P>
<P>e nos apenas deixamos isto l&aacute;. </P>
<P>Nos retornar&iacute;amos para a tarefa 2 (Quem teve esta nova p&aacute;gina agora mapeada </P>
<P>no endere&ccedil;o virtual 0x2000) ele completaria sua escrita, ent&atilde;o ele leria </P>
<P>algumas outras por&ccedil;&otilde;es de dados nesta nova p&aacute;gina (por exemplo, esperando o </P>
<P>conte&uacute;do que existe l&aacute; antes). Neste momento seu dado e deixado no cache no</P>
<P>suposto kernel para nova p&aacute;gina f&iacute;sica, o usu&aacute;rio obter&aacute; o que estava na </P>
<P>mem&oacute;ria principal antes da c&oacute;pia para sua leitura. </P>
<P>Isto pode levar a resultados desastrosos.</P>
<P>Conte&uacute;do de uma arquitetura virtual</P>
<P>Numa arquitetura cache virtualmente catalogada, fica o que foi necess&aacute;rio </P>
<P>para fazer a mem&oacute;ria principal consistente com a c&oacute;pia cached da p&aacute;gina </P>
<P>passada do espa&ccedil;o kernel.</P>
<P>Nota: Isto &eacute; na verdade necess&aacute;rio para esta rotina invalidar linhos em um </P>
<P>cache virtual que n&atilde;o escrito de volta &eacute; write - back na natureza. Para ver</P>
<P>porque isto e realmente necess&aacute;rio, refa&ccedil;a o exemplo acima com a tarefa 1 e </P>
<P>2, mas agora fork ( ) ainda outra tarefa 3 antes dos erros do cow ocorreram,</P>
<P>considere o conte&uacute;do do caches no kernel e user space se a seq&uuml;&ecirc;ncia </P>
<P>seguinte ocorre na exata sucess&atilde;o:</P>
<P>&nbsp;</P>
<P>Tarefa 1 l&ecirc; uma parte da p&aacute;gina no 0x2000</P>
<P>Tarefa 2 COW erra a p&aacute;gina no 0x2000</P>
<P>Tarefa 2 efetiva suas escritas para a nova p&aacute;gina no 0x2000</P>
<P>Tarefa 3 COW erra a p&aacute;gina 0x2000 </P>
<P>&nbsp;</P>
<P>Mesmo em um cache n&atilde;o escrito devolta virtualmente catalogado, a tarefa 3 </P>
<P>pode ver o dado inconsistente depois do erro COW se FLUSH-PAGE-TO-RAM n&atilde;o </P>
<P>invalida a p&aacute;gina f&iacute;sica do suposto kernel do cache.</P>
<P>&nbsp;</P>
<P>5.5.2.2 VOID-UP-DATE</P>
<P>&nbsp;</P>
<P>Embora  n&atilde;o estritamente parte da arquitetura flush, em certas arquiteturas </P>
<P>algumas opera&ccedil;&otilde;es e controles precisam ser efetuados aqui para as coisas </P>
<P>darem certo proporcionalmente e para o sistema manter-se consistente.</P>
<P>Em particular, para caches virtualmente catalogados esta rotina deve </P>
<P>conferir para ver que o novo mapeamento que vem sendo adicionado pelo </P>
<P>consente erro de p&aacute;gina n&atilde;o adiciona um bad alias &quot;para o user space&quot;.</P>
<P>Um &quot;Bad Alias&quot; e definido como dois ou mais mapeamentos (pelo menos um dos </P>
<P>quais e escrev&iacute;vel) para duas ou mais o p&aacute;ginas que traduzem para a exata </P>
<P>p&aacute;gina f&iacute;sica, e devido ao algarismo catalogado do cache pode tamb&eacute;m </P>
<P>residir na &uacute;nica e mutualmente exclusiva linhas cache.</P>
<P>Se um BAD ALIAS &eacute; detectado, uma implementa&ccedil;&atilde;o precisa resolver esta </P>
<P>inconsist&ecirc;ncia de alguma maneira, uma solu&ccedil;&atilde;o e andar atrav&eacute;s de todo os </P>
<P>mapeamentos e mudar as page-tables para fazer estas p&aacute;ginas como n&atilde;o </P>
<P>concri&aacute;veis se o hardware permite tal coisa.</P>
<P>As confer&ecirc;ncias para isto s&atilde;o muito simples, tudo que uma implementa&ccedil;&atilde;o </P>
<P>precisa fazer &eacute;:</P>
<P>Se ((uma -Um - Flags 6 (Um - Write/Um - Shared)) confere sua pot&ecirc;ncia mau </P>
<P>supostas, ent&atilde;o para o caso comum (mapeamento escrev&iacute;veis devidos s&atilde;o </P>
<P>extremamente raros) apenas uma compara&ccedil;&atilde;o &eacute; necessitada para sistemas COW </P>
<P>CAHCES virtualmente catalogados.</P>
<P>Implica&ccedil;&otilde;es Referentes a Arquitetura</P>
<P>Arquitetura baseada no Modelo SMP</P>
<P>Dependendo da arquitetura certos consertos podem ser necess&aacute;rios para </P>
<P>permitir a arquitetura FLUSH para trabalhar num sistema SMP.</P>
<P>O principal assunto e se uma das opera&ccedil;&otilde;es FLUSH acima fazem que o sistema </P>
<P>inteiro veja o FLUSH globalmente, ou o FLUSH e apenas garantido para ser </P>
<P>visto pelo processador local.</P>
<P>Em um &uacute;ltimo caso um CROSS CALLING MECHANISM &eacute; necess&aacute;rio. Os dois </P>
<P>correntes sistemas SMP suportados no Linux (Intel e space) usam </P>
<P>inter-processor interrupts para &quot;transmitir&quot; a opera&ccedil;&atilde;o FLUSH e faz </P>
<P>isto correr localmente em todo processador se necess&aacute;rio como um exemplo, </P>
<P>no sistema SUNHM Space todos precessadores no sistema precisam executar o </P>
<P>pedido FLUSH para garantir a consist&ecirc;ncia atrav&eacute;s do sistema </P>
<P>inteiro. &#9;De qualquer modo, nas m&aacute;quinas SUNHD Space, TLB FLUSHES  </P>
<P>efetivamente no processador local s&atilde;o transmitidos sobre o BUS-SYSTEM pelo </P>
<P>hardware e desta forma uma liga&ccedil;&atilde;o cruzada n&atilde;o e necess&aacute;ria .</P>
<P>&nbsp;</P>
<P>5.5.2.3 Implica&ccedil;&otilde;es para arquitetura baseados no contexto MMU/CACHE.</P>
<P>&nbsp;</P>
<P>A id&eacute;ia inteira por tr&aacute;s do conceito de MMU e facilidades do contexto </P>
<P>cache &eacute; para permitir muitos ADDRESS SPACES para dividir os recursos </P>
<P>CACHE/MMU no CPU.</P>
<P>Para levar total vantagem de tal facilidade, e ainda manter a coer&ecirc;ncia </P>
<P>descrita acima, requer-se algumas considera&ccedil;&otilde;es extras do implementador.</P>
<P>As quest&otilde;es envolvidas variam muito de uma implementa&ccedil;&atilde;o para outro, pelo </P>
<P>menos esta tem sido a experi&ecirc;ncia do autor. Mas em particular algumas </P>
<P>destas quest&otilde;es s&atilde;o provavelmente para ser:</P>
<P>A rela&ccedil;&atilde;o do mapeamento do espa&ccedil;o Kernel para os USER-SPACE, num contexto </P>
<P>s&atilde;o convertidas, alguns mapeamentos do sistema kernel tem um atributo </P>
<P>global, naquele o hardware n&atilde;o concerne ele mesmo com o contexto da </P>
<P>informa&ccedil;&atilde;o quando uma tradu&ccedil;&atilde;o &eacute; feita, que tem seu atributo. Desta forma </P>
<P>um FLUSH (em qualquer contexto) de um mapeamento de um Kernel CACHE/MMU </P>
<P>poderia ser suficiente.</P>
<P>De qualquer maneira e poss&iacute;vel um outros implementa&ccedil;&otilde;es para o Kernel para </P>
<P>dividir o contexto chave associado com um ADDRESS SPACE particular. Pode </P>
<P>ser necess&aacute;rio em tal caso andar por todos contextos que s&atilde;o contentemente </P>
<P>v&aacute;lidos e efetuam o Flush completo em cada um para um Kernel Address Space </P>
<P>Flush.</P>
<P>O custo por contexto Flush podem tornar uma quest&atilde;o chave, especialmente </P>
<P>com respeito ao TLB. Por exemplo, se um Tlb Flush e necess&aacute;rio, em um </P>
<P>grande Range de endere&ccedil;os (ou um inteiro Address Space) pode ser mais </P>
<P>prudente distribuir e assumir um nova contexto MMU/para este processo por </P>
<P>causa da efici&ecirc;ncia </P>
<P>&nbsp;</P>
<P>5.5.2.4 Como tratar o que a arquitetura flush n&atilde;o executa com exemplos</P>
<P>&nbsp;</P>
<P>A arquitetura Flush descrita n&atilde;o faz emendas para coer&ecirc;ncia de projetos DMA com dados Cached. Isto tamb&eacute;m n&atilde;o tem provis&otilde;es para nenhuma estrat&eacute;gia de mapeamento necess&aacute;rios pelo DMA e projetos se forem necess&aacute;rios em um certa m&aacute;quina Linux &eacute; Ported To. Nenhuma destas quest&otilde;es s&atilde;o para a arquitetura Flush. Tais quest&otilde;es s&atilde;o negociadas mais claramente no n&iacute;vel do Driver do projeto. O autor est&aacute; mais convencido disto depois de sua experi&ecirc;ncia com um conjunto comum de sparc device drivers que precisaram de toda fun&ccedil;&atilde;o corretamente em mais do que uma hand full de cache/mmu e bus architetures no mesmo kernel. De fato esta implementa&ccedil;&atilde;o &eacute; mais eficiente porque o motorista sabe exatamente quando o DMA precisa ver o dado consistente ou quando o DMA est&aacute; indo criar uma inconsist&ecirc;ncia que deve ser resolvida. </P>
<P>Nenhuma tentativa para atingir este n&iacute;vel de efici&ecirc;ncia via colchetes soma ao c&oacute;digo de administra&ccedil;&atilde;o gen&eacute;rica da mem&oacute;ria kernel seria complexo e muito obscura como um exemplo, considere no sparc como os DMA buffers s&atilde;o manuscrito. Quando um device driver deve efetuar o DMA para/de um &uacute;nico buffer, ou uma dispersa lista de muitos buffers, ele usa um conjunto de rotinas abstratas.</P>
<P>Char * (*mmu_get_scsi_one)(char de char *, unsigned linux_sbus longo de </P>
<P>struct *sbus);</P>
<P> sem  (*mmu_sglist (*mmu_get_scsi_sgl)(struct de efeito *, int, linux_sbus </P>
<P>de struct *sbus);</P>
<P> sem  (*mmu_release_scsi_one)(char de efeito *, unsigned linux_sbus longo </P>
<P>de struct *sbus);</P>
<P> sem (*mmu_sglist (*mmu_release_scsi_sgl)(struct de efeito *, int, </P>
<P>linux_sbus de struct *sbus);</P>
<P> sem  (*mmu_map_dma_area)(unsigned de efeito addr longo, len de int);</P>
<P>Essencialmente o mmu_get_* rotinas s&atilde;o passadas por um indicador ou um conjunto de indicadores e especifica&ccedil;&otilde;es de tamanho para ares no espa&ccedil;o kernel para que o DMA ocorra, eles retornam para o endere&ccedil;o capaz do DMA (por exemplo um que pode ser carregado do controlador do DMA para o transferidor). </P>
<P>Quando o driver &eacute; feiro como DMA e o transferidor tiver completado com o(s) </P>
<P>endere&ccedil;o(s) DMA para que recursos possam ser liberados (se necess&aacute;rio) e cache flushes possam ser efetivados (se necess&aacute;rio). A rotina ter um bloqueio de mem&oacute;ria de DMA por um longo per&iacute;odo de tempo, por exemplo, um motorista de networking usaria isto para uma transmiss&atilde;o de pesquisa ou receber buffers. O argumento final &eacute; uma entidade especifica Sparc que permite o c&oacute;digo do n&iacute;vel da maquina efetuar o mapeamento se o mapeamento do DMA s&atilde;o ordenados em uma base por-bus.</P>
<P>Quest&otilde;es abertas na Arquitetura  CacheH&aacute; pareceres para muita est&uacute;pidas arquiteturas cache l&aacute; fora que queira causar problemas quando um alias est&aacute; situado dentro do cache (mesmo um protegido onde nenhuma das entradas do cache suposto s&atilde;o escreviveis!). </P>
<P>Da nota est&aacute; o mipsr4000 que dar&aacute; uma exce&ccedil;&atilde;o quando tal situa&ccedil;&atilde;o ocorre, elas podem ocorrer quando o processamento cow est&aacute; acontecendo na corrente implementa&ccedil;&atilde;o. No mais chips que fazem algo est&uacute;pido como isto, um exception handler pode flush as entradas no cache que est&aacute; sendo reclamado e tudo est&aacute; em ordem. O autor esta mais concernido sobre o custo dessas exce&ccedil;&otilde;es durante o processamento cow e seus efeitos que ocorrer&atilde;o na performance cow, que essencialmente est&aacute; para flush um user space page e se n&atilde;o o fazendo ent&atilde;o causaria os problemas acima descritos.</P>
<P>Tem sido tardiamente aquecida a conversa sobre muito inteligentes networking hardware. Pode ser necess&aacute;rio estender a arquitetura flush para prover as interfaces e facilidades necess&aacute;rias para estas mudan&ccedil;as para o c&oacute;digo networking. &Eacute; claro que, a arquitetura flush &eacute; sempre sujeita a aperfei&ccedil;oamentos e mudan&ccedil;as para buscar novas quest&otilde;es ou novos hardwares que apresentam um problema que estava at&eacute; este ponto desconhecido </P>
<B><FONT SIZE=4><P>6</FONT><FONT SIZE=5> </FONT><FONT SIZE=4>- USO DO SISTEMA COMO "ROOT" E COMO USU&Aacute;RIO COMUM</P>
</B></FONT><P>&nbsp;</P>
<P>&nbsp;</P>
<P>Aqui o que teremos s&atilde;o apenas recomenda&ccedil;&otilde;es de bom senso e alguns esclarecimentos.</P>
<P>&nbsp;</P>
<P>O usu&aacute;rio root deve ser o administrador do sistema, aquele que tem poder de alterar ou apagar qualquer coisa no micro, at&eacute; todo o Linux ou apenas um pequeno detalhe que poder&aacute; tornar o sistema inoper&aacute;vel. Portanto deve-se utilizar o sistema com esse usu&aacute;rio ou com os poderes dele apenas para manuten&ccedil;&atilde;o do sistema e utilizar o sistema como usu&aacute;rio comum normalmente. Este procedimento torna o sistema mais est&aacute;vel, embora no come&ccedil;o seja mais trabalhoso, pois for&ccedil;a um maior aprendizado do sistema, pois muitas coisas n&atilde;o ser&atilde;o permitidas ao usu&aacute;rio comum. Ent&atilde;o ele dever&aacute; saber como se sair ou ent&atilde;o assume o papel de root.</P>
<P>&nbsp;</P>
<P>Fica o alerta e a recomenda&ccedil;&atilde;o de uso do root com cautela.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>6.1 - SOLU&Ccedil;&Atilde;O PARA SENHA DE ROOT ESQUECIDA</P>
</B></FONT><P>&nbsp;</P>
<P>Inicialize a m&aacute;quina em modo mono-usu&aacute;rio:</P>
<P>Ao ligar a m&aacute;quina, quando aparecer o prompt "LILO Boot: ", digite:</P>
<P>linux init=/bin/bash</P>
<P>&nbsp;</P>
<P>O sistema entrar&aacute; em modo mono-usu&aacute;rio (sem pedir senha, e ent&atilde;o, basta executar os comandos:</P>
<P>cd /etc/rc.d e sbin/mount -w -n -o remount /</P>
<P>&nbsp;</P>
<P>"passwd" para definir a nova senha do super usu&aacute;rio (root).</P>
<P>umount / e CRTL+ALT+DEL</P>
<P>E a&iacute; ele aceita a nova senha.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7 - Dicas de Firewalling com IPFWADM</P>
</B></FONT><P> </P>
<P>&#9;Aviso: Este documento n&atilde;o est&aacute; relacionado com o projeto de </P>
<P>documenta&ccedil;&atilde;o para o Linux (LDP) que no Brasil &eacute; representada pela LDP-BR </P>
<P>em http://www.dca.fee.unicamp.br/~malheiro/linux/LDP-br.html, este </P>
<P>material &eacute; uma tradu&ccedil;&atilde;o t&eacute;cnica e b&aacute;sica somente para auxiliar os colegas </P>
<P>com a leitura em portugu&ecirc;s.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.1 &#9;REQUISITOS M&Iacute;NIMOS</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;Vamos assumir que voc&ecirc; j&aacute; saiba o que &eacute; TCP/IP, Proxy/Gateway, redes </P>
<P>p&uacute;blicas e privadas, um pouco de tecnologia UNIX (Linux), um pouco de </P>
<P>ingl&ecirc;s e que tenha uma enorme vontade de aprender. Se voc&ecirc; est&aacute; disposto a </P>
<P>ler este documento, &eacute; porque voc&ecirc; j&aacute; deve ter lido alguns outros documentos </P>
<P>e tentado algumas vezes a montar um Firewall. </P>
<P>Ent&atilde;o este &eacute; mais um documento de cabeceira de cama.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.2 RETRATA&Ccedil;&Atilde;O</P>
</B></FONT><P>&nbsp;</P>
<P>Eu n&atilde;o me responsabilizo por qualquer dano ocorrido devido &agrave; a&ccedil;&otilde;es baseadas </P>
<P>neste documento. Este documento &eacute; um complemento para quem quiser trabalhar</P>
<P>com Firewalls. Eu n&atilde;o sou, e nem pretendo ser um perito em seguran&ccedil;a. Eu </P>
<P>sou um simples sujeito que leu muito e que gosta de computadores mais do </P>
<P>que a maioria das pessoas. Por favor, eu estou escrevendo isto para pessoas </P>
<P>que estejam interessadas em aprender, e eu n&atilde;o irei ler aposto a minha </P>
<P>vida na precis&atilde;o do que est&aacute; aqui.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.3 DIREITOS AUTORAIS</P>
</B></FONT><P>&nbsp;</P>
<P>A menos que seja contr&aacute;rio, os documentos HOWTO do Linux s&atilde;o registrados </P>
<P>pelos pr&oacute;prios autores respectivos. </P>
<P>Os documentos HOWTO do Linux podem ser reproduzidos e distribu&iacute;dos em todo </P>
<P>ou em parte, em qualquer meio f&iacute;sico ou eletr&ocirc;nico, contanto que esta </P>
<P>advert&ecirc;ncia de direitos autorais seja mantida em todas as c&oacute;pias. A </P>
<P>redistribui&ccedil;&atilde;o comercial &eacute; permitida e &eacute; encorajada; por&eacute;m, o autor iria </P>
<P>gostar de ser notificado de qualquer forma de distribui&ccedil;&atilde;o. </P>
<P>&#9;Todas as tradu&ccedil;&otilde;es, trabalhos derivados, ou trabalhos incorporados </P>
<P>agregados a qualquer Linux devem ser informados nos documentos de HOWTO </P>
<P>abaixo desta advert&ecirc;ncia de direito autorais. Quer dizer, voc&ecirc; pode n&atilde;o </P>
<P>produzir um trabalho derivado de um HOWTO e impor restri&ccedil;&otilde;es adicionais &agrave; </P>
<P>sua distribui&ccedil;&atilde;o. </P>
<P>Exce&ccedil;&otilde;es para estas regras podem ser concedidas sob certas condi&ccedil;&otilde;es; por </P>
<P>favor contate o coordenador do HOWTO em que est&aacute; envolvido. </P>
<P>Em resumo, n&oacute;s desejamos promover a dissemina&ccedil;&atilde;o desta informa&ccedil;&atilde;o por </P>
<P>tantos canais quanto poss&iacute;veis. </P>
<P>Por&eacute;m, n&oacute;s desejamos reter os direito autorais nos documentos de HOWTO, e </P>
<P>gostar&iacute;amos de sermos notificados de qualquer plano para redistribui&ccedil;&atilde;o </P>
<P>dos HOWTO’s.</P>
<P>Se voc&ecirc; tem qualquer pergunta, por favor contate Mark Grennan em </P>
<P>markg@netplus.net.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.4 PORQUE ESCREVER ESTE DOCUMENTO?</P>
</B></FONT><P>&nbsp;</P>
<P>Embora houvesse muitas discuss&otilde;es nestes &uacute;ltimos anos sobre firewalling, eu </P>
<P>achei dif&iacute;cil encontrar informa&ccedil;&otilde;es da qual eu precisava para configurar o </P>
<P>meu Firewall. A vers&atilde;o original deste HOWTO e outros documentos foram </P>
<P>&uacute;teis, mas ainda faltava algum detalhe para que funcionasse perfeitamente. </P>
<P>Eu espero que este documento d&ecirc; a todo mundo informa&ccedil;&atilde;o que elas precisam </P>
<P>para criar um Firewall em minutos, n&atilde;o em semanas (como foi meu caso, </P>
<P>depois de reunir mais de 30 documentos sobre o assunto e analisar o </P>
<P>funcionamento do IPFWADM). </P>
<P>Eu tamb&eacute;m sentia que devia algo &agrave; comunidade Linux.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.5 N&Iacute;VEIS DE SEGURAN&Ccedil;A</P>
</B></FONT><P>&nbsp;</P>
<P>Existe uma classifica&ccedil;&atilde;o de n&iacute;veis de seguran&ccedil;a fornecida pelos sistemas </P>
<P>operacionais. Essa classifica&ccedil;&atilde;o de n&iacute;veis de seguran&ccedil;a &eacute; originalmente </P>
<P>estabelecida pelo Departamento de Defesa dos EUA, que diz que ningu&eacute;m pode </P>
<P>afirmar se um computador &eacute; seguro ou n&atilde;o, mas o administrador de sistema </P>
<P>pode estabelecer n&iacute;veis de seguran&ccedil;a. Todos estes n&iacute;veis dependem da </P>
<P>confian&ccedil;a que voc&ecirc; tem no seu sistema operacional. </P>
<P>Assim: DOS 0%, Windows 98 4%, Windows NT 15%, OS/2 14%, Unix 68%, e assim </P>
<P>por diante.</P>
<P>Os n&iacute;veis de seguran&ccedil;a s&atilde;o representados por letras que v&atilde;o de A a D, e um </P>
<P>n&uacute;mero pode ser usado para subdividir o n&iacute;vel mais adiante, como A1, A2, </P>
<P>etc. O DOS &eacute; um representante de n&iacute;vel D1 ( muito fraco ), </P>
<P>pois n&atilde;o existe sistema de propriedades de arquivos e permiss&otilde;es virtuais, </P>
<P>todos os arquivos pertencem ao usu&aacute;rio atual ou seja, aquele que est&aacute; </P>
<P>usando a m&aacute;quina.</P>
<P>Voc&ecirc;s devem estar se perguntando: e o n&iacute;vel  A1?Ele existe? Caros amigos, </P>
<P>l&aacute; vem aquela frase mais velha do mundo: infelizmente A1 n&atilde;o existe, &eacute; </P>
<P>aquele computador que est&aacute; sem usu&aacute;rio, n&atilde;o est&aacute; ligado na tomada de </P>
<P>energia, e nunca ligado ao cabo telef&ocirc;nico.</P>
<P>Bom, mas com este documento vamos tentar suprir isso. Vamos aprender a </P>
<P>trabalhar com um n&iacute;vel pr&oacute;ximo do C1 ou C2, que &eacute; onde est&aacute; o Unix (que </P>
<P>inclui o Linux). Com a capacidade de evitar que certos usu&aacute;rios vejam </P>
<P>alguns arquivos e at&eacute; mesmo executem certos programas. Existem alguns </P>
<P>sistemas operacionais que apresentam aspecto n&iacute;vel B, mas n&atilde;o atendem a </P>
<P>todos os seus requisitos.</P>
<P>Antes de pensar em um n&iacute;vel de seguran&ccedil;a para o seu computador, voc&ecirc; deve </P>
<P>refletir sobre a dificuldade que usu&aacute;rios teriam nas conex&otilde;es, e que voc&ecirc; </P>
<P>mesmo teria em acessar seu pr&oacute;prio sistema.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6 -  FIREWALLS</P>
</B></FONT><P>&nbsp;</P>
<P>Os Firewalls ganharam grande fama ultimamente com a Seguran&ccedil;a para a </P>
<P>Internet. Um Firewall &eacute; um termo usado para representar uma parte do carro. </P>
<P>Nos carros, os Firewalls s&atilde;o objetos f&iacute;sicos que separam a m&aacute;quina dos </P>
<P>passageiros. O significado deles &eacute; proteger o passageiro no caso de fogo </P>
<P>no motor do carro enquanto ainda o motorista t&ecirc;m acesso aos controles do </P>
<P>mesmo. </P>
<P>Um Firewall em computadores &eacute; um dispositivo que protege uma Rede privada </P>
<P>da parte p&uacute;blica (ou da Internet como um todo).</P>
<P>O computador de Firewall, Firewall "de agora em diante chamado", pode </P>
<P>acessar ambas as Redes, a privada e a p&uacute;blica. A rede privada n&atilde;o pode </P>
<P>alcan&ccedil;ar a p&uacute;blica, e a p&uacute;blica n&atilde;o pode alcan&ccedil;ar os protegidos desta rede.</P>
<P>Para algu&eacute;m alcan&ccedil;ar a rede p&uacute;blica de dentro da rede privada, deve </P>
<P>conectar-se com o Firewall, e usar a rede p&uacute;blica a partir de l&aacute;. </P>
<P>A forma mais simples de um Firewall &eacute; um sistema de home-dual. (um sistema </P>
<P>com duas conex&otilde;es de rede). Se voc&ecirc; pode confiar em TODOS os seus usu&aacute;rios,</P>
<P>voc&ecirc; pode simplesmente configurar o Linux  e todo o mundo ir&aacute; acessar a </P>
<P>Rede P&uacute;blica. Eles o poder&atilde;o atrav&eacute;s de telnet, usar o FTP, ler e-mail, e </P>
<P>usar qualquer outro servi&ccedil;o com que voc&ecirc; conta. </P>
<P>Com esta configura&ccedil;&atilde;o, todos os computadores em sua rede privada saber&atilde;o </P>
<P>qualquer coisa sobre o mundo externo. O sistema em sua rede protegida </P>
<P>precisa de uma rota padr&atilde;o em cada m&aacute;quina para acessar a Rede P&uacute;blica. </P>
<P>Para o Firewall acima trabalhar voc&ecirc; tem que confiar em TODOS os seus </P>
<P>funcion&aacute;rios! Eu n&atilde;o recomendo isto.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6.1 - DESVANTAGEM DOS FIREWALLS</P>
</B></FONT><P>&nbsp;</P>
<P>O problema com os Firewalls &eacute; o caso de ele inibir o acesso a sua rede para </P>
<P>a Internet. S&oacute; servi&ccedil;os do sistema que tem acesso a filtros de passagem o </P>
<P>poder&atilde;o. Como alguns usu&aacute;rios do servidor de Proxy/Gateway acessam o </P>
<P>Firewall, ent&atilde;o possuem direito de acessar qualquer parte de sua rede </P>
<P>privada. </P>
<P>Tamb&eacute;m, h&aacute; alguns tipos novos de clientes de rede que acessam diretamente </P>
<P>a Rede P&uacute;blica. Quando eles querem acess&aacute;-la, voc&ecirc; tem que achar um modo </P>
<P>novo para permitir o controle de acesso  antes de que estes servi&ccedil;os </P>
<P>possam ser usados.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6.2 - FILTRAGEM DE IP’S EM FIREWALLS</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;Um Firewall que filtra trabalhos de IP ao n&iacute;vel de pacote, &eacute; </P>
<P>projetado para o controle do fluxo de pacotes baseado no destino, porta e </P>
<P>informa&ccedil;&atilde;o do tipo de pacote que est&aacute; contido em cada um. Este tipo de </P>
<P>Firewall &eacute; muito seguro mas falta utilit&aacute;rios. O Linux incluiu um software </P>
<P>que filtra pacotes em TCP/IP em vers&otilde;es que possuam kernel come&ccedil;ando com a </P>
<P>vers&atilde;o 1.3.x. Este software se chama IPFWADM, que voc&ecirc; pode obter a </P>
<P>sintaxe de comando no seu pr&oacute;prio Linux, em outros HOWTO’s ou em </P>
<P>http://www.xos.nl/linux/ipfwadm </P>
<B><FONT SIZE=4><P>7.6.3 - EXIG&Ecirc;NCIAS DE HARDWARE</P>
</B></FONT><P>&nbsp;</P>
<P>Para o nosso exemplo, o computador &eacute; um Intel 486 DX2 66 MHz com 16Mb de </P>
<P>mem&oacute;ria e uns 700Mb de parti&ccedil;&atilde;o para o Linux. Este sistema tem duas placas </P>
<P>de rede, uma conectada a nossa rede privada e a outra conectada a uma rede </P>
<P>p&uacute;blica atrav&eacute;s um roteador externo. </P>
<P>Esta &eacute; uma configura&ccedil;&atilde;o b&aacute;sica para o neg&oacute;cio. Voc&ecirc; poderia usar uma placa </P>
<P>de rede para a rede privada e um modem com PPP para a rede p&uacute;blica. O </P>
<P>detalhe &eacute;: o Firewall t&ecirc;m que ter dois n&uacute;meros de IP – um da rede privada </P>
<P>e outro da rede p&uacute;blica.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&#9;Preparando o Linux para o Firewall</P>
<P>&nbsp;</P>
<P>&#9;Compilando o Kernel</P>
<P>&nbsp;</P>
<P>&#9;Comece com uma instala&ccedil;&atilde;o nova de sua distribui&ccedil;&atilde;o de Linux. (Eu usei</P>
<P>o Conectiva Marumbi – baseado no Red Hat 5.1 e os exemplos aqui est&atilde;o </P>
<P>baseado nesta distribui&ccedil;&atilde;o.) </P>
<P>Quanto menos software voc&ecirc; carregar no seu sistema, menor o n&uacute;mero de bugs </P>
<P>de backdoors que podem introduzir problemas de seguran&ccedil;a em seu sistema; </P>
<P>assim carregue s&oacute; um conjunto m&iacute;nimo de aplica&ccedil;&otilde;es. </P>
<P>Escolha um kernel est&aacute;vel. Eu usei o Kernel 2.0.35 do Linux para o meu </P>
<P>sistema. </P>
<P>Assim esta documenta&ccedil;&atilde;o est&aacute; baseado nestas condi&ccedil;&otilde;es. </P>
<P>Voc&ecirc; precisa recompilar o kernel do Linux com as op&ccedil;&otilde;es necess&aacute;rias. Neste </P>
<P>momento, voc&ecirc; deveria ler o Kernel HOWTO, o Ethernet HOWTO e o Net-2 HOWTO </P>
<P>se voc&ecirc; n&atilde;o o fez antes. </P>
<P>Aqui est&aacute; um breve relat&oacute;rio que voc&ecirc; precisa configurar para o firewall. </P>
<P>Eu vou usar o 'make menuconfig' </P>
<P>&nbsp;</P>
<P>Debaixo da configura&ccedil;&atilde;o Geral</P>
<P>Networking Support: ON </P>
<P>&nbsp;</P>
<P>Debaixo das Op&ccedil;&otilde;es de Networking</P>
<P>Network firewalls: ON</P>
<P>TCP/IP Networking: ON</P>
<P>IP forwarding/gatewaying: ON</P>
<P>IP Firewalling: ON</P>
<P>IP firewall packet loggin: ON </P>
<P>IP masquerading: ON</P>
<P>IP accounting: ON</P>
<P>IP tunneling: OFF</P>
<P>IP aliasing: OFF</P>
<P>IP PC/TCP compatibility mode: OFF</P>
<P>IP Reverse ARP: OFF</P>
<P>Drop source routed frames: ON </P>
<P>&nbsp;</P>
<P>Debaixo do suporte para device de network</P>
<P>Network device support: ON</P>
<P>Dummy net driver support: ON</P>
<P>Ethernet (10 or 100Mbit): ON</P>
<P>Selecione a sua placa de rede </P>
<P>&nbsp;</P>
<P>Agora voc&ecirc; deve recompilar, reinstalar o kernel e reiniciar. Sua placa de </P>
<P>rede devem mostrar as informa&ccedil;&otilde;es caso o seu boot tenha ocorrido com </P>
<P>sucesso. Se n&atilde;o, revise os outros HOWTOs novamente at&eacute; que esteja </P>
<P>funcionando.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6.4 - CONFIGURANDO DUAS PLACAS DE REDE</P>
</B></FONT><P>&nbsp;</P>
<P>O m&eacute;todo mais seguro &eacute; voc&ecirc; compilar as placas de rede no kernel em m&oacute;dulo,</P>
<P>deixando assim que o kernel corrija uma automaticamente, e voc&ecirc; s&oacute; precise </P>
<P>instalar uma placa pelos m&oacute;dulos, com o seguinte  comando:</P>
<P>modprobe ne io=[endere&ccedil;o base] irq=[n.º]</P>
<P>&nbsp;</P>
<P>Voc&ecirc; pode adicionar este comando no seu arquivo /etc/rc.d/rc.local ou </P>
<P>/etc/conf.modules (se for no Red Hat, leia os HOWTO’s)</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6.5 - CONFIGURANDO OS ENDERE&Ccedil;OS IP DAS REDES</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;Esta &eacute; a parte realmente interessante. Agora voc&ecirc; tem algumas </P>
<P>decis&otilde;es para fazer. Desde que n&oacute;s n&atilde;o queiramos que a rede p&uacute;blica tenha </P>
<P>acesso a qualquer parte da nossa rede privada, n&oacute;s n&atilde;o precisamos </P>
<P>usar endere&ccedil;os reais para a rede privada. H&aacute; v&aacute;rios endere&ccedil;os de INTERNET </P>
<P>definidos &agrave; parte para as redes privadas, porque todo mundo precisa de mais</P>
<P>endere&ccedil;os e estes endere&ccedil;os n&atilde;o podem cruzar a Internet. </P>
<P>Destes, usaremos a classe  192.168.1.xxx para a rede privada e </P>
<P>200.200.200.xxx para a rede p&uacute;blica como exemplos. </P>
<P>&#9;</P>
<P>&nbsp;</P>
<P>|===========|IP 200.200.200.xxx|================|IP 192.168.1.xxx|========|</P>
<P>Rede P&uacute;blica|------------------|Firewall/Gateway|----------|Rede Privada  |</P>
<P>|===========|&#9;             |================|&#9;&#9;     |========|</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Se voc&ecirc; for usar um filtro de Firewall voc&ecirc; pode usar estes n&uacute;meros. Voc&ecirc; </P>
<P>precisar&aacute; usar IP masquerading para fazer isto funcionar. </P>
<P>Com este processo o Firewall remeter&aacute; os pacotes da rede privada e os </P>
<P>traduzir&aacute; num &quot;IP REAL" para ent&atilde;o dirigir-se para a Internet, pois estes </P>
<P>IP’s n&atilde;o existem na Internet Voc&ecirc; tem que nomear o IP real para a placa de </P>
<P>rede da rede p&uacute;blica (Ex. 200.200.200.1). E, nomear 192.168.1.1 para a </P>
<P>placa de rede da rede privada. Este ser&aacute; o seu endere&ccedil;o de IP do </P>
<P>proxy/gateway. Voc&ecirc; pode nomear todas as outras m&aacute;quinas na rede privada </P>
<P>com algum n&uacute;mero do alcance de 192.168.1.xxx. </P>
<P>(192.168.1.2 at&eacute; 192.168.1.254) </P>
<P>Voc&ecirc; tamb&eacute;m pode usar este esquema para conectar automaticamente atrav&eacute;s de</P>
<P>um modem o seu provedor. </P>
<P>Se voc&ecirc; vai usar um modem para a sua conex&atilde;o com a INTERNET, o seu endere&ccedil;o</P>
<P>de IP de fora ser&aacute; nomeado pelo seu provedor ao se conectar-se.</P>
<P>&#9;Voc&ecirc; deve configurar o resto necess&aacute;rio para a conex&atilde;o, como </P>
<P>endere&ccedil;os de cada placa, rotas, etc. Se voc&ecirc; conseguir conex&atilde;o (teste </P>
<P>atrav&eacute;s de ping), &eacute; porque est&aacute; tudo ok. Procure uma documenta&ccedil;&atilde;o mais </P>
<P>detalhada sobre o restante no seus HOWTO KERNEL, o HOWTO Ethernet e o </P>
<P>HOWTO NET-2.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6.6 - &#9;SEGURAN&Ccedil;A NO FIREWALL</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;O Firewall n&atilde;o &eacute; muito bom se permanecer aberto a ataques por um </P>
<P>servi&ccedil;o novo. Um "sujeito" ruim poderia ganhar acesso para o Firewall e </P>
<P>modificar para as suas pr&oacute;prias necessidades. </P>
<P>Comece desligando qualquer servi&ccedil;o desnecess&aacute;rio. Olhe os arquivos </P>
<P>/etc/inetd.conf e /etc/services. Estes arquivos controlam o que &eacute; chamado d</P>
<P>e "super servidor". Estes controles s&atilde;o um grupo de daemons (servi&ccedil;os) </P>
<P>do servidor e os come&ccedil;a quando eles s&atilde;o pedidos. </P>
<P>Definitivamente desligue o netstat, systat, tftp, bootp, e o finger. Para </P>
<P>desligar um servi&ccedil;o, ponha # como o primeiro car&aacute;ter da linha do servi&ccedil;o. </P>
<P>Quando acabado, envie um SIG-HUP ao processo digitando "kill -HUP </P>
<P>&lt;pid&gt;", onde &lt;pid&gt; &eacute; o n&uacute;mero de processo do inetd. Isto far&aacute; com que o </P>
<P>inetd releia o seu arquivo de configura&ccedil;&atilde;o (inetd.conf) e reinici&aacute;-lo. </P>
<P>Teste atrav&eacute;s do telnet a porta 15 do firewall, a porta do netstat. Se </P>
<P>voc&ecirc; acessar a sa&iacute;da do netstat, voc&ecirc; n&atilde;o reiniciou corretamente.</P>
<P>Cuidado: Tenha muito cuidado com o que voc&ecirc; vai desligar e o que vai </P>
<P>deixar ligado. S&oacute; deixe ligado o estritamente necess&aacute;rio (ver descri&ccedil;&atilde;o de </P>
<P>portas de servi&ccedil;o mais adiante).</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6.7 - CONFIGURA&Ccedil;&Atilde;O DO FILTRO PARA IP (IPFWADM)</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;Para come&ccedil;ar, voc&ecirc; deve ter o IP Forwarding ligado no seu kernel e o </P>
<P>seu sistema deve ser reiniciado e remetendo sempre o IP. Sua tabela de </P>
<P>rotas deve apresentar os lugares e voc&ecirc; deve ter acesso a tudo, ambos </P>
<P>atrav&eacute;s da sa&iacute;da e pela entrada. </P>
<P>Mas, n&oacute;s estamos construindo um Firewall e assim n&oacute;s precisamos come&ccedil;ar </P>
<P>desligado para que todo o mundo tem acesso. </P>
<P>No meu sistema eu criei v&aacute;rias scripts para configurar o Firewall </P>
<P>policiando o forwarding e contando o policiamento. Eu chamo os scripts </P>
<P>dentro do /etc/rc.d assim o meu sistema &eacute; configurado no momento do boot. </P>
<P>Atrav&eacute;s do padr&atilde;o do IP Forwarding o sistema no kernel do Linux remete </P>
<P>tudo. Por causa disto, seu script de Firewall deve come&ccedil;ar negando acesso </P>
<P>para tudo e eliminando qualquer registro da ultima vez que voc&ecirc; o rodou. </P>
<P>Este script far&aacute; este truque. </P>
<P>&nbsp;</P>
<P>? Para negar todos os servi&ccedil;os:</P>
<P>ipfwadm –F –p deny</P>
<P>&nbsp;</P>
<P>? Flush (apagar) todos os comandos dados anteriormente</P>
<P>ipfwadm –F –f </P>
<P>ipfwadm –I  –f</P>
<P>ipfwadm –O –f </P>
<P>&#9;</P>
<P>Primeiramente, n&oacute;s devemos partir dos filtros mais espec&iacute;ficos para os </P>
<P>filtros mais gen&eacute;ricos. Portanto, se voc&ecirc; quiser que todos os usu&aacute;rios da </P>
<P>rede privada tenham acesso total &agrave; rede p&uacute;blica e controlar o acesso a </P>
<P>apenas um usu&aacute;rio, voc&ecirc; deve fazer primeiro o filtro do usu&aacute;rio espec&iacute;fico, </P>
<P>e depois os filtros mais gen&eacute;ricos, do restante dos usu&aacute;rios.</P>
<P>&nbsp;</P>
<P>? Habilitar os servi&ccedil;os de rede do usu&aacute;rio espec&iacute;fico (acessar apenas ftp, </P>
<P>http e mail) para a rede p&uacute;blica, fazendo o masquerade:</P>
<P>ipfwadm –F –a m –b –P tcp -S 192.168.1.x 0:65535 -D 0.0/0 21 25 80 110</P>
<P>&nbsp;</P>
<P>Os par&acirc;metros usados nas linhas acima podem ser obtidos nos HOWTO’s do </P>
<P>pr&oacute;prio IPFWADM. Os prop&oacute;sitos deste documento s&atilde;o apenas fornecer algumas </P>
<P>dicas sobre a montagem de firewall’s, e as portas que definem os servi&ccedil;os </P>
<P>a serem utilizados podem ser obtidas na pr&oacute;pria NET, mas eu farei uma </P>
<P>pequena lista no final deste documento. Se voc&ecirc; quiser adicionar outros </P>
<P>filtros, adicione mais uma linha como a acima com os IP’s diferentes, com </P>
<P>a portas diferentes, etc. </P>
<P>Neste caso estamos aplicando o firewall do tipo foward (-F) , ou seja, os </P>
<P>servi&ccedil;os a serem acessados n&atilde;o est&atilde;o na m&aacute;quina firewall, nem as m&aacute;quinas </P>
<P>que os acessar&atilde;o ser&aacute; a m&aacute;quina firewall.</P>
<P>? Habilitar todos os servi&ccedil;os de rede da rede privada para a rede p&uacute;blica, </P>
<P>fazendo o masquerade, em todos os servi&ccedil;os:</P>
<P>ipfwadm –F –a m -S 192.168.1.0/24 -D 0.0/0</P>
<P>&nbsp;</P>
<P>&#9;O firewall funciona da seguinte forma:  ele vai procurar </P>
<P>primeiramente os filtros nas suas primeiras linhas de configura&ccedil;&atilde;o. Se ele </P>
<P>n&atilde;o encontrar nenhum registro ESPEC&Iacute;FICO daquele acesso, ele vai caindo em </P>
<P>registros mais gen&eacute;ricos, mais globais, at&eacute; que ele caia na primeira linha </P>
<P>do firewall, em que ela nega todo e qualquer tipo de acesso. </P>
<P>Se voc&ecirc; inverter a ordem das linhas, ele vai encontrar um filtro gen&eacute;rico </P>
<P>j&aacute; nas primeiras linhas, ignorando qualquer outro filtro espec&iacute;fico mais </P>
<P>abaixo.</P>
<P>&#9;Com o firewall do jeito que est&aacute;, temos o seguinte: a rede privada </P>
<P>conecta-se com a rede p&uacute;blica em todos os seus servi&ccedil;os, com exce&ccedil;&atilde;o da </P>
<P>m&aacute;quina 192.168.1.x, que tem apenas acesso a ftp, www e mail.</P>
<P>&#9;Se voc&ecirc; tiver algum outro tipo de servi&ccedil;o, como roteamento </P>
<P>funcionando diretamente no linux (sem um router externo entre o linux e a </P>
<P>rede p&uacute;blica), voc&ecirc; tamb&eacute;m pode controlar o acesso da rede p&uacute;blica para os </P>
<P>seus servidores (que estejam em m&aacute;quinas diferentes do Firewall), seguindo </P>
<P>os mesmos procedimentos acima. Se houver um router (n&atilde;o a m&aacute;quina firewall </P>
<P>em quest&atilde;o) entre sua rede p&uacute;blica e seus servidores, voc&ecirc; vai ter de </P>
<P>controlar os acesso localmente, em cada servidor, pois o router deve ter </P>
<P>acesso direto aos servidores para haver conex&atilde;o, fugindo do controle da </P>
<P>m&aacute;quina firewall. Aconselho neste caso, que os servidores tamb&eacute;m sejam em </P>
<P>Linux, para aproveitar os recursos de firewall localmente em cada m&aacute;quina.</P>
<P>&#9;Agora, se voc&ecirc; tiver daemons de servi&ccedil;os rodando na pr&oacute;pria m&aacute;quina </P>
<P>firewall (arquivos /etc/services e /etc/inetd.conf), ou servidores avulsos </P>
<P>rodando linux, voc&ecirc; tamb&eacute;m pode aproveitar esses recursos do IPFWADM </P>
<P>localmente, utilizando os par&acirc;metros de INPUT (-I) e OUTPUT(-O), ao inv&eacute;s </P>
<P>de Fowarding (-F). a sintaxe &eacute; a mesma, s&oacute; que os comandos de INPUT </P>
<P>controlam os acessos destinados AO seu servidor (algum usu&aacute;rio de algum </P>
<P>provedor, por exemplo) e os comandos de OUTPUT controlam os acessos vindos </P>
<P>DO seu servidor para a Rede p&uacute;blica, sempre mantendo a mesma sintaxe (leia </P>
<P>os HOWTO’s do linux)</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6.8 - &#9;SERVI&Ccedil;OS J&Aacute; TESTADOS COM O IPFWADM</P>
</B></FONT><P>&nbsp;</P>
<P>HTTP: testado e funcionando em todas as plataformas;</P>
<P>POP e SMTP: testado e funcionando em todas as plataformas;</P>
<P>Telnet: testado e funcionando em todas as plataformas;</P>
<P>FTP: testado e funcionando em algumas plataformas, carregando o arquivo </P>
<P>ip_masq_ftp.o. Alguns problemas com o WS_FTP32;</P>
<P>Archie: testado e funcionando em algumas plataformas;</P>
<P>NNTP: testado e funcionando em todas as plataformas;</P>
<P>VRML: testado e funcionando em todas as plataformas;</P>
<P>Traceroute: testado e funcionando em algumas plataformas. Algumas varia&ccedil;&otilde;es </P>
<P>do Unix podem n&atilde;o funcionar;</P>
<P>Ping: testado e funcionando em todas as plataformas;</P>
<P>IRC: testado e funcionando em todas as plataformas;</P>
<P>GOPHER: testado e funcionando em todas as plataformas;</P>
<P>WAIS: testado e funcionando em todas as plataformas;</P>
<P>Real Player: testado e funcionando em algumas plataformas, carregando o </P>
<P>arquivo ip_masq_raudio.o.</P>
<P>True Speech Player 1.1b: testado e funcionando sob Windows;</P>
<P>Internet Wave Player: testado e funcionando sob Windows;</P>
<P>Worlds Chat 0.9a: testado e funcionando sob Windows;</P>
<P>Alpha Worlds: testado e funcionando sob Windows;</P>
<P>Internet Phone 3.2: testado e funcionando parcialmente sob Windows: voc&ecirc; </P>
<P>pode chamar algu&eacute;m, mas n&atilde;o ser chamado;</P>
<P>POWWOW: testado e funcionando parcialmente sob Windows: voc&ecirc; pode chamar </P>
<P>algu&eacute;m, mas n&atilde;o ser chamado;</P>
<P>Cu-See-Me: testado e funcionando em todas as plataformas, carregando os </P>
<P>m&oacute;dulos apropriados. Voc&ecirc; pode obt&ecirc;-los no site IP Masquerade Resource</P>
<P>VDOLive: testado e funcionando em Windows, como os m&oacute;dulos apropriados;</P>
<P>PC-Anywhere for Windows: s&oacute; funciona como cliente;</P>
<P>Socket Watch: Usa o protocolo NTP (Network Time Protocol);</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6.9 - SERVI&Ccedil;OS QUE N&Atilde;O FUNCIONAM</P>
</B></FONT><P>Intel Internet Phone: conecta, mas a voz somente funciona em uma via;</P>
<P>Intel Streaming Media Viewer: n&atilde;o conecta com o servidor.</P>
<P>Netscape CoolTalk: n&atilde;o conecta com o lado oposto;</P>
<P>Talk, ntalk: n&atilde;o funciona. Requer ainda um Kernel proxy a ser escrito;</P>
<P>WEBPhone: Ainda n&atilde;o funciona;</P>
<P>X: n&atilde;o testado ainda, mas acredito que n&atilde;o funcione sem algum proxy para </P>
<P>X, o que deve ser feito atrav&eacute;s de algum m&oacute;dulo para o IPFWADM.</P>
<B><FONT SIZE=4><P>7.6.10 - PLATAFORMAS TESTADAS</P>
</B></FONT><P>&nbsp;</P>
<P>Linux;</P>
<P>Solaris;</P>
<P>Windows 95/98;</P>
<P>Windows NT (ambos workstation e server);</P>
<P>Windows For Workgroup 3.11 (com pacote TCP/IP);</P>
<P>Windows 3.1 (com pacote Chamaleon);</P>
<P>Novel 4.01 Server;</P>
<P>OS/2 (com Warp v3);</P>
<P>Macintosh OS (com MacTCP ou Open Transport);</P>
<P>DOS (com pacote NCSA Telnet, DOS Trumpet funciona parcialmente);</P>
<P>Amiga (com AmiTCP ou AS225-stack);</P>
<P>VAX Stations 3520 e 3100 com UCX (TCP/IP stack para VMS) </P>
<P>Alpha/AXP com Linux/Red Hat </P>
<P>SCO Openserver (v3.2.4.2 e 5) </P>
<P>IBM RS/6000 rodando AIX </P>
<P>(algu&eacute;m testou alguma plataforma a mais?) </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>7.6.11 - PORTAS TCP</P>
</B></FONT><P>&nbsp;</P>
<P>Enfim, um resumo das portas utilizadas pelos servi&ccedil;os de TCP/IP</P>
<P>&#9;Os n&uacute;meros das portas est&atilde;o divididos em tr&ecirc;s categorias: As portas </P>
<P>conhecidas (0 a 1023), as portas registradas (1024 a 49151) e as portas </P>
<P>din&acirc;micas ou privadas (49152 a 65535).</P>
<P>&nbsp;</P>
<P>Porta&#9;Protocolo&#9;Servi&ccedil;o/Descri&ccedil;&atilde;o</P>
<P>&nbsp;</P>
<P>&#9;0&#9;TCP/UDP&#9;Reservada</P>
<P>&#9;1&#9;TCP/UDP&#9;TCPMUX - TCP Port Service Multiplexer</P>
<P>&#9;2&#9;TCP/UDP&#9;Compressnet - Management Utility</P>
<P>&#9;3&#9;TCP/UDP&#9;Compressnet - Compression Process</P>
<P>&#9;4&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;5&#9;TCP/UDP&#9;RJE - Remote Job Entry</P>
<P>&#9;6&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;7&#9;TCP/UDP&#9;Echo</P>
<P>&#9;8&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;9&#9;TCP/UDP&#9;Discard</P>
<P>&#9;10&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;11&#9;TCP/UDP&#9;SYSTAT – Active Users</P>
<P>&#9;12&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;13&#9;TCP/UDP&#9;Daytime – RFC 867</P>
<P>&#9;14&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;15&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;16&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;17&#9;TCP/UDP&#9;QOTD – Quote Of The Day</P>
<P>&#9;18&#9;TCP/UDP&#9;MSP – Message Send Protocol</P>
<P>&#9;19&#9;TCP/UDP&#9;CHARGEN – Character Generator</P>
<P>&#9;20&#9;TCP/UDP&#9;FTP-Data – File Transfer Protocol (Default Data)</P>
<P>&#9;21&#9;TCP/UDP&#9;FTP – File Transfer Protocol (Control)</P>
<P>&#9;22&#9;TCP/UDP&#9;SSH – SSH Remote Login Protocol</P>
<P>&#9;23&#9;TCP/UDP&#9;Telnet</P>
<P>&#9;24&#9;TCP/UDP&#9;Algum sistema de mail privado</P>
<P>&#9;25&#9;TCP/UDP&#9;SMTP – Simple Mail Transfer Protocol</P>
<P>&#9;26&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;27&#9;TCP/UDP&#9;NSW-FE – NSW User System FE</P>
<P>&#9;28&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;29&#9;TCP/UDP&#9;MSG-ICP</P>
<P>&#9;30&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;31&#9;TCP/UDP&#9;MSG-AUTH – MSG Authentication</P>
<P>&#9;32&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;33&#9;TCP/UDP&#9;DSP – Display Support Protocol</P>
<P>&#9;34&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;35&#9;TCP/UDP&#9;Algum sistema de servidor de impress&atilde;o</P>
<P>&#9;36&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;37&#9;TCP/UDP&#9;Time </P>
<P>&#9;38&#9;TCP/UDP&#9;RAP – Route Access Protocol</P>
<P>&#9;39&#9;TCP/UDP&#9;RLP – Resource Location Protocol</P>
<P>&#9;40&#9;TCP/UDP&#9;Desabilitada</P>
<P>&#9;41&#9;TCP/UDP&#9;Graphics</P>
<P>&#9;42&#9;TCP/UDP&#9;Nameserver – Host Name Server</P>
<P>&#9;43&#9;TCP/UDP&#9;Nicname – Who Is</P>
<P>&#9;44&#9;TCP/UDP&#9;MPM-Flags – MPM Flags Protocol</P>
<P>&#9;45&#9;TCP/UDP&#9;MPM – Message Processing Module (recep&ccedil;&atilde;o)</P>
<P>&#9;46&#9;TCP/UDP&#9;MPM-SND – MPM (envio padr&atilde;o)</P>
<P>&#9;47&#9;TCP/UDP&#9;NI-FTP</P>
<P>&#9;48&#9;TCP/UDP&#9;AUDITD – Digital Audit Daemon</P>
<P>&#9;49&#9;TCP/UDP&#9;TACACS – Login Host Protocol</P>
<P>&#9;50&#9;TCP/UDP&#9;RE-MAIL-CK – Remote Mail Checking Protocol</P>
<P>&#9;53&#9;UDP&#9;&#9;DNS – Domain Name Server</P>
<P>&#9;66&#9;TCP/UDP&#9;SQL*NET – Oracle SQL*NET</P>
<P>&#9;67&#9;TCP/UDP&#9;BOOTPS – Bootstrap Protocol Client</P>
<P>&#9;69&#9;TCP/UDP&#9;TFTP – Trivial File Tranfer Protocol</P>
<P>&#9;70&#9;TCP/UDP&#9;Gopher</P>
<P>&#9;79&#9;TCP/UDP&#9;Finger</P>
<P>&#9;80&#9;TCP/UDP&#9;HTTP – World Wide Web</P>
<P>&#9;92&#9;TCP/UDP&#9;NPP – Network Printing Protocol</P>
<P>&#9;110&#9;TCP/UDP&#9;POP3 – Post Office Protocol – Version 3</P>
<P>&#9;118&#9;TCP/UDP&#9;SQLSERV – SQL Services</P>
<P>&#9;119&#9;TCP/UDP&#9;NNTP – Network News Transfer Protocol</P>
<P>&#9;2600&#9;TCP/UDP&#9;Quake</P>
<P>&#9;4000&#9;TCP/UDP&#9;ICQ – Mirabilis</P>
<P>&#9;31337&#9;TCP/UDP&#9;BO – Back Orifice</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&#9;E por a&iacute; vai... se voc&ecirc; quiser uma listagem completa das portas TCP </P>
<P>ou qualquer outra informa&ccedil;&atilde;o,  corre&ccedil;&atilde;o ou sugest&atilde;o sobre qualquer conte&uacute;do </P>
<P>deste documento, mande-me um e-mail.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8 - X WINDOW SYSTEM</P>
</B></FONT><P>&nbsp;</P>
<P>X, X Window System, X Version 11, X Window System, Version 11 ou X11 (n&atilde;o diga ou escreva X Windows, por que est&aacute; errado), &eacute; o componente do Linux que serve de intermedi&aacute;rio entre o Linux e o Gerenciador de Janelas (Window Manager).</P>
<P>&nbsp;</P>
<P>O X Window System, X Window ou apenas X &eacute; o servidor gr&aacute;fico.O XFree86 &eacute; uma vers&atilde;o do X para PCs. O startx &eacute; um script que chama o xinit, que por sua vez chama o X e mais outros programas.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.1 - GERENCIADORES DE JANELAS</P>
</B></FONT><P>&nbsp;</P>
<P>Um Gerenciador de Janelas &eacute; um programa que roda sobre o X e serve de intermedi&aacute;rio entre este e o usu&aacute;rio. Uma interface gr&aacute;fica. Que procura tornar mais amig&aacute;vel e pr&aacute;tico o uso do sistema operacional.</P>
<P>&nbsp;</P>
<P>Tem algumas caracter&iacute;sticas do ent&atilde;o Windows 3.1, que era a interface gr&aacute;fica enquanto o DOS era o sistema operacional. Uma grande diferen&ccedil;a no Linux &eacute; que voc&ecirc; pode escolher entre in&uacute;meros Gerenciadores de Janelas.</P>
<P>&nbsp;</P>
<P>Os Gerenciadores de Janelas s&atilde;o abundantes no Linux. Aqui como nas Distribui&ccedil;&otilde;es os gostos variam e deve-se experimentar para ver qual mais se adapta &agrave;s suas necessidades e gostos.</P>
<P>&nbsp;</P>
<P>Os mais comuns s&atilde;o:</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.1.1 KDE</P>
</B></FONT><P>&nbsp;</P>
<P>O mais popular (ocupa a prefer&ecirc;ncia da maioria dos usu&aacute;rios do Linux).</P>
<P>&nbsp;</P>
<P>Uma de suas caracter&iacute;sticas marcantes &eacute; seu suporte a dezenas de idiomas, inclusive ao portugu&ecirc;s do Brasil. Isso j&aacute; facilita e muito para o iniciante que n&atilde;o tem dom&iacute;nio da l&iacute;ngua inglesa.</P>
<P>&nbsp;</P>
<P>Muito f&aacute;cil de utilizar e tem muitos recursos. Gerenciador de arquivos (kfm), que inclusive abre </P>
<P>algumas p&aacute;ginas da INTERNET e outros recursos. Ferramenta para conex&atilde;o &agrave; INTERNET (kppp), </P>
<P>simples e eficiente. Um editorzinho de texto simples e muito bom (kedit) entre diversos outros recursos.</P>
<P>&nbsp;</P>
<P>Seu uso &eacute; intuitivo: Ao ser aberto com kde e Enter (isso no Red Hat, j&aacute; no Slackware &eacute; startx), clique no K abaixo e &agrave; esquerda (vers&atilde;o 1.0) ou na engrenagem (vers&atilde;o 1.1) para abrir um menu tipo o menu iniciar do 95. O resto &eacute; com voc&ecirc;.</P>
<P>&nbsp;</P>
<P>Se quiser mais facilidades, leia o Manual do Kde, que o Hugo Cisneiros traduziu, em </P>
<P>http://www.netdados.com.br/tlm/arquivos/.</P>
<P>&nbsp;</P>
<P>Desvantagem: muito pesado, exige uma m&aacute;quina robusta e com muita mem&oacute;ria. Alternativa para quem ainda n&atilde;o conseguiu outros recursos similares aos do kde: pode-se utilizar qualquer outro Gerenciador de Janelas mais leve e executar a maioria dos utilit&aacute;rios do Kde nesse gerenciador. </P>
<P>Exemplo: quem tem o Kde instalado e usa o Window Maker, pode abrir um xterm (terminal no X) e executar o comando kppp e enter. O utilit&aacute;rio kppp ser&aacute; aberto no Window  Maker.</P>
<P>Pode tamb&eacute;m usar o recurso Run Command para isso.</P>
<P>&nbsp;</P>
<P>O Kde &eacute; mais que um gerenciador de janelas, traz v&aacute;rias outras ferramentas.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>DESINSTALAR KDE DO RED HAT</P>
</B></FONT><P>&nbsp;</P>
<P>Se, por um motivo qualquer, quiser desinstalar o Kde:</P>
<P>&nbsp;</P>
<P>rpm -qa | grep kde &gt; list</P>
<P>rpm -e `cat list`</P>
<P>rm -f list</P>
<P>&nbsp;</P>
<P>Esses comandos podem ser concatenados em uma &uacute;nica linha e podem ser usados para desinstalar </P>
<P>qualquer pacote que inclua v&aacute;rias depend&ecirc;ncias.</P>
<P>&nbsp;</P>
<P>Basta trocar "kde" pela string correspondente ao pacote que deseja ver desinstalado.</P>
<P>&nbsp;</P>
<P>Essa foi do ./Marumbeiro para a Linux-br.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.1.2 - FVWM2 ou 95</B></FONT> - Esse &eacute; o Gerenciador de Janelas, que &eacute; instalado por default no Red Hat e no Slackware (talvez em outros, n&atilde;o sei). Simples, mas que atende as necessidades dos iniciantes (e at&eacute; gente muito boa usa ele).</P>
<P>&nbsp;</P>
<P>Instalado no Red Hat, normalmente ele vem com um Painel de Controle muito &uacute;til: </P>
<P>&nbsp;</P>
<P>configura&ccedil;&atilde;o de impressoras, de modems, de networks (aqui inclui INTERNET) e outros recursos. </P>
<P>Pode ser usado juntamente com os utilit&aacute;rios do Kde tamb&eacute;m. </P>
<P>&nbsp;</P>
<P>Para abrir o Fvwm digite startx e Enter. Esse tem uma barra de tarefas abaixo e um bot&atilde;o iniciar. </P>
<P>Aqui tanto faz clicar no bot&atilde;o iniciar quanto clicar numa &aacute;rea livre da tela que ser&aacute; aberto um menu com os programas.</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>8.1.3 - AFTERSTEP</B></FONT> - Desse n&atilde;o tenho muito o que falar. Ele tem seu grupo de defensores. Tem um visual (original) bonito. Em termos de recursos achei semelhante ao Window Maker. Uma caracter&iacute;stica interessante que vi no Window Maker foi que as figuras ficam mais bonitas (melhor definidas) do que nos outros (talvez chegue perto dele nesse ponto, o After Step).</P>
<P>&nbsp;</P>
<B><P>8.1.4 - WINDOW MAKER</B> - Este foi desenvolvido com a ajuda de um brasileiro (Alfredo Kojima). &Eacute; um WM leve e atraente. Vem com recursos de temas, estilos e pap&eacute;is de paredes (que podem ser trocados com facilidade). Pode ser  personalidado: acrescentando-se menus, itens e teclas de atalho via ambiente gr&aacute;fico: icone do Window Maker Preferences ou via console (editando o arquivo NUstep/Defaults/WMRootMenu.pt que est&aacute; no diret&oacute;rio do usu&aacute;rio).</P>
<P>&nbsp;</P>
<P>&Eacute; compat&iacute;vel com o Gnome.</P>
<P>&nbsp;</P>
<P>Veja dicas sobre a personaliza&ccedil;&atilde; do Window Maker.</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>8<B><FONT SIZE=4>.2 - USO DO XCONFIGURATOR NO RED HAT</P>
</B></FONT><P>&nbsp;</P>
<P>Passe no Reposit&oacute;rio de XF86Config, caso esteja com dificuldades para configurar seu X: &#19; HYPERLINK http://www.oocities.org/SiliconValley/Ridge/3505/x.html &#1;&#20;http://www.oocities.org/SiliconValley/Ridge/3505/x.html&#21;</P>
<P>&nbsp;</P>
<P>Na p&aacute;gina do Felipe Russo (&#19; HYPERLINK http://members.xoom.com/linux_page/ &#1;&#20;http://members.xoom.com/linux_page/&#21;) tem, tipo um driver para as placas SiS.</P>
<P>Muito f&aacute;cil de usar. Se for o RH da Conectiva, mais ainda, pois est&aacute; em portugu&ecirc;s.1- Antes devemos executar o SuperProbe para ver maiores informa&ccedil;&otilde;es sobre a placa de v&iacute;deo. </P>
<P>Digite SuperProbe e Enter. Anote os detalhes.</P>
<P>Tamb&eacute;m devemos ter &agrave; m&atilde;o o manual (ou informa&ccedil;&otilde;es) do monitor.</P>
<P>2- Executar: digite Xconfigurator e Enter;</P>
<P>3- Aparece uma tela de boas vindas e informando que o programa cria o arquivo XF86Config. D&ecirc; uma olhada nas outras informa&ccedil;&otilde;es e Enter;</P>
<P>4- Caso sua placa seja uma placa e v&iacute;deo seja uma placa PCI moderna ela poder&aacute; ser detectada agora, caso contr&aacute;rio escolha o modelo da sua placa na lista. Caso ela n&atilde;o conste voc&ecirc; pode ainda selecionar a op&ccedil;&atilde;o ao final da lista:</P>
<P>Placa n&atilde;o relacionada e selecionar SVGA (como driver para a sua - caso ela seja SVGA). </P>
<P>&Eacute; bom lembrar que aqui o driver informado deve ser o mesmo que foi instalado pelo Red Hat. Caso contr&aacute;rio n&atilde;o funcionar&aacute;. Enter;</P>
<P>5- Abre a tela Configura&ccedil;&atilde;o do Monitor. Selecione o seu na lista e tecle Enter;</P>
<P>6- Abre-se a Tela de configura&ccedil;&atilde;o. Aqui o programa poder&aacute; detectar a resolu&ccedil;&atilde;o e as cores, se voc&ecirc; escolher Detectar. Mas ele j&aacute; sugere n&atilde;o detectar (normalmente n&atilde;o detecta em placas mais antigas). Vamos escolher n&atilde;o detectar e Enter;</P>
<P>7- Abre-se a tela Mem&oacute;ria de V&iacute;deo. Selecione a quantidade de mem&oacute;ria informada pelo SuperProbe e Enter;</P>
<P>8- Agora e tela Configura&ccedil;&atilde;o "Clockchip". Como ele recomenda, apenas tecle Enter;</P>
<P>9- Agora Verifica Clocks. Escolha Ignorar e Enter.</P>
<P>10- Selecionar Modos de V&iacute;deo. Selecione &agrave; vontade, lembrando que as tr&ecirc;s colunas representas as quantidades de cores:</P>
<P>8 bpp                   16 bpp          24 bpp          32 bpp</P>
<P>                        800x600         800x600</P>
<P>                      1024x768       1024x768   </P>
<P>&nbsp;</P>
<P>Marcando as op&ccedil;&otilde;es acima estou escolhendo as resolu&ccedil;&otilde;es de 800x600 e de 1024x768 com 16 bpp (ou 64k cores) e 24 bpp (ou true color - 6.5 milh&otilde;es de cores). </P>
<P>&nbsp;</P>
<P>Selecione e tecle Enter;</P>
<P>11- Aparece a tela Conclu&iacute;do. Aqui diz que se deva dar uma olhada no arquivo que foi gravado (XF86Config) no diret&oacute;rio /etc/X11/ antes de executar o "startx" e tamb&eacute;m ensina como (dentro do X) alternar entre resolu&ccedil;&otilde;es  selecionadas e como sair do X Window. Tecle Enter.</P>
<P>12- Agora voc&ecirc; pode atender &agrave;s recomenda&ccedil;&otilde;es e editar o XF86Config para ajustes ou </P>
<P>simplesmente excetuar "startx".</P>
<P>13- Se tudo correr bem &oacute;timo. Se n&atilde;o, comece tudo novamente (repita os passos de 1 a 5) e na hora de selecionar o monitor escolha Customizar e Enter;</P>
<P>14- Aparece uma tela Configura&ccedil;&atilde;o do Monitor. Enter;</P>
<P>15- Selecione a resolu&ccedil;&atilde;o compat&iacute;vel com o seu e Enter;</P>
<P>16- Selecione a Freq&uuml;&ecirc;ncia Vertical e Enter;</P>
<P>17- Aparece Tela de Configura&ccedil;&atilde;o. Selecione N&atilde;o detectar e Enter;</P>
<P>18- Informe novamente a mem&oacute;ria da sua placa de v&iacute;deo e Enter;</P>
<P>19- Configura&ccedil;&atilde;o do "Clockchip". Tecle Enter;</P>
<P>20- Verifica Clocks. Escolha Ignorar e Enter;</P>
<P>21- Selecione as resolu&ccedil;&otilde;es e quantidade de cores desejadas;</P>
<P>22- Conclu&iacute;do. Enter.</P>
<P>23- Teste "startx" e Enter. Tomara que funcione.</P>
<P>24- Se ainda assim n&atilde;o funcionar, fa&ccedil;a uma c&oacute;pia do XF86Config e saia </P>
<P>experimentando outras caracter&iacute;sticas. Freq&uuml;ente uma boa lista de discuss&atilde;o.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.3 - USO DO XF86SETUP NO SLACKWARE, SUSE E HED HAT</P>
</B></FONT><P>&nbsp;</P>
<P>Normalmente o Slackware e o SuSE j&aacute; vem com o XF86Setup, j&aacute; o Red Hat vem apenas com o Xconfigurator (que os outros n&atilde;o tem). Mas parece que &eacute;  poss&iacute;vel usar qualquer um em qualquer um, pois o Red Hat Marumbi atualizado pela conectiva com XFree86-3.3.3.1 final vem tamb&eacute;m com o XF86Setup. Beleza se  podemos usar mais uma op&ccedil;&atilde;o!</P>
<P>&nbsp;</P>
<P>1 - Para rodar: digite XF86Setup e Enter;</P>
<P>2 - Ele pergunta se deseja usar o XF86Config existente como default. Digite "y" e Enter. Se n&atilde;o funcionar, tente novamente e digite "n";</P>
<P>3 - Pressione Enter para continuar;</P>
<P>4 - Abre a tela do XF86Setup, onde se pode configurar o Mouse, o Teclado, a Placa de V&iacute;deo e os Modos de Exibi&ccedil;&atilde;o. Em others tem algumas coisas  interessantes. Supondo que o mouse e o teclado estejam em ordem, clicar em Card;</P>
<P>5 - Abre-se uma lista de placas de v&iacute;deo. Selecione a sua e clique em Monitor. </P>
<P>Se voc&ecirc; est&aacute; usando Red Hat, lembre de selecionar a mesma que foi detectada durante a instala&ccedil;&atilde;o ou que voc&ecirc; escolheu da lista (pois o Red Hat instala apenas o server para a que voc&ecirc; escolheu e o X n&atilde;o ir&aacute; funcionar em outras placas);</P>
<P>6 - Aqui voc&ecirc; seleciona um monitor com as caracter&iacute;sticas do seu e clica em Modeselection;</P>
<P>7 - Aqui voc&ecirc; pode selecionar v&aacute;rias resolu&ccedil;&otilde;es e apenas um color depth. </P>
<P>Ex.: eu selecionei 800x600 e 1024x768 com 16bpp e clicar em Done;</P>
<P>8 - Ele far&aacute; uns testes para ver se consegue rodar com as caracter&iacute;sticas  selecionadas. Se conseguir ser&aacute; mostrado o resultado na tela e voc&ecirc; pode salvar. </P>
<P>Se n&atilde;o conseguir e voc&ecirc; perder o controle da tela tecle Ctrl+c ou  Ctrl+Alt+BackSpace para voltar ao console e fazer nova tentativa;</P>
<P>9 - Voc&ecirc; deve tentar outra op&ccedil;&atilde;o para o monitor, ajustar as freq&uuml;&ecirc;ncias e se ainda assim n&atilde;o funcionar use o xf86config (veja abaixo).</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><P>8.4 - CONFIGURAR QUALQUER DISTRIBUI&Ccedil;&Atilde;O COM O XF86CONFIG</P>
</B><P>&nbsp;</P>
<P>O xf86config tem uma interface texto (menos amig&aacute;vel que o Xconfigurator e que o XF86Setup).</P>
<P>&nbsp;</P>
<P>1 - Rodar com: xf86config e Enter;</P>
<P>2 - Aparece uma tela dizendo que o programa deve criar um arquivo XF86Config  b&aacute;sico, baseado nas op&ccedil;&otilde;es que voc&ecirc; escolher. Enter para continuar;</P>
<P>3 - Aqui, se voc&ecirc; j&aacute; tiver criado um arquivo XF86Config, ele diz que o arquivo j&aacute; existe. Enter para continuar;</P>
<P>4 - Especificar um tipo de protocolo para o seu mouse. Se voc&ecirc; usa mouse comum com dois ou tr&ecirc;s bot&otilde;es, escolha Microsoft Mouse (a n&atilde;o ser que voc&ecirc; tenha certeza que n&atilde;o &eacute;). Se for um notebook normalmente &eacute; PS/2. Digite um n&uacute;mero correspondente ao seu (veja a lista) e Enter;</P>
<P>5 - Emular 3 bot&otilde;es? "y" ou "n" e Enter;</P>
<P>6 - Agora deve-se dizer onde o mouse est&aacute; conectado com, por exemplo </P>
<P>/dev/tty00. Ou simplesmente pressione Enter para usar o default /dev/mouse.</P>
<P>/dev/mouse &eacute; um link simb&oacute;lico (symlink) para /dev/ttySx). Enter;</P>
<P>7 - Deseja usar XKB? Aqui voc&ecirc; tem a chance de escolher o teclado abnt2, tecle "y" e Enter e selecione. Iremos usar "n" e Enter;</P>
<P>8 - Habilitar Alt keys? "n" e Enter;</P>
<P>9 - Avisa que ir&aacute; solicitar as freq&uuml;&ecirc;ncias do monitor. Enter para continuar;</P>
<P>10 - Selecione um compat&iacute;vel com o seu, digite o n&uacute;mero e Enter;</P>
<P>11 - Agora informa a faixa de freq&uuml;&ecirc;ncia vertical do seu monitor, digitando o n&uacute;mero </P>
<P>correspondente e Enter. Veja que voc&ecirc; pode especificar uma faixa diferente na op&ccedil;&atilde;o 5;</P>
<P>12 - Entrar uma identifica&ccedil;&atilde;o para o seu monitor. Voc&ecirc; pode digitar um nome e teclar Enter ou simplesmente teclar Enter, n&atilde;o far&aacute; diferen&ccedil;a;</P>
<P>13 - Entre o vendor name. Idem, tecle Enter;</P>
<P>14 - Entre o modelo. Idem, tecle Enter;</P>
<P>15 - Quer ver um banco de dados de placas de v&iacute;deo? Tecle "y" e Enter;</P>
<P>16 - Agora voc&ecirc; est&aacute; frente a lista das placas suportadas pelo seu XFree86.</P>
<P>&Eacute; bom ressaltar que se a sua placa n&atilde;o aparecer aqui e se o seu XFree86 n&atilde;o for a &uacute;ltima vers&atilde;o, seria interessante atualizar o seu XFree86. Aqui para rolar a  tela para baixo tecle Enter. Mais uma vez &eacute; bom lembrar que se est&aacute; usando o Red Hat, deve informar o modelo instalado. Selecione a sua, digite o n&uacute;mero e tecle   Enter;</P>
<P>17 - Ele informa sobre a placa selecionada. Lembre o Server que ele informou que ter&aacute; que entrar com ele mais a frente. Tecle Enter;</P>
<P>18 - Agora entre com o n&uacute;mero correspondente ao server indicado na tela anterior (veja que aqui a op&ccedil;&atilde;o 5 serve para selecionar outro Server) e Enter;</P>
<P>19 - Quer configurar o link simb&oacute;lico? Digite "y" e Enter;</P>
<P>20 - Agora informe o n&uacute;mero correspondente a mem&oacute;ria da sua placa de v&iacute;deo. </P>
<P>Antes (caso n&atilde;o saiba) deveria ser executado o SuperProbe para ver essas informa&ccedil;&otilde;es. Digite o n&uacute;mero e Enter;</P>
<P>21 - Agora &eacute; o mesmo que para o monitor. Tecle simplesmente Enter;</P>
<P>22 - Enter novamente;</P>
<P>23 - Enter</P>
<P>24 - Clockchip. Pressione Enter para n&atilde;o testar;</P>
<P>25 - Rodar 'X-probeonly' agora? Digite "n" e Enter;</P>
<P>26 - Vamos escolher a quantidade de cores. Digite o n&uacute;mero e Enter;</P>
<P>&nbsp;</P>
<P>27 - Agora escolher a resolu&ccedil;&atilde;o. Veja que voc&ecirc; pode escolher v&aacute;rias.</P>
<P>Por exemplo: pode escolher 1024x768, 800x600 e 640x480, digitando 432. Digite o n&uacute;mero e Enter;</P>
<P>28 - Agora ele pergunta se voc&ecirc; quer um screen virtual do mesmo tamanho que o screen f&iacute;sico. </P>
<P>Digite "y" e Enter;</P>
<P>29 - Agora digite "5" e Enter</P>
<P>30 - Pergunta se queremos gravar as op&ccedil;&otilde;es em /etc/X11/XF86Config.</P>
<P>Digite "y" e Enter.</P>
<P>Ok, finalizou. Experimente rodar com "startx". Se funcionar, &oacute;timo.</P>
<P>Se n&atilde;o funcionar, ent&atilde;o procure editar o arquivo criado e fazer alguns ajustes ou pe&ccedil;a ajuda em alguma lista de discuss&atilde;o, procurando por quem tenha uma configura&ccedil;&atilde;o igual a sua (placa de video e monitor, principalmente).</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.5 - DICAS EXTRAS SOBRE GERENCIADORES DE JANELAS</P>
</B></FONT><P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.5.1 - CAPTURANDO TELAS COM O GIMP:</P>
</B></FONT><P>&nbsp;</P>
<P>Execute o Gimp e clique, no menu Xtns, em Screen Shot. Selecione a op&ccedil;&atilde;o desejada e clique no bot&atilde;o Grab. Se voc&ecirc; escolheu para capturar uma janela, clique em cima dela com o bot&atilde;o esquerdo. </P>
<P>Para finalizar, clique com o bot&atilde;o direito do mouse em cima da imagem criada e salve-a em um arquivo.</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.5.2 - CAPTURANDO TELAS COM O XV:</P>
</B></FONT><P>&nbsp;</P>
<P>Execute o XV, clique com o bot&atilde;o direito para abrir a janela "xv controls" e clique no bot&atilde;o Grab. </P>
<P>Ajuste suas prefer&ecirc;ncias e clique novamente em Grab. O bot&atilde;o esquerdo do mouse captura uma janela, o bot&atilde;o do meio uma &aacute;rea retangular e o direito cancela. Depois volte para a janela "xv controls" e salve a imagem em um arquivo.</P>
<P> </P>
<P>&nbsp;</P>
<B><P>8.5.3 - AUMENTANDO AS FONTES </B>para quem usa resolu&ccedil;&otilde;es de 800x600 ou 1024x768 ou maior. Se voc&ecirc; fez uma instala&ccedil;&atilde;o personalizada e instalou as fontes de 100 dpi, edite o XF86Config e coloque as fontes de 100 dpi antes das de 75.</P>
<P>&nbsp;</P>
<P>Se voc&ecirc; n&atilde;o notar diferen&ccedil;a no tamanho das fontes dos programas quando abrir o X da pr&oacute;xima vez &eacute; por que voc&ecirc; n&atilde;o instalou as fontes de 100 dpi. Para instalar no Red Hat, monte o CD, acesse o diret&oacute;rio /mnt/cdrom/Red Hat/RPMS e liste ls XFree86*, veja o que tem XFree86-100dpi... ou coisa que o valha.</P>
<P>&nbsp;</P>
<P>Instale com rpm -ivh XFree86-100dpi-fonts... (digite corretamente o nome).</P>
<P>&nbsp;</P>
<P>Se voc&ecirc; usa o Slackware, monte o CD da distribui&ccedil;&atilde;o, acesse o diret&oacute;rio que cont&eacute;m os pacotes e liste tamb&eacute;m para ver direitinho o nome do arquivo do XFree86 com 100 dpi. Instale com installpkg XFree86-100dpi...</P>
<P>&nbsp;</P>
<P>E use o X de maneira mais confort&aacute;vel.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.5.4 - ADICIONAR &Iacute;CONES &Agrave; &Aacute;REA DE TRABALHO DO KDE:</P>
</B></FONT><P>&nbsp;</P>
<P>Pelo K File Manager (kfm): arrastar o &iacute;cone com o bot&atilde;o esquerdo para a &aacute;rea de trabalho. Ele vai perguntar: Mover/Copiar/Link. Escolha o 3o.</P>
<P>&nbsp;</P>
<P>Outra alternativa:</P>
<P>&nbsp;</P>
<P>Use o bot&atilde;o direito do mouse, clique em NEW --&gt; PROGRAM. D&ecirc; o nome do programa, ele criar&aacute; um diret&oacute;rio. Ent&atilde;o clique nesse diret&oacute;rio com o bot&atilde;o  direito do mouse e escolha "PROPERTIES". Edite como quiser. Escolha o PATH para o bin&aacute;rio, o &iacute;cone desejado e etc.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.5.5 - SCREEN SHOT NO GIMP</P>
</B></FONT><P>&nbsp;</P>
<P>1) carregue o gimp</P>
<P>2) clique em xtns</P>
<P>3) clique em screen shot.</P>
<P>4) clique em grab the whole screen.</P>
<P>5) clique em Ok.</P>
<P>6) clique em - para ver o screenshot menor</P>
<P>7) File -&gt; Save...</P>
<P>&nbsp;</P>
<P>Esta foi passada pelo Thadeu Penna para a lista Linux-br.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>8.5.6 -  VISUALIZANDO THUMBNAILS NO XV:</P>
</B></FONT><P>&nbsp;</P>
<P>No XV voc&ecirc; poder&aacute; visualizar todas as imagens contidas em um diret&oacute;rio na forma de pequenos &iacute;cones, cada &iacute;cone mostrando o conte&uacute;do da imagem. Estes &iacute;cones s&atilde;o conhecidos como thumbnail.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Entre no XV e clique com o bot&atilde;o direito para abrir a janela "xv controls".</P>
<P>Clique no bot&atilde;o Windows e selecione "Visual Schnauzer". V&aacute; at&eacute; o diret&oacute;rio desejado e clique no bot&atilde;o Update.</P>
<P>Para abrir a imagem basta dar dois cliques em cima dela.</P>
<P>(Outra da Red Hat Linux Tips.)</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>8.5.7 - COMO INICIAR MAIS DE UMA SESS&Atilde;O X: </P>
</B></FONT><P>&nbsp;</P>
<P>Para executar mais de um X11 voc&ecirc; dever&aacute; adicionar alguns par&acirc;metros, a partir da segunda sess&atilde;o X, ao comando startx. Veja alguns exemplos: </P>
<P>&nbsp;</P>
<P># startx -- :1           (para executar o segundo X11)</P>
<P># startx -- :2 -quiet &amp;  (executa o terceiro X11, silenciosamente e em segundo plano para n&atilde;o bloquear o console)</P>
<P># startx -- :3 -bpp 24   (executa o quarto X11, com uma profundidade</P>
<P>de cor de 24 bits)</P>
<P>&nbsp;</P>
<P>Consulte o t&oacute;pico "Alternando entre consoles virtuais" para saber como alternar entre as sess&otilde;es X. </P>
<P>&nbsp;</P>
<P>(Mais uma da Red Hat Linux Tips.)</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>9</FONT><FONT SIZE=5> -</FONT><FONT SIZE=4>     COMPILA&Ccedil;&Atilde;O DO KERNEL</P>
</B></FONT><P>&nbsp;</P>
<P>O QUE &Eacute; O KERNEL? </P>
<P>&nbsp;</P>
<P>Imagine que um computador seja como uma empresa telef&ocirc;nica e que as informa&ccedil;&otilde;es (liga&ccedil;&otilde;es) venham de fora (assinante discando) e acabem na outra ponta numa secret&aacute;ria eletr&ocirc;nica (HD). </P>
<P>Bem... A central telef&ocirc;nica seria os perif&eacute;ricos que manipulariam estas informa&ccedil;&otilde;es. O t&eacute;cnico que comanda a central seria o KERNEL, seria o todo poderoso, numa compara&ccedil;&atilde;o grosseira, seria o c&eacute;rebro central, que s&oacute; observaria o que se passa e daria ordens aos subordinados. O KERNEL n&atilde;o fica muito envolvido com pequenos detalhes, mas sim, com as grandes quest&otilde;es. Seria  (Deus me perdoe), digamos assim, o Fernando Henrique do seu micro... (no depto. de software, &eacute; claro !!!)</P>
<P>&nbsp;</P>
<P>Cita&ccedil;&atilde;o de mail de um colega da lista linux-br.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>9.1 – GUIA B&Aacute;SICO - DA P&Aacute;GINA DO FELIPE RUSSO</P>
</B></FONT><P>&nbsp;</P>
<P>ATUALIZANDO O KERNEL</P>
<P>&nbsp;</P>
<P>Uma dica: micros que est&atilde;o com bateria arriada (e data atrasada) podem dar problema quando da compila&ccedil;&atilde;o do kernel e de outros programas. Deve-se ajustar o rel&oacute;gio antes com:</P>
<P>&nbsp;</P>
<P>date MMddhhmm[yy] (ver comandos b&aacute;sicos).</P>
<P>&nbsp;</P>
<P>- Independente do Kernel que voc&ecirc; tenha, atualize-o sempre que puder.</P>
<P>- Na pagina www.kernel.org/pub/linux/kernel/v2.0</P>
<P>- Da&iacute; voc&ecirc; pega o arquivo linux : linux-2.0.36.tar.gz (por exemplo)</P>
<P>- Da&iacute; copia esse arquivo para /usr/src</P>
<P>- Acesse /usr/src</P>
<P>- E escreve isso: tar zpvfx linux-2.0.36.tar.gz</P>
<P>- Obs.: claro que se o arquivo estiver em outro formato deve ser usado outro comando</P>
<P>- Assim, ele vai criar um diret&oacute;rio: /usr/src/linux</P>
<P>- Dentro desse diret&oacute;rio voc&ecirc; digita:</P>
<P>- make (vai aparece um monte d coisa)</P>
<P>- make menuconfig (da&iacute; vai entrar num menuzinho que voc&ecirc; p&otilde;e as op&ccedil;&otilde;es de acordo com o seu </P>
<P>PC)</P>
<P>- make dep (um monte d coisa)</P>
<P>- make clean (esse &eacute; r&aacute;pido) </P>
<P>- make zImage (v&aacute; buscar um cafezinho agora)</P>
<P>- make zlilo (s&oacute; ponha esse se voc&ecirc; usa o lilo loader)</P>
<P>- make modules (esse &eacute; r&aacute;pido) (comigo n&atilde;o foi tanto)</P>
<P>- make modules_install (r&aacute;pido)</P>
<P>- Fazendo tudo isso, entre no diret&oacute;rio /usr/src/linux/arch/i386/boot</P>
<P>- Dentro do diret&oacute;rio, copie o arquivo zImage para o diretorio /boot</P>
<P>- Copiando ele, de o boot no seu pc que t&aacute; pronto!</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>9.2 - ESTA FOI DA P&Aacute;GINA TIRA-D&Uacute;VIDAS</P>
</B></FONT><P>&nbsp;</P>
<P>COMPILANDO O KERNEL:</P>
<P>&nbsp;</P>
<P>Primeiro voc&ecirc; tem que pegar o arquivo ou o patch de atualiza&ccedil;&atilde;o que existe em v&aacute;rios lugares onde voc&ecirc; pode encontrar ... ftp.kernel.org ou  "ftp.itp.com.br"</P>
<P> </P>
<P>Instala&ccedil;&atilde;o dos Fontes         </P>
<P>&nbsp;</P>
<P>Se voc&ecirc; pegou o linux-2.0.XX.tar.gz -&gt; XX == Vers&atilde;o do Kernel </P>
<P>&nbsp;</P>
<P>1 - cd /usr/src </P>
<P>2 - tar -zxvf linux-2.0.XX.tar.gz </P>
<P>&nbsp;</P>
<P>Mas se voc&ecirc; pegou o patch </P>
<P>1 - cd /usr/src </P>
<P>2 - gzip -cd patchXX.gz | patch -p0 </P>
<P>Ap&oacute;s ter aplicado os patch`s verifique se algum foi rejeitado: </P>
<P>&nbsp;</P>
<P>1 - cd /usr/src </P>
<P>2 - find linux -name *.rej </P>
<P>Se ocorrer de aparecer algum .rej algo est&aacute; errado. Volte para os passos</P>
<P>acima !</P>
<P>&nbsp;</P>
<P>Para apagar os arquivos antigos que foram atualizados execute: </P>
<P>&nbsp;</P>
<P>1 - cd /usr/src </P>
<P>2 - find -name linux -exec rm {} \; </P>
<P>3 - cd /usr/src/linux </P>
<P>4 - make mrproper</P>
<P>&nbsp;</P>
<P>("para garantir que n&atilde;o existe arquivos .o antigos")</P>
<P>&nbsp;</P>
<P>Configurando o Kernel</P>
<P>Execute:</P>
<P>&nbsp;</P>
<P>1 - cd /usr/src/linux </P>
<P>2 - make menuconfig ("caso voc&ecirc; esteja na shell") &lt;- Mais r&aacute;pida </P>
<P>3 - make xconfig ("se voc&ecirc; estiver na interface gr&aacute;fica") </P>
<P>Cuidado  - N&atilde;o marque drives desnecess&aacute;rios, tornar&atilde;o o kernel maior</P>
<P>e podem trazer problemas.</P>
<P>Escolhendo as op&ccedil;&otilde;es para o novo kernel</P>
<P>^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^</P>
<P>&nbsp;</P>
<P>Veremos agora cada op&ccedil;&atilde;o para a correta configura&ccedil;&atilde;o do kernel: </P>
<P>CODE MATURITY LEVEL OPTIONS * </P>
<P>Esta op&ccedil;&atilde;o possibilita de se utilizar features do kernel ainda na sua</P>
<P>fase alfa. </P>
<P>&nbsp;</P>
<P>Se voc&ecirc; n&atilde;o quer ter problemas n&atilde;o marque nada. </P>
<P>LOADABLE MODULE SUPPORT Enable loadable module support * </P>
<P>Suporte a modules no kernel. M&oacute;dulos s&atilde;o pequenos peda&ccedil;os de c&oacute;digo </P>
<P>compilado que pode ser incorporados ao kernel em tempo de execu&ccedil;&atilde;o.</P>
<P>Se tiver d&uacute;vida sobre o assunto marque. </P>
<P>&nbsp;</P>
<P>Set version information on all symbols for modules * </P>
<P>Utilizando esta op&ccedil;&atilde;o, &eacute; poss&iacute;vel utilizar a mesma vers&atilde;o de </P>
<P>um determinado m&oacute;dulo com kernel novo. </P>
<P>&nbsp;</P>
<P>Kernel daemon support * </P>
<P>Quando um driver ou filesystem &eacute; compilado como m&oacute;dulo, sua ativa&ccedil;&atilde;o</P>
<P>deve ser feita pelo pr&oacute;prio operador atrav&eacute;s do comando insmod.</P>
<P>&nbsp;</P>
<P>Esta op&ccedil;&atilde;o torna isso autom&aacute;tico, pois esta tarefa &eacute; repassada pelo</P>
<P>kernel daemon kerneld. </P>
<P>&nbsp;</P>
<P>GENERAL SETUP Kernel math emulation * </P>
<P>Caso seu processador n&atilde;o possua co-processador aritm&eacute;tico selecione</P>
<P>esta op&ccedil;&atilde;o. </P>
<P>&nbsp;</P>
<P>Obs: Ele ser&aacute; automaticamente desabilitado caso seu sistema possua</P>
<P>um co-processador.</P>
<P>&nbsp;</P>
<P>Networking support * </P>
<P>Marque sempre esta op&ccedil;&atilde;o (op&ccedil;&otilde;es rede e inet) </P>
<P>&nbsp;</P>
<P>Limit memory to low 16MB * </P>
<P>Esta op&ccedil;&atilde;o &eacute; &uacute;til para motherboards que tem problemas para trabalhar com mais </P>
<P>que 16 MB de RAM. </P>
<P>&nbsp;</P>
<P>PCI BIOS support * </P>
<P>Sistemas que possuem placas PCI conectadas devem selecionar esta op&ccedil;&atilde;o. </P>
<P>&nbsp;</P>
<P>System V IPC *</P>
<P>Suporte a Intel Process Communication (uso recomendado) Kernel support</P>
<P>For A.OUT binaries * </P>
<P>&nbsp;</P>
<P>Formato antigo de execut&aacute;veis do Linux. </P>
<P>&nbsp;</P>
<P>Kernel support for ELF binaries * </P>
<P>Suporte a execut&aacute;veis do tipo ELF (Executable and Linkable Format). </P>
<P>&nbsp;</P>
<P>Kernel support for JAVA binaries * </P>
<P>Suporte a execut&aacute;veis Java</P>
<P>&nbsp;</P>
<P>Compila kernel as ELF * </P>
<P>Marque Processador type * </P>
<P>&nbsp;</P>
<P>Tipo de processador utilizado pelo sistema. Escolhendo 386 ele roda</P>
<P>em qualquer tipo de CPU acima. </P>
<P>Floppy, IDE, And other block devices * </P>
<P>Suporte a floppy disk.</P>
<P>&nbsp;</P>
<P>Include IDE/ATAPI CDROM support * Se voc&ecirc; tiver CDROM usando o protocolo </P>
<P>ATAPI selecione. </P>
<P>&nbsp;</P>
<P>Include IDE/ATAPI TAPE Support * </P>
<P>Suporte a unidade de fita que usa o protocolo </P>
<P>&nbsp;</P>
<P>ATAPI SCSI emulation support * </P>
<P>Este driver seria emula&ccedil;&atilde;o SCSI para dispositivos IDE ATAPI. </P>
<P>&nbsp;</P>
<P>1 - Copie o arquivo para o diretorio /usr/src </P>
<P>2 - cd /usr/src </P>
<P>3 - rm -rf linux </P>
<P>4 - tar zxvpf "linux-2.0.35.gz"</P>
<P>5 - cd /usr/include </P>
<P>6 - rm -rf asm linux scsi </P>
<P>&nbsp;</P>
<P>7 - rm -rf asm linux scsi </P>
<P>8 - ln -s /usr/src/linux/include/asm-i386 asm </P>
<P>9 - ln -s /usr/src/linux/include/linux linux </P>
<P>10- ln -s /usr/src/linux/include/scsi scsi </P>
<P>11- cd /usr/src/linux </P>
<P>12- make mrproper </P>
<P>13- make menuconfig (ou make config ou ainda make xconfig no x-win) </P>
<P> </P>
<P>Agora voc&ecirc; entrr&aacute; modo "gr&aacute;fico"...</P>
<P>&nbsp;</P>
<P> </P>
<P>Entre na op&ccedil;&atilde;o "Networking Options" e Marque as op&ccedil;&otilde;es:</P>
<P>ATEN&Ccedil;&Atilde;O: Para marcar as op&ccedil;&otilde;es aperte espa&ccedil;o at&eacute; achar a desejada...</P>
<P>ATEN&Ccedil;&Atilde;O: Marque as op&ccedil;&otilde;es abaixo e n&atilde;o mexa nas que J&Aacute; EST&Atilde;O MARCADAS!</P>
<P>&nbsp;</P>
<P>[*] Network Firewalls</P>
<P>[*] TCP/IP Networking</P>
<P>[*] IP: Firewalling</P>
<P>[*] IP: Firewall packet logging</P>
<P>[*] IP: Masquerading</P>
<P>[*] IP: ICMP Masquerading</P>
<P>[*] IP: Always defragment</P>
<P>[*] IP: Drop Sourde routed Frames</P>
<P>[*] IP: Allow large Windows (not remment if &lt;16 MB of memory)</P>
<P>[*] The IPX protocol "Se voc&ecirc; tiver placa de Rede"</P>
<P>V&aacute; at&eacute; a op&ccedil;&atilde;o "Network Device Support" e Marque as op&ccedil;&otilde;es:</P>
<P>&nbsp;</P>
<P>[*] Network Device Support</P>
<P>[M] Dummy net driver support</P>
<P>[*] Plip (Parallel port support)</P>
<P>[*] Ppp (Point to Point) Support</P>
<P>[*] Slip (Serial Line) Support</P>
<P>[*] Ethernet (10 or 100MBit)</P>
<P>[*] 3Com Cards</P>
<P>[*] Other Isa Cards "Se voc&ecirc; tiver placa de Rede"</P>
<P>[*] Ne200/Ne1000 support "Se voc&ecirc; tiver placa de Rede"</P>
<P>Agora v&aacute; at&eacute; a op&ccedil;&atilde;o "Filesystems" e Marque as op&ccedil;&otilde;es:</P>
<P>&nbsp;</P>
<P>[*] Minix fs support filesystem</P>
<P>[*] Second extended fs support</P>
<P>[*] Native language support (Unicode, codepages) [*] Dos Fat fs support</P>
<P>[*] VFAT (Windows-95) fs support</P>
<P>[*] /Proc filesystem support</P>
<P>[*] NFS filesystem support</P>
<P>[*] ISO9660 CDROM filesystem support</P>
<P> </P>
<P>Agora v&aacute; at&eacute; a op&ccedil;&atilde;o "Sound" e Marque suas op&ccedil;&otilde;es: "Se voc&ecirc; tiver som.."</P>
<P>O Exemplo abaixo foi feito com a placa de Som Sound Blaster 16 mais</P>
<P>se voc&ecirc; for marcar outro tipo de placa de som n&atilde;o esque&ccedil;a de marcar: [*] </P>
<P>/dev/dspand </P>
<P>&nbsp;</P>
<P>/dev/audio support</P>
<P>&nbsp;</P>
<P>[*] Sound Card support</P>
<P>[*] Sound Blaster (SB, SBPRO, SB16, Clones) Support</P>
<P>[*] /dev/dsp and /dev/audio support</P>
<P>Ap&oacute;s isso voc&ecirc; tem que arrumar abaixo a IRQ da sua placa. A padr&atilde;o</P>
<P>&eacute; 5 mais pode ser 7 ou outras voc&ecirc; vai ter que ficar testando ou ver o</P>
<P>manual.</P>
<P>&nbsp;</P>
<P>(220) I/O base for SB check from manual of the card</P>
<P>(5) Sound Blaster IRQ chechk from manual</P>
<P>(1) Sound DMA 0, 1 or 3</P>
<P>(5) Sound Blaster 16 bit DMA (_REQUIRED_for SB16, Jazz16, SMW) 5, 6 o</P>
<P>(0) MPU401 I/O base of SB16, Jazz16 and ES1688 Check from manual of t</P>
<P>(-1) SB MPU401 IRQ (Jazz16, SM Wave and ES1688) Use -1 with SB16</P>
<P>(65536) Audio DMA buffer size 4096, 16384, 32768 or 65536</P>
<P>[ ] Additional low level drivers</P>
<P>Agora salve na op&ccedil;&atilde;o "Save Configuration to an Alternate File" e quando</P>
<P>ele perguntar s&oacute; d&ecirc; um enter e era isso.</P>
<P>D&ecirc; um Exit e quando ele perguntar:</P>
<P>"Do you wish to save your new kernel configuration?" d&ecirc; um "yes"</P>
<P>&nbsp;</P>
<P>Agora que voc&ecirc; est&aacute; na shell "#" digite: make dep ; make clean ; make</P>
<P>modules ; make modules_install ; make zImage ; make zlilo "enter"</P>
<P>ATEN&Ccedil;&Atilde;O: Se voc&ecirc; usar diskete para iniciar ao linux inv&eacute;s de zlilo</P>
<P>use zdisk </P>
<P>Depois &eacute; s&oacute; dar um "reboot e era isso".</P>
<P>Maiores detalhes sobre o assunto leia HOW-TOO`s Autor: bash.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>9</FONT><FONT SIZE=4>.3 - ESTA FOI DA RED HAT LINUX TIPS</P>
</B></FONT><P>&nbsp;</P>
<P>ATUALIZANDO E COMPILANDO O KERNEL:</P>
<P>&nbsp;</P>
<P>O kernel &eacute; a parte principal do Linux, faz o gerenciamento de todos os recursos de seu computador. </P>
<P>Quando voc&ecirc; instala o Linux, o sistema &eacute;  executado com um kernel pr&eacute;-compilado pelos fornecedores da sua distribui&ccedil;&atilde;o  (Red Hat, Slackware, Debian, etc). Este kernel, para poder ser compat&iacute;vel com a maioria dos computadores, foi compilado para ser o mais gen&eacute;rico poss&iacute;vel,  prejudicando a sua performance, pois ele tem que vir com a grande maioria dos m&oacute;dulos instalados e ainda funcionar em todos os processadores existentes (a partir de um 386).</P>
<P>&nbsp;</P>
<P>Para isso devemos sempre recompilar o kernel, para adapt&aacute;-lo ao hardware da sua m&aacute;quina. E al&eacute;m disso, freq&uuml;entemente &eacute; lan&ccedil;ado uma nova vers&atilde;o do kernel, em que s&atilde;o corrigidos os bugs e ou acrescentados novos recursos. Se voc&ecirc; pretender atualiz&aacute;-lo ter&aacute; que compilar esta nova vers&atilde;o.</P>
<P>&nbsp;</P>
<P>Existem dois tipos de kernel, os est&aacute;veis e os em desenvolvimento, diferenciados na numera&ccedil;&atilde;o da vers&atilde;o. A numera&ccedil;&atilde;o tem o formato x.y.z, onde x.y &eacute; a vers&atilde;o e z &eacute; a corre&ccedil;&atilde;o. Se o y for um n&uacute;mero &iacute;mpar ent&atilde;o o kernel est&aacute; em  desenvolvimento.</P>
<P>&nbsp;</P>
<P>Ex.:    linux-2.0.36 -&gt; vers&atilde;o est&aacute;vel</P>
<P>       linux-2.1.96 -&gt; vers&atilde;o em desenvolvimento</P>
<P>&nbsp;</P>
<P>O kernel que vem nas distribui&ccedil;&otilde;es &eacute; a vers&atilde;o est&aacute;vel, se voc&ecirc; pretende  atualiz&aacute;-lo procure compilar uma vers&atilde;o est&aacute;vel tamb&eacute;m, para n&atilde;o ter problemas. </P>
<P>&nbsp;</P>
<P>A &uacute;ltima vers&atilde;o est&aacute;vel &eacute; a 2.0 e atualmente est&aacute; no n&iacute;vel de corre&ccedil;&atilde;o 36. A vers&atilde;o em </P>
<P>desenvolvimento &eacute; uma vers&atilde;o para testes, onde os programadores ficam estudando novos recursos adicionados ao kernel, portanto &eacute; uma vers&atilde;o inst&aacute;vel.</P>
<P>&nbsp;</P>
<P>Os pr&eacute;-requisitos para compilar o kernel s&atilde;o: ter instalado o compilador C (GCC), as bibliotecas C (libc), ter espa&ccedil;o em disco suficiente e estar logado como root.</P>
<P>&nbsp;</P>
<P>O arquivo com as fontes do kernel pode ser encontrado nos seguintes endere&ccedil;os:</P>
<P>&nbsp;</P>
<P>ftp://ftp.kernel.org/pub/linux/kernel/v2.0/</P>
<P>ftp://sunsite.unc.edu/pub/Linux/kernel/v2.0/</P>
<P>&nbsp;</P>
<P>L&aacute; ser&atilde;o encontrados todos os arquivos do kernel da s&eacute;rie 2.0, o &uacute;ltimo &eacute; o arquivo linux-2.0.36.tar.gz.</P>
<P>&nbsp;</P>
<P>Este arquivo dever&aacute; ser descompactado no diret&oacute;rio /usr/src. No Red Hat, quando se opta por instalar as fontes do kernel na instala&ccedil;&atilde;o do Linux, os arquivos das fontes ficam do diret&oacute;rio /usr/src/linux-2.0.zz. E no diret&oacute;rio  /usr/src existe um link simb&oacute;lico /usr/src/linux apontando para /usr/src/linux-2.0.zz.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Veja um exemplo:</P>
<P># cd /usr/src</P>
<P># ls -l</P>
<P>total 1</P>
<P>lrwxrwxrwx  1    root  root    13 Jun 9 01:33   linux -&gt; linux-2.0.34/</P>
<P>drwxr-xr-x 15    root  root  1024 Jun 9 01:45   linux-2.0.34</P>
<P>&nbsp;</P>
<P>Quando o arquivo linux-2.0.zz.tar.gz &eacute; descompactado (dentro do /usr/src),  &eacute; criado o diret&oacute;rio linux/ com todos os arquivos e subdirect&oacute;rios dentro dele, para formar o diret&oacute;rio /usr/src/linux. </P>
<P>Como existe um link com esse nome, devemos remov&ecirc;-lo primeiro: (lembre-se, primeiro voc&ecirc; entrou no diret&oacute;rio /usr/src com o comando "cd /usr/src")</P>
<P>&nbsp;</P>
<P># rm linux</P>
<P>&nbsp;</P>
<P>Agora descompacte a nova vers&atilde;o (no exemplo o arquivo est&aacute; no</P>
<P>/usr/local/tgz):</P>
<P>&nbsp;</P>
<P># tar xzvf /usr/local/tgz/linux-2.0.36.tar.gz</P>
<P>&nbsp;</P>
<P>Renomeie o diret&oacute;rio chamado linux (criado com o tar) para algo mais </P>
<P>informativo:</P>
<P>&nbsp;</P>
<P># mv linux linux-2.0.36</P>
<P>&nbsp;</P>
<P>E crie o link simb&oacute;lico linux apontando para ele (pois o importante</P>
<P>&eacute; que exista o caminho /usr/src/linux):</P>
<P>&nbsp;</P>
<P># ln -s linux-2.0.36 linux</P>
<P>&nbsp;</P>
<P>Seguindo o exemplo, o diret&oacute;rio /usr/src ter&aacute; agora:</P>
<P># ls -l</P>
<P>&nbsp;</P>
<P>total 1</P>
<P>&nbsp;</P>
<P>lrwxrwxrwx  1    root  root    13 Nov 15 02:05   linux -&gt; linux-2.0.36/</P>
<P>drwxr-xr-x 15    root  root  1024 Jun  9 01:45   linux-2.0.34</P>
<P>drwxr-xr-x 15    root  root  1024 Nov 15 01:45   linux-2.0.36</P>
<P>&nbsp;</P>
<P>Se voc&ecirc; quiser, poder&aacute; remover o diret&oacute;rio linux-2.0.34.</P>
<P>&nbsp;</P>
<P># rm -rf linux-2.0.34</P>
<P>&nbsp;</P>
<P>Entre agora no diret&oacute;rio linux/ (# cd linux), porque daqui pra frente</P>
<P>todos os comandos dever&atilde;o ser digitados pelo diret&oacute;rio /usr/src/linux.</P>
<P>&nbsp;</P>
<P>Se voc&ecirc; quer apenas recompilar o kernel j&aacute; instalado pela sua distribui&ccedil;&atilde;o</P>
<P>em vez de atualiz&aacute;-lo para uma outra vers&atilde;o, fa&ccedil;a apenas o procedimento</P>
<P>deste ponto em diante. E s&oacute; lembrando, entre no diret&oacute;rio /usr/src/linux.</P>
<P>Primeiramente, &eacute; recomend&aacute;vel utilizar o comando make mrproper. Ele</P>
<P>ir&aacute; remover os arquivos de configura&ccedil;&atilde;o de compila&ccedil;&otilde;es anteriores (se n&atilde;o for a</P>
<P>primeira compila&ccedil;&atilde;o que esteja fazendo):</P>
<P>&nbsp;</P>
<P># make mrproper</P>
<P>Agora vamos configurar o kernel. Existem tr&ecirc;s maneiras de configur&aacute;-lo:</P>
<P>&nbsp;</P>
<P>make config -&gt; &Eacute; feita uma seq&uuml;&ecirc;ncia de perguntas para serem respondidas</P>
<P>com y (sim), n (n&atilde;o) e m (m&oacute;dulo).</P>
<P>&nbsp;</P>
<P>make menuconfig -&gt; Um programa semelhante ao programa de instala&ccedil;&atilde;o</P>
<P>do Red Hat, com menus dividindo cada categoria de op&ccedil;&otilde;es (necessita da </P>
<P>biblioteca curses). </P>
<P>&nbsp;</P>
<P>Basta responder ao item desejado com y (sim), n (n&atilde;o) e m (m&oacute;dulo).</P>
<P>&nbsp;</P>
<P>make xconfig -&gt; Um programa com menus para ser executado no X Window </P>
<P>(necessita das bibliotecas do X11 e Tcl/Tk). Novamente basta responder</P>
<P>ao item desejado com y (sim), n (n&atilde;o) e m (m&oacute;dulo).</P>
<P>&nbsp;</P>
<P>Em alguns itens &eacute; necess&aacute;rio uma resposta mais espec&iacute;fica (n&uacute;meros</P>
<P>de IRQs por  exemplo).</P>
<P>&nbsp;</P>
<P>Recomendo usar o menuconfig, digitando:</P>
<P>&nbsp;</P>
<P># make menuconfig</P>
<P>&nbsp;</P>
<P>Voc&ecirc; poder&aacute; salvar a configura&ccedil;&atilde;o escolhida em um arquivo, para usar</P>
<P>em uma pr&oacute;xima compila&ccedil;&atilde;o. Mas, independente disso, quando sair do programa,</P>
<P>responda positivamente para que sejam gravadas as configura&ccedil;&otilde;es! Ap&oacute;s voc&ecirc; ter</P>
<P>decidido o que deve e o que n&atilde;o deve ser instalado, use o seguinte comando para</P>
<P>gerar as depend&ecirc;ncias entre os arquivos da fonte:</P>
<P>&nbsp;</P>
<P># make dep</P>
<P>&nbsp;</P>
<P>Para for&ccedil;ar uma compila&ccedil;&atilde;o completa do kernel, use o comando abaixo,</P>
<P>assim n&atilde;o ser&aacute; aproveitado os objetos produzidos em uma compila&ccedil;&atilde;o anterior:</P>
<P>&nbsp;</P>
<P># make clean</P>
<P>&nbsp;</P>
<P>Agora est&aacute; tudo pronto para compilar o kernel, execute o comando abaixo</P>
<P>para iniciar a compila&ccedil;&atilde;o (demora cerca de 5 minutos em um P200 com 64mb</P>
<P>de RAM e 12 minutos em um P100 com 16mb de RAM):</P>
<P>&nbsp;</P>
<P># make zImage</P>
<P>&nbsp;</P>
<P>Ser&aacute; criado o arquivo zImage no diret&oacute;rio /usr/src/linux/arch/i386/boot,</P>
<P>que &eacute; a imagem compactada do kernel.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Opcionalmente poder&aacute; ser executado o seguinte comando para criar uma</P>
<P>imagem do kernel em um disquete (coloque um disco vazio no drive), para usar</P>
<P>como disco de boot:</P>
<P>&nbsp;</P>
<P># make zdisk</P>
<P>&nbsp;</P>
<P>Agora antes de criar os m&oacute;dulos, mova (renomear) o antigo conjunto</P>
<P>de m&oacute;dulos, atrav&eacute;s do seguinte comando (mova-os para um diret&oacute;rio qualquer):</P>
<P>&nbsp;</P>
<P># mv /lib/modules/2.0.zz /lib/modules/2.0.zz-old</P>
<P>&nbsp;</P>
<P>Ent&atilde;o crie e instale os m&oacute;dulos com os seguintes comandos:</P>
<P>&nbsp;</P>
<P># make modules</P>
<P>&nbsp;</P>
<P># make modules_install</P>
<P>&nbsp;</P>
<P>Copie a imagem do kernel rec&eacute;m criada na compila&ccedil;&atilde;o para o diret&oacute;rio</P>
<P>mais adequado no Red Hat (/boot), renomeando-a para um nome mais usual (pode</P>
<P>ser qualquer nome):</P>
<P>&nbsp;</P>
<P># cp arch/i386/boot/zImage /boot/vmlinuz-2.0.36</P>
<P>Agora edite o arquivo /etc/lilo.conf (ex.: vi /etc/lilo.conf) para</P>
<P>trocar o nome da imagem antiga para esta nova imagem. Veja um exemplo do </P>
<P>lilo.conf no Red Hat:</P>
<P>&nbsp;</P>
<P>boot=/dev/hda</P>
<P>map=/boot/map</P>
<P>install=/boot/boot.b</P>
<P>prompt</P>
<P>timeout=50</P>
<P>other=/dev/hda1</P>
<P>        label=dos</P>
<P>        table=/dev/hda</P>
<P>image=/boot/vmlinuz-2.0.34-0.6</P>
<P>        label=linux</P>
<P>        root=/dev/hda5</P>
<P>        read-only</P>
<P>&nbsp;</P>
<P>Voc&ecirc; dever&aacute; alterar a linha "image=/boot/vmlinuz-2.0.34-0.6" trocando</P>
<P>pelo nome dado a nova imagem do kernel, que seguindo o exemplo a linha ficaria </P>
<P>&nbsp;</P>
<P>"image=/boot/vmlinuz-2.0.36".</P>
<P>&nbsp;</P>
<P>Para sua seguran&ccedil;a, mantenha a entrada da imagem antiga e adicione</P>
<P>no final do arquivo, uma nova entrada para a nova imagem do kernel. Assim voc&ecirc;</P>
<P>ter&aacute; mais uma op&ccedil;&atilde;o na inicializa&ccedil;&atilde;o da m&aacute;quina. Acrescente isto:</P>
<P>&nbsp;</P>
<P>image=/boot/vmlinuz-2.0.36</P>
<P>        label=linux-novo</P>
<P>        root=/dev/hda5</P>
<P>        read-only</P>
<P> </P>
<P>Quando terminar de alterar o /etc/lilo.conf execute o comando abaixo</P>
<P>para gravar estas informa&ccedil;&otilde;es na MBR do seu HD:</P>
<P>&nbsp;</P>
<P># /sbin/lilo</P>
<P>&nbsp;</P>
<P>Agora &eacute; s&oacute; reiniciar a m&aacute;quina com o comando:</P>
<P>&nbsp;</P>
<P># reboot</P>
<P>&nbsp;</P>
<P>Observe as mensagens geradas na inicializa&ccedil;&atilde;o do sistema, para ter</P>
<P>certeza que tudo est&aacute; ocorrendo bem. Se aparecer algum erro talvez seja </P>
<P>necess&aacute;rio recompilar o kernel, at&eacute; obter um resultado adequado. Se n&atilde;o houver</P>
<P>problemas edite o lilo.conf novamente, removendo a entrada da imagem antiga </P>
<P>deixando somente a imagem rec&eacute;m criada.</P>
<P>&nbsp;</P>
<P>E evite criar uma imagem do kernel sobrecarregada, somente selecione</P>
<P>nas configura&ccedil;&otilde;es as op&ccedil;&otilde;es que a sua m&aacute;quina for usar, assim seu sistema</P>
<P>ter&aacute; uma boa performance.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>9.4 - Na p&aacute;gina Ano 2001 tamb&eacute;m tem um bom roteiro para compilar</P>
<P>um  kernel novo, na se&ccedil;&atilde;o t&oacute;picos Avan&ccedil;ados (veja a url nas refer&ecirc;ncias).</P>
<P> </P>
<P>&nbsp;</P>
<P>9.5 - No The Linux Manual (do Hugo Cisneiros, veja Refer&ecirc;ncia) tamb&eacute;m </P>
<P>existe um guia para recompilar o kernel (veja a url nas refer&ecirc;ncias).</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>9.6 - UM GUIA EM INGL&Ecirc;S J&Aacute; PARA O KERNEL 2.2.XX</P>
</B></FONT><P>&nbsp;</P>
<P>&nbsp;</P>
<P>Linux Source DriverLinux kernel </P>
<P>&nbsp;</P>
<P>release 2.2.xxThese are the release notes for Linux version 2.2.  Read</P>
<P>them carefully,  as they tell you what this is all about, explain how to</P>
<P>install the kernel, and what to do if something goes wrong. </P>
<P>&nbsp;</P>
<P>However, please make sure you don't ask questions which are already</P>
<P>answered in various files in the Documentation directory.  See DOCUMENTATION </P>
<P>below.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>WHAT IS LINUX?</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>  Linux is a Unix clone written from scratch by Linus Torvalds with  </P>
<P>assistance from a loosely-knit team of hackers across the Net.   It aims towards</P>
<P>POSIX compliance. </P>
<P>&nbsp;</P>
<P>  It has all the features you would expect in a modern fully-fledged  </P>
<P>Unix, including true multitasking, virtual memory, shared libraries,   demand</P>
<P>loading, shared copy-on-write executables, proper memory   management and TCP/IP </P>
<P>networking. </P>
<P>&nbsp;</P>
<P>  It is distributed under the GNU General Public License - see the   </P>
<P>accompanying COPYING file for more details. </P>
<P>&nbsp;</P>
<P>ON WHAT HARDWARE DOES IT RUN?</P>
<P>&nbsp;</P>
<P>  Linux was first developed for 386/486-based PCs.  These days it also  </P>
<P>runs on ARMs, DEC Alphas, SUN Sparcs, M68000 machines (like Atari and   Amiga),</P>
<P>MIPS and PowerPC, and others.</P>
<P>&nbsp;</P>
<P> DOCUMENTATION:</P>
<P>&nbsp;</P>
<P> </P>
<P> - There is a lot of documentation available both in electronic form</P>
<P>on    the Internet and in books, both Linux-specific and pertaining to    </P>
<P>general UNIX </P>
<P>&nbsp;</P>
<P>questions.  I'd recommend looking into the documentation    subdirectories</P>
<P>on any Linux ftp site for the LDP (Linux Documentation    Project) books. </P>
<P>This README is not meant to be documentation on the    system: there are much</P>
<P>better sources available.</P>
<P>&nbsp;</P>
<P>  - There are various readme's in the kernel Documentation/ subdirectory:</P>
<P>   these typically contain kernel-specific installation notes for some     </P>
<P>drivers for example. See ./Documentation/00-INDEX for a list of what   </P>
<P>is contained in each file.  Please read the Changes file, as it    contains </P>
<P>information about the problems, which may result by upgrading    your</P>
<P>kernel.</P>
<P>INSTALLING the kernel:</P>
<P>&nbsp;</P>
<P> - If you install the full sources, do a</P>
<P>&nbsp;</P>
<P>      cd /usr/src</P>
<P>      gzip -cd linux-2.2.XX.tar.gz | tar xfv -</P>
<P>   to get it all put in place. Replace "XX" with the version number of</P>
<P>the latest kernel.</P>
<P>&nbsp;</P>
<P> - You can also upgrade between 2.2.xx releases by patching.  Patches</P>
<P>are distributed in the traditional gzip and the new bzip2 format.  To</P>
<P>install by patching, get all the newer patch files and do</P>
<P>&nbsp;</P>
<P>      cd /usr/src</P>
<P>      gzip -cd patchXX.gz | patch -p0</P>
<P>&nbsp;</P>
<P>   or</P>
<P>&nbsp;</P>
<P>      cd /usr/src</P>
<P>      bzip2 -dc patchXX.bz2 | patch -p0</P>
<P> </P>
<P>&nbsp;</P>
<P>   (repeat xx for all versions bigger than the version of your current   </P>
<P>source tree, _in_order_) and you should be ok.  You may want to remove    the</P>
<P>backup files (xxx~ or xxx.orig), and make sure that there are no    failed </P>
<P>patches (xxx# or xxx.rej). If there are, either you or me has</P>
<P>&nbsp;</P>
<P>   made a mistake.</P>
<P>&nbsp;</P>
<P>   Alternatively, the script patch-kernel can be used to automate this    </P>
<P>process.  It determines the current kernel version and applies any    patches </P>
<P>found.</P>
<P>&nbsp;</P>
<P>      cd /usr/src</P>
<P>      linux/scripts/patch-kernel</P>
<P> </P>
<P>   The default directory for the kernel source is /usr/src/linux, but   </P>
<P>can be specified as the first argument.  Patches are applied from    the current </P>
<P>directory, but an alternative directory can be specified    as the second </P>
<P>argument.</P>
<P>&nbsp;</P>
<P> - Make sure you have no stale .o files and dependencies lying around:</P>
<P>&nbsp;</P>
<P>      cd /usr/src/linux</P>
<P>      make mrproper</P>
<P> </P>
<P>&nbsp;</P>
<P>   You should now have the sources correctly installed.</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P>SOFTWARE REQUIREMENTS</P>
<P>&nbsp;</P>
<P>   Compiling and running the 2.2.x kernels requires up-to-date    versions</P>
<P>of various software packages.  Consult    ./Documentation/Changes for the</P>
<P>minimum version numbers required    and how to get updates for these packages. </P>
<P>Beware that using    excessively old versions of these packages can cause </P>
<P>indirect    errors that are very difficult to track down, so don't assume that   </P>
<P>you can just update packages when obvious problems arise during    build or </P>
<P>operation.</P>
<P>&nbsp;</P>
<P> CONFIGURING the kernel:</P>
<P>&nbsp;</P>
<P>  - Do a "make config" to configure the basic kernel.  "make config" needs    </P>
<P>bash to work: it will search for bash in $BASH, /bin/bash and /bin/sh   </P>
<P>(in that order), so one of those must be correct for it to work. </P>
<P>&nbsp;</P>
<P>   Do not skip this step even if you are only upgrading one minor    version.  </P>
<P>New configuration options are added in each release, and    odd problems</P>
<P>will turn up if the configuration files are not set up    as expected.  If you</P>
<P>want to carry your existing configuration to a    new version with minimal</P>
<P>work, use "make oldconfig", which will    only ask you for the answers to new </P>
<P>questions.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P> - Alternate configuration commands are:</P>
<P>&nbsp;</P>
<P>   "make menuconfig"  Text based color menus, radiolists &amp;amp; dialogs.</P>
<P>   "make xconfig"     X windows based configuration tool.</P>
<P>   "make oldconfig"   Default all questions based on the contents of</P>
<P>&nbsp;</P>
<P>            your existing ./.config file.</P>
<P>&nbsp;</P>
<P>   </P>
<P>   NOTES on "make config":</P>
<P>&nbsp;</P>
<P>   - having unnecessary drivers will make the kernel bigger, and can     </P>
<P>under some circumstances lead to problems: probing for a      nonexistent </P>
<P>controller card may confuse your other controllers    </P>
<P>&nbsp;</P>
<P>- compiling the kernel with "Processor type" set higher than 386</P>
<P>     will result in a kernel that does NOT work on a 386.  The</P>
<P>     kernel will detect this on bootup, and give up.</P>
<P>  - A kernel with math-emulation compiled in will still use the</P>
<P>     coprocessor if one is present: the math emulation will just</P>
<P>     never get used in that case.  The kernel will be slightly larger,</P>
<P>     but will work on different machines regardless of whether they</P>
<P>     have a math coprocessor or not. </P>
<P> </P>
<P>&nbsp;</P>
<P>   - the "kernel hacking" configuration details usually result in a</P>
<P>     bigger or slower kernel (or both), and can even make the kernel</P>
<P>     less stable by configuring some routines to actively try to</P>
<P>     break bad code to find kernel problems (kmalloc()).  Thus you</P>
<P>    should probably answer 'n' to the questions for</P>
<P>&nbsp;</P>
<P>          "development", "experimental", or "debugging" features.</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P> - Check the top Makefile for further site-dependent configuration</P>
<P>   (default SVGA mode etc). </P>
<P> </P>
<P> - Finally, do a "make dep" to set up all the dependencies correctly. </P>
<P>&nbsp;</P>
<P>COMPILING the kernel:</P>
<P>&nbsp;</P>
<P> - Make sure you have gcc-2.7.2 or newer available.  It seems older gcc</P>
<P>    versions can have problems compiling newer versions of Linux.  This</P>
<P>    is mainly because the older compilers can only generate "a.out"-format    </P>
<P>executables.</P>
<P>&nbsp;</P>
<P>  As of Linux 2.1.0, the kernel must be compiled as na    "ELF" binary. </P>
<P>If you upgrade your compiler, remember to get the new    binutils package too</P>
<P>(for as/ld/nm and company).</P>
<P>&nbsp;</P>
<P>   Please note that you can still run a.out user programs with this   kernel.</P>
<P>&nbsp;</P>
<P>  - Do a "make zImage" to create a compressed kernel image.  If you want   </P>
<P>to make a boot disk (without root filesystem or LILO), insert a floppy   </P>
<P>in your A: drive, and do a "make zdisk".  It is also possible to do    "make </P>
<P>zlilo" if you have lilo installed to suit the kernel makefiles,    but you may </P>
<P>want to check your particular lilo setup first. </P>
<P>&nbsp;</P>
<P> - If your kernel is too large for "make zImage", use "make bzImage"  </P>
<P>instead.</P>
<P>&nbsp;</P>
<P> - If you configured any of the parts of the kernel as `modules', you   </P>
<P>will have to do "make modules" followed by "make modules_install".    Read </P>
<P>Documentation/modules.txt for more information.  For example,    an explanation </P>
<P>of how to use the modules is included there.</P>
<P>&nbsp;</P>
<P> - Keep a backup kernel handy in case something goes wrong.  This is     </P>
<P>especially true for the development releases, since each new release   </P>
<P>contains new code which has not been debugged.  Make sure you keep a    backup </P>
<P>of the modules corresponding to that kernel, as well.  If you   are installing</P>
<P>a new kernel with the same version number as your   working kernel, make a</P>
<P>backup of your modules directory before you   do a "make modules_install".</P>
<P>&nbsp;</P>
<P> - In order to boot your new kernel, you'll need to copy the kernel   </P>
<P>image (found in /usr/src/linux/arch/i386/boot/zImage after compilation)    to</P>
<P>the place where your regular bootable kernel is found. </P>
<P>&nbsp;</P>
<P>    For some, this is on a floppy disk, in which case you can "cp    </P>
<P>/usr/src/linux/arch/i386/boot/zImage /dev/fd0" to make a bootable    floppy.  </P>
<P>Please note that you can not boot a kernel by    directly dumping it to</P>
<P>a 720k double-density 3.5" floppy.  In this case, it is highly recommended</P>
<P>that you install LILO on your    double-density boot floppy or switch to high-</P>
<P>density floppies.</P>
<P>&nbsp;</P>
<P>    If you boot Linux from the hard drive, chances are you use LILO which   </P>
<P>uses the kernel image as specified in the file /etc/lilo.conf.  The    kernel</P>
<P>image file is usually /vmlinuz, or /zImage, or /etc/zImage. </P>
<P>&nbsp;</P>
<P>   To use the new kernel, save a copy of the old image and copy the new   </P>
<P>image over the old one.  Then, you MUST RERUN LILO to update the    loading </P>
<P>map!!</P>
<P>If you don't, you won't be able to boot the new kernel    image. </P>
<P>&nbsp;</P>
<P>    Reinstalling LILO is usually a matter of running /sbin/lilo.     You may</P>
<P>wish to edit /etc/lilo.conf to specify an entry for your    old kernel image</P>
<P>(say, /vmlinux.old) in case the new one does not    work.  See the LILO docs</P>
<P>for more information. </P>
<P>&nbsp;</P>
<P>   After reinstalling LILO, you should be all set.  Shutdown the system,    </P>
<P>reboot, and enjoy!</P>
<P>&nbsp;</P>
<P>   If you ever need to change the default root device, video mode,    ramdisk </P>
<P>size, etc.  in the kernel image, use the 'rdev' program (or    alternatively</P>
<P>the LILO boot options when appropriate).  No need to    recompile the kernel</P>
<P>to change these parameters. </P>
<P> - Reboot with the new kernel and enjoy. </P>
<P>&nbsp;</P>
<P>IF SOMETHING GOES WRONG:</P>
<P> - If you have problems that seem to be due to kernel bugs, please check   </P>
<P>the file MAINTAINERS to see if there is a particular person associated   </P>
<P>with the part of the kernel that you are having trouble with. If there   isn't</P>
<P>anyone listed there, then the second best thing is to mail   them to me </P>
<P>&nbsp;</P>
<P>&lt;AHREF="mailto:torvalds@transmeta.com"&gt;torvalds@transmeta.com&lt;/A&gt;),</P>
<P>&nbsp;</P>
<P>and possibly to any other   relevant mailing-list or to the newsgroup. </P>
<P>The mailing-lists are  useful especially for SCSI and NETworking problems,</P>
<P>as I can't test    either of those personally anyway. </P>
<P>&nbsp;</P>
<P> - In all bug-reports, *please* tell what kernel you are talking about,   </P>
<P>how to duplicate the problem, and what your setup is (use your common    sense). </P>
<P>If the problem is new, tell me so, and if the problem is    old, please try</P>
<P>to tell me when you first noticed it.</P>
<P>&nbsp;</P>
<P>  - If the bug results in a message like</P>
<P>&nbsp;</P>
<P>    unable to handle kernel paging request at address C0000010</P>
<P>   Oops: 0002</P>
<P>   EIP:   0010:XXXXXXXX</P>
<P>   eax: xxxxxxxx   ebx: xxxxxxxx   ecx: xxxxxxxx   edx: xxxxxxxx</P>
<P>   esi: xxxxxxxx   edi: xxxxxxxx   ebp: xxxxxxxx</P>
<P>   ds: xxxx  es: xxxx  fs: xxxx  gs: xxxx</P>
<P>   Pid: xx, process nr: xx</P>
<P>   xx xx xx xx xx xx xx xx xx xx</P>
<P> </P>
<P>&nbsp;</P>
<P>   or similar kernel debugging information on your screen or in your   </P>
<P>system log, please duplicate it *exactly*.  The dump may look    </P>
<P>incomprehensible to you, but it does contain information that may    help </P>
<P>debugging the problem.  </P>
<P>&nbsp;</P>
<P>The text above the dump is also    important: it tells something about</P>
<P>why the kernel dumped code (in    the above example it's due to a bad kernel </P>
<P>pointer). </P>
<P>&nbsp;</P>
<P>More information   on making sense of the dump is in Documentation/oops-</P>
<P>tracing.txt</P>
<P>&nbsp;</P>
<P> - You can use the "ksymoops" program to make sense of the dump.  Find    </P>
<P>the C++ sources under the scripts/ directory to avoid having to do    </P>
<P>the dump lookup by hand:</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P> - In debugging dumps like the above, it helps enormously if you can   </P>
<P>look up what the EIP value means.  The hex value as such doesn't help    me or</P>
<P>anybody else very much: it will depend on your particular    kernel setup.  What</P>
<P>you should do is take the hex value from the EIP    line (ignore the "0010:"),</P>
<P>and look it up in the kernel namelist to    see which kernel function contains</P>
<P>the offending address.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>    To find out the kernel function name, you'll need to find the system    </P>
<P>binary associated with the kernel that exhibited the symptom.  This</P>
<P>is    the file 'linux/vmlinux'.  To extract the namelist and match it against   </P>
<P>the EIP from the kernel crash, do:</P>
<P>&nbsp;</P>
<P> </P>
<P>     nm vmlinux | sort | less</P>
<P>&nbsp;</P>
<P>   This will give you a list of kernel addresses sorted in ascending   </P>
<P>order, from which it is simple to find the function that contains the    </P>
<P>offending address.  Note that the address given by the kernel    debugging </P>
<P>messages will not necessarily match exactly with the    function addresses (in </P>
<P>fact,that is very unlikely), so you can't    just 'grep' the list: the list </P>
<P>will, however, give you the starting    point of each kernel function, so by </P>
<P>looking for the function that    has a starting address lower than the one you </P>
<P>are searching for but    is followed by a function with a higher address you </P>
<P>will find the one    you want.  In fact, it may be a good idea to include a bit </P>
<P>of    "context" in your problem report, giving a few lines around the    </P>
<P>interesting one. </P>
<P>&nbsp;</P>
<P>    If you for some reason cannot do the above (you have a pre-compiled   </P>
<P>kernel image or similar), telling me as much about your setup as    possible</P>
<P>will help.  </P>
<P>&nbsp;</P>
<P>  - Alternately, you can use gdb on a running kernel. (read-only; i.e.</P>
<P>you    cannot change values or set break points.) To do this, first compile</P>
<P>the    kernel with -g; edit arch/i386/Makefile appropriately, then do a "make</P>
<P>clean". </P>
<P>&nbsp;</P>
<P>You'll also need to enable CONFIG_PROC_FS (via "make config").</P>
<P>&nbsp;</P>
<P>   After you've rebooted with the new kernel, do "gdb vmlinux /proc/kcore".    </P>
<P>You can now use all the usual gdb commands. The command to look up</P>
<P>the    point where your system crashed is "l *0xXXXXXXXX". (Replace the XXXes    </P>
<P>with the EIP value.)</P>
<P>&nbsp;</P>
<P>    gdb'ing a non-running kernel currently fails because gdb (wrongly)    </P>
<P>disregards the starting offset for which the kernel is compiled.</P>
<P>&nbsp;</P>
<P>Copyright 1996,1997,1998</P>
<P>mailto:Pavel.Janik@linux.cz - Pavel Jan&iacute;k ml.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>9.7 - DICAS SOBRE O KERNEL</P>
</B></FONT><P>&nbsp;</P>
<P>Uma coisa &uacute;til, como j&aacute; deu para perceber nos guias acima &eacute; que &eacute; altamente </P>
<P>recomend&aacute;vel recompilar o kernel do Linux ap&oacute;s a instala&ccedil;&atilde;o para melhor  </P>
<P>performance do sistema. Claro tamb&eacute;m que essa tarefa s&oacute; deve ser feita </P>
<P>quando voc&ecirc; j&aacute; tiver uma certa seguran&ccedil;a e souber pelo menos reinstalar com</P>
<P>seguran&ccedil;a o Linux.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>10 -     CONEX&Atilde;O &Agrave; INTERNET</P>
</B></FONT><P>&nbsp;</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>10.1 - CONEX&Atilde;O VIA SCRIPT NO RED HAT</P>
</B></FONT><P>&nbsp;</P>
<P>Talvez tamb&eacute;m funcione no Slackware e outros (ainda n&atilde;o testei).</P>
<P>&nbsp;</P>
<P>Verifique o arquivo '/etc/hosts' que contem o n&uacute;mero ip e nome de dom&iacute;nio: </P>
<P>&nbsp;</P>
<P>127.0.0.1  localhost</P>
<P>&nbsp;</P>
<P>0.0.0.0    username.nomedoprovedor.com.br</P>
<P>&nbsp;</P>
<P># o numero ip e' esse mesmo (se for din&acirc;mico); </P>
<P>&nbsp;</P>
<P>Verifique o arquivo '/etc/resolv.conf': </P>
<P>&nbsp;</P>
<P>  domain  nomedoprovedor.com.br</P>
<P>&nbsp;</P>
<P>  search  nomedoprovedor</P>
<P>&nbsp;</P>
<P>nameserver D.N.S. prim&aacute;rio do provedor</P>
<P>&nbsp;</P>
<P># se houver dns secund&aacute;rio, coloque outra linha 'nameserver' com o segundo; </P>
<P>&nbsp;</P>
<P>Depois, crie o arquivo '/etc/ppp/options': </P>
<P>  connect "/usr/sbin/chat -f /etc/ppp/chat-script"</P>
<P>  /dev/modem 38400</P>
<P>  modem</P>
<P>  crtscts</P>
<P>  defaultroute</P>
<P>  noipdefault</P>
<P>  name username    #Aqui em username, colocar o seu user name</P>
<P> </P>
<P>Crie o arquivo '/etc/ppp/chat-script': </P>
<P>&nbsp;</P>
<P>      ABORT    BUSY </P>
<P>      ""       ATDT1234567 </P>
<P>      CONNECT  "" </P>
<P>&nbsp;</P>
<P>Voc&ecirc; deve saber que ATDT e' tone e ATDP e' pulse, 1234567 e' o numero do telefone do seu provedor; </P>
<P>&nbsp;</P>
<P>Para finalizar, coloque no arquivo '/etc/ppp/chap-secret' e no 'pap-secret' apenas uma linha:   </P>
<P>username * senha# Assim como est&aacute;, s&oacute; que com o teu user e a tua senha, &eacute; claro. # Se voc&ecirc; n&atilde;o souber qual dos protocolos (pap ou chap) s&atilde;o usados pelo seu # provedor, fa&ccedil;a os dois arquivos exatamente  iguais. E´ bom proteger # esses arquivos, digitando no xterm: ´chmod 600 /etc/ppp/chap-secret´ e  ´chmod 600 /etc/ppp/pap-secret´. </P>
<P>Agora, para conectar, basta digitar no xterm 'pppd' e pronto. </P>
<P>Ah, para desconectar (se um dia voc&ecirc; for fazer isso :)) &eacute; s&oacute; digitar: </P>
<P>'pppd  -detach'. </P>
<P>&nbsp;</P>
<P>Peguei esses scripts da p&aacute;gina de uma colega de lista. Infelizmente n&atilde;o anotei o nome, mas s&oacute; pelo fato de ser "uma" colega j&aacute; d&aacute; quase para acertar (s&oacute; vi tr&ecirc;s nas duas listas e duas apenas perguntavam, apenas esta apresentou  uma resposta). </P>
<P>N&atilde;o quero com isso dizer que as mulheres n&atilde;o t&ecirc;m capacidade de mexer com  computadores, mas apenas que est&atilde;o de fora. </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>10.2 - CONEX&Atilde;O VIA PPPSETUP NO SLACKWARE</P>
</B></FONT><P>&nbsp;</P>
<P>1 - Executar: pppsetup e Enter;</P>
<P>2 - Tecle Enter nessa tela;</P>
<P>3 - Entre com o n&uacute;mero do telefone do seu provedor antecedido de atdp ou atdt (ex.: atdt2770303) e Enter;</P>
<P>4 - Selecione a porta onde est&aacute; o seu modem (cua1 = COM2) e Enter;</P>
<P>5 - Selecione a velocidade m&aacute;xima do seu modem e Enter;</P>
<P>6 - CallBack - Escolha No e Enter (isso pra muitos casos);</P>
<P>7 - Modem Init String. Aqui voc&ecirc; pode adicionar algo para, por exemplo    liga&ccedil;&atilde;o com fone de ramal. Para aceitar o default, tecle Enter;</P>
<P>8 - Entre com o nome do dom&iacute;nio do seu provedor (ex.: fortalnet.com.br);</P>
<P>9 - Entre com o DNS do provedor (ex.: 200.253.251.32) e Enter;</P>
<P>10- Escolha o protocolo: PAP, CHAP ou outro. Isso depende do provedor.</P>
<P>Comigo funciona com PAP (&agrave;s vezes CHAP). Enter;</P>
<P>11- Entre com o seu username e Enter;</P>
<P>12- Entre com a sua senha de acesso e Enter;</P>
<P>13- Enter e pronto.</P>
<P>&nbsp;</P>
<P>Para conectar: ppp-go</P>
<P>&nbsp;</P>
<P>Para desconectar: ppp-off </P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><P>10.3 - CONEX&Atilde;O VIA CONTROL-PANEL NO FVWM2 OU 95 (RED HAT)</P>
</B><P>&nbsp;</P>
<P>- A primeira coisa a ser feita &eacute; verificar como est&aacute; o link para o modem:</P>
<P>&nbsp;</P>
<P>ls -la /dev/modem. </P>
<P>&nbsp;</P>
<P>Veja se aponta para a sua porta: cua0 &eacute; COM1, cua1 &eacute; COM2 e assim por diante. </P>
<P>Caso n&atilde;o aponte para a sua porta, remova-o:</P>
<P>&nbsp;</P>
<P>rm /dev/modem e crie um que realmente aponte para a sua porta:</P>
<P>&nbsp;</P>
<P>ln -s /dev/ttyS1 /dev/modem (exemplo para modem na COM2). O kernel mais novo traz </P>
<P>informa&ccedil;&otilde;es de que n&atilde;o mais se deve usar os dispositivos cua e sim os ttySx, pois os primeiros est&atilde;o ultrapassados.</P>
<P>&nbsp;</P>
<P>Ali&aacute;s, tente primeiro os passos seguintes e se n&atilde;o der certo, venha e crie o link, pois fiz isso algumas vezes sem criar o link (parece que esse link &eacute; criado com uma pr&eacute;-configura&ccedil;&atilde;o, talvez para COM2 e IRQ3).</P>
<P>&nbsp;</P>
<P>- Se o painel de controle n&atilde;o aparece no seu desktop, abra um xterm e digite control-panel e enter (acho que &eacute; apenas no Red Hat se voc&ecirc; instalou o fvwm2/95);</P>
<P>&nbsp;</P>
<P>- Clique em Modem configuration e configure a porta para o seu modem;</P>
<P>&nbsp;</P>
<P>- Clique em Network Configuration - Interfaces - Add - PPP - OK;</P>
<P>&nbsp;</P>
<P>- Coloque o Phone Number do seu provedor - Marque Use PPP authentication (aqui deu legal) - digite seu login name - sua password e clique em</P>
<P>&nbsp;</P>
<P>- Customize - Marque Allow any user to ... (permite que outros usu&aacute;rios conectem tamb&eacute;m) - Done </P>
<P>- Save</P>
<P>&nbsp;</P>
<P>- Agora basta clicar em Activate para ativar a conex&atilde;o e deactivate para desconectar. Existe um Utilit&aacute;rio muito bom para isso, aqui e:</P>
<P>Programas - Network - Usernet - Clicar em ppp0 para conectar, quando o quadrado ficar verde conectou. Se permanecer amarelo deu problema. Clique  novamente para nova tentativa ou aguarde que ele ligar&aacute;. Quando conectado, basta  clicar novamente em ppp0 para desconectar.</P>
<P>&nbsp;</P>
<P>Obs.: Caso d&ecirc; problema e o bot&atilde;o do Usernet n&atilde;o fique verde, edite o arquivo  </P>
<P>/etc/ppp/options e comente todas as linhas.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>10.4 - CONEX&Atilde;O VIA KPPP DO KDE</P>
</B></FONT><P> </P>
<P>O kppp &eacute; o utilit&aacute;rio do KDE para acesso &agrave; INTERNET. </P>
<P>&nbsp;</P>
<P>1) Devemos acess&aacute;-lo clicando em K - Internet - Kppp;</P>
<P>2) Aqui apareceu a mensagem de erro:</P>
<P>&nbsp;</P>
<P>kppp detectou a op&ccedil;&atilde;o "lock" em /etc/ppp/option.</P>
<P>Esta op&ccedil;&atilde;o tem que ser removida uma vez que kppp toma conta do locking de dispositivos. Clico no OK.</P>
<P>&nbsp;</P>
<P>Para eliminar essa mensagem: vi /etc/ppp/options e comente a linha com lock e salve.</P>
<P>&nbsp;</P>
<P>3) Ent&atilde;o aparece a janela do Kppp:</P>
<P>Clicar em Configura&ccedil;&atilde;o. Aparece ent&atilde;o outra janela com:</P>
<P>&nbsp;</P>
<P>Contas, Dispositivo, Modem, PPP e Sobre.</P>
<P>Em Contas - configura&ccedil;&atilde;o da Conta clique em Nova:</P>
<P>&nbsp;</P>
<P>Aparece a janela de Nova Conta com:</P>
<P>Ligar, IP, DNS, Gatway, Script de Login e Contabilidade</P>
<P>&nbsp;</P>
<P>Em Ligar - Configura&ccedil;&atilde;o da Liga&ccedil;&atilde;o:</P>
<P>Nome da Conex&atilde;o: Fortalnet (coloquei o nome do provedor)</P>
<P>N&uacute;mero do Telefone: 2770303 (fone de acesso ao provedor)</P>
<P>Autentica&ccedil;&atilde;o: Baseado em Terminal (no meu caso) e PAP funcionaram</P>
<P>Guardar Password (se for usar Terminal desative essa op&ccedil;&atilde;o)</P>
<P>Executar prog. quando obter liga&ccedil;&atilde;o: deixei em branco (por hora)</P>
<P>Executar programa quando terminar liga&ccedil;&atilde;o: (em branco)</P>
<P>Editar argumento do pppd (n&atilde;o alterei);</P>
<P>&nbsp;</P>
<P>Em IP:</P>
<P>N&atilde;o alterei nada aqui;</P>
<P>&nbsp;</P>
<P>Em DNS:</P>
<P>Nome do Dom&iacute;nio: fortalnet.com.br (nome do dom&iacute;nio do seu provedor)</P>
<P>Endere&ccedil;o IP do DNS: 200.253.251.32 (coloque o seu) e clique em Adicionar.</P>
<P>Desativar servidores DNS existentes durante a Conex&atilde;o (n&atilde;o alterei);</P>
<P>&nbsp;</P>
<P>Em Gatway:</P>
<P>Tamb&eacute;m n&atilde;o alterei nada;</P>
<P>&nbsp;</P>
<P>Em Script de Login:</P>
<P>Deve ser aqui que se coloca um script caso  o tipo de Autentica&ccedil;&atilde;o tenha</P>
<P>sido a baseada em Script.</P>
<P>&nbsp;</P>
<P>Em Contabilidade:</P>
<P>Caso queira usar clicar em Ativar Contabilidade e</P>
<P>Clicar em Brasil e no Brasil abaixo.</P>
<P>&nbsp;</P>
<P>Em Contabilidade de Volume clicar em Sem contabilidade e escolher (uma</P>
<P>boa escolha e bytes recebidos e enviados e clicar em OK.</P>
<P>N&atilde;o vi muita gra&ccedil;a nesta op&ccedil;&atilde;o.</P>
<P>&nbsp;</P>
<P>Clicar em Dispositivo:</P>
<P>Dispositivo Modem: aqui eu cliquei em /dev/modem e alterei para /dev/cua1 </P>
<P>(pois o meu modem est&aacute; em COM2). Caso voc&ecirc; tenha um link simb&oacute;lico</P>
<P>de modem para cua1 pode deixar /dev/modem</P>
<P>Controle de Fluxo: deixei em CRTSCTS (pois o meu modem USR faz o controle</P>
<P>via hard). </P>
<P>Terminador de Linha: deixei em CR/LF</P>
<P>Velocidade de Liga&ccedil;&atilde;o: mudei para 115.200 (depende do modem).</P>
<P>Arquivo de Travamento do Modem: n&atilde;o alterei</P>
<P>Timeout do Modem: deixei em 0 segundos.</P>
<P>&nbsp;</P>
<P>Clicar em Modem:</P>
<P>Quando ocupado esperar: deixei os 0 segundos</P>
<P>Modem reconhece linha CD (deixei desativado)</P>
<P>Comandos do Modem (aqui voc&ecirc; pode alterar caso queira uma configura&ccedil;&atilde;o</P>
<P>diferente (deixei como estava).</P>
<P>&nbsp;</P>
<P>Perguntar ao Modem (aqui testamos o modem). Clique e veja se esta tudo</P>
<P>ok.</P>
<P>&nbsp;</P>
<P>Terminal: aqui &eacute; para acessar um pequeno terminal. As vezes n&atilde;o funciona</P>
<P>antes de configurar.</P>
<P>&nbsp;</P>
<P>Clicar acima em PPP:</P>
<P>Timeout do pppd: 30 Segundos (deixei como estava)</P>
<P>S&oacute; deixei ativos os itens seguintes: Mostrar Rel&oacute;gio no T&iacute;tulo e</P>
<P>Desconectar se o servidor X for encerrado. Clicar em OK.</P>
<P>&nbsp;</P>
<P>Pronto est&aacute; configurado. &Eacute; s&oacute; clicar em Ligar e quando for aberto o</P>
<P>Terminal digite seu Login e sua senha e se demorar a aparecer aquele lixo de</P>
<P>caracteres tecle Enter e clique em continuar para finalizar a conex&atilde;o.</P>
<P>&nbsp;</P>
<P>Agora, depois de conectado &eacute; s&oacute; utilizar o Kmail para enviar/receber</P>
<P>e-mails ou o Netscape ou outro qualquer browser.</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>10.5 - CONEX&Atilde;O VIA XISP</P>
</B></FONT><P>&nbsp;</P>
<P> </P>
<P>Baixe o xisp (quem usa Red Hat deve baixar, de prefer&ecirc;ncia em rpm, para facilitar a vida) ou da p&aacute;gina do Felipe Russo. Basta descompactar e executar &quot;make install&quot;.</P>
<P>&nbsp;</P>
<P>Se na instala&ccedil;&atilde;o ele pedir algumas libs, baixe a "xforms" e instale.</P>
<P>&nbsp;</P>
<P>Configura&ccedil;&atilde;o:</P>
<P>&nbsp;</P>
<P>Clique em Options</P>
<P>&nbsp;</P>
<P>Vou me referir aqui apenas &agrave;s op&ccedil;&otilde;es que tive que alterar para conectar.</P>
<P>&nbsp;</P>
<P>Account Information:</P>
<P>        Add – Fortalnet (nome para o provedor)</P>
<P>        Authentication protocol</P>
<P>                PAP             None</P>
<P>                PAP-Secret      CHAP-Secret</P>
<P>        A escolha depende do seu provedor (o mais seguro &eacute; o CHAP, caso n&atilde;o consiga</P>
<P>        experimente o PAP ou None (caso tenha que usar este, exiba o Terminal em Dialog </P>
<P>        and Login).</P>
<P>&nbsp;</P>
<P>        Phone no: 277 0303 (n&uacute;mero do telefone do seu provedor)</P>
<P>        Account name: ribafs (seu login)</P>
<P>        Password: sua senha</P>
<P>&nbsp;</P>
<P>Dialog and Login.</P>
<P>&#9;Marque para exibir o Teminal, caso tenha escolhido None no item anterior.</P>
<P>&nbsp;</P>
<P>Communication Options</P>
<P>        Device /dev/ttyS1 (para modem em COM2).</P>
<P>        Dialing method (Selecione o seu: pulso ou tone)</P>
<P>        Flow control (depende da placa de FAX/MODEM). Deixe como est&aacute;. Caso </P>
<P>        n&atilde;o funcione mude para Software.</P>
<P> </P>
<P>TCP/IP Options</P>
<P>        DNS Support</P>
<P>&#9;Yes&#9;Primaty – 200.253.251.32 (coloque o do seu provedor).</P>
<P>&nbsp;</P>
<P>Ap&oacute;s conectar aparece o tempo de conex&atilde;o na barra de t&iacute;tulo.</P>
<P>Teste com o Netscape ou outro programa para ver se est&aacute; configurado corretamente. Caso n&atilde;o esteja saia alterando uma op&ccedil;&atilde;o suspeita de cada vez e testando at&eacute; conseguir.</P>
<P>&nbsp;</P>
<P>Agora uma dica para permitir us&aacute;-lo como user comum. Como root:</P>
<P>&nbsp;</P>
<P>- chmod go+x /usr/lib/ppp/xisp*.</P>
<P>&nbsp;</P>
<P>- chmod go+x /usr/X11R6/bin/xisp.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>10.6 - DICAS EXTRAS SOBRE CONEX&Atilde;O &Agrave; INTERNET</P>
</B></FONT><P>&nbsp;</P>
<P> </P>
<B><FONT SIZE=4><P>10.6.1 - CONECTANDO &Agrave; INTERNET COM FONE DE RAMAL </P>
</B></FONT><P>Configure a discagem para:</P>
<P>&nbsp;</P>
<P>atdx0,,..2770303</P>
<P>&nbsp;</P>
<P>x pode ser p(ulso) ou t(om), zero pra chamar a linha, uma v&iacute;rgula para cada 3 segundos de retardo - pra dar tempo da linha ser recebida.</P>
<P>&nbsp;</P>
<P>O normal &eacute; precisar de uma &uacute;nica virgula.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Essa foi do "Irado, furioso com tudo" para a lista Linuxabc.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>10.6.2 - VOLUME DO ALTO FALANTE DURANTE A CONEX&Atilde;O</P>
</B></FONT><P>&nbsp;</P>
<P>Deve alterar a string de inicializa&ccedil;&atilde;o do modem para ATL0 (desligado)</P>
<P>ou ATL1 (baixo), ou M0 ou ATM0.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>11 -    USO DE PROGRAMAS PARA A INTERNET</P>
</B></FONT><P>&nbsp;</P>
<P> </P>
<B><FONT SIZE=4><P>11.1 - BROWSER NETSCAPE COMMUNICATOR</P>
</B></FONT><P>&nbsp;</P>
<P>Normalmente o Netscape Communicator j&aacute; vem com as principais distribui&ccedil;&otilde;es (no CD), por isso n&atilde;o abordaremos muitos detalhes sobre instala&ccedil;&atilde;o nem sobre configura&ccedil;&atilde;o (n&atilde;o h&aacute; o que configurar).&Eacute; realmente um browser consagrado por seus recursos e facilidade de uso. <B><FONT SIZE=4>11.1.1 - IMPORTAR ARQUIVOS (BOOKMARK E ADDRESS) DO OUTLOOK PARA O NETSCAPE</B></FONT>Instale o Netscape Communicator para WINDOWS (de prefer&ecirc;ncia da mesma vers&atilde;o que usa no Linux) e importe, atrav&eacute;s do Messenger dele, as mensagens  contidas no Outlook Express. Ache a pasta em que o Netscape guarda os e-mails (procure por arquivos com extens&atilde;o snm) e copie-os para o diret&oacute;rio onde o Netscape Communicator para Linux guarda as mensagens (os formatos dos arquivos s&atilde;o iguais).</P>
<P>&nbsp;</P>
<P> </P>
<B><FONT SIZE=4><P>10.1.2 - PREFER&Ecirc;NCIAS DO NETSCAPE</P>
</B></FONT><P>&nbsp;</P>
<P>- Edit - Preferences</P>
<P>- Navigator - Blanck page (para evitar que sempre ele tente se conectar ao ser aberto);</P>
<P>- Clicar na seta a esquerda de Navigator - Language - Portuguese/Brasil [pt-BR] e OK;</P>
<P>- Mail &amp; Groups - clicar na seta a esquerda e Identify - preencher:</P>
<P>Your Name (seu nome completo se desejar - opcional)</P>
<P>EmailAddress (seu e-mail - obrigat&oacute;rio)</P>
<P>Reply (somente se o endere&ccedil;o para enviar for diferente do de receber)</P>
<P>Organization (seu trabalho - opcional)Signature File (esse &eacute; muito &uacute;til quando voc&ecirc; sempre envia uma mensagem de despedida, um pensamento, o endere&ccedil;o de sua p&aacute;gina, etc – opcional e sempre ser&aacute; adicionado em qualquer mail enviado ou respondendo)- Always attach Address Book Card to message (enviar um cart&atilde;o de visita  sofisticado e que deve ser evitado para listas de discuss&atilde;o). Sendo clicado, este bot&atilde;o abre uma op&ccedil;&atilde;o para criar o cart&atilde;o)</P>
<P>- Messages:</P>
<P>By Default, sent rich text (HTML) messages (desmarque se envia mensagens para listas de discuss&atilde;o, tem gente que n&atilde;o consegue ler essas mensagens - seus clientes de e-mail n&atilde;o permitem)</P>
<P>&nbsp;</P>
<P>More Options:</P>
<P>&nbsp;</P>
<P>When sending HTML messages to recipientes ...</P>
<P>Marque Always convert the message into Plain Text (prefer&iacute;vel para listas de discuss&atilde;o) e OK</P>
<P>&nbsp;</P>
<P>Mail Server:</P>
<P>Mail server user name: (seu user name)</P>
<P>Outgoing mail (SMTP) server: (DNS do seu provedor)</P>
<P>Incoming mail server: (repita o DNS do seu provedor)</P>
<P>More Options:</P>
<P>Local mail directory: (para este eu tenho uma sugest&atilde;o que tem me evitado muito perder e-mails recebidos/enviados.  Crie antes um diret&oacute;rio numa parti&ccedil;&atilde;o n&atilde;o linux, uma que se voc&ecirc; reinstalar o linux e tiver que apagar tudo, como tive que fazer v&aacute;rias vezes, ent&atilde;o voc&ecirc; n&atilde;o perder&aacute; seus e-mails. Ent&atilde;o clique em Choose e indique esse diret&oacute;rio criado ou digite-o na caixa) Marcar Check for mail every e alterar o per&iacute;odo (caso deseje ser lembrado pelo Message se chegar novos e-mails)</P>
<P>&nbsp;</P>
<P>Marque Remember my mail password (isso quando for somente voc&ecirc; que usa e n&atilde;o tem segredos, deve ser &uacute;til - evita que sempre que for abrir o Message, ele te pe&ccedil;a a senha) e OK</P>
<P>&nbsp;</P>
<P>Groups Server (configure esse apenas se seu provedor tiver servidor de news)</P>
<P>&nbsp;</P>
<P>Outro item interessante (voc&ecirc; deve antes saber com seu provedor se ele tem servidor de proxy) e:</P>
<P>&nbsp;</P>
<P>Advanced - Proxies :</P>
<P>Clique em Manual proxy configuration e View... e preencha de acordo com as informa&ccedil;&otilde;es fornecidas pelo provedor. Ir&aacute; tornar mais r&aacute;pido o acesso a muitas p&aacute;ginas.</P>
<P>&nbsp;</P>
<P>As op&ccedil;&otilde;es as quais n&atilde;o me referi &eacute; que eu normalmente nunca altero.</P>
<P>Tamb&eacute;m n&atilde;o quer dizer que se voc&ecirc; souber n&atilde;o deva alterar.</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>11.2 - FTP</P>
</B></FONT><P>&nbsp;</P>
<P>Este &eacute; um programa de FTP para a linha de comando. Muito pr&aacute;tico e r&aacute;pido.</P>
<P>Tem suas limita&ccedil;&otilde;es por ser em modo texto.</P>
<P>&nbsp;</P>
<P>- Rodar com: ftp ftp.netscape.com (exemplo) ou</P>
<P>- ftp e Enter</P>
<P>- open ftp.netscape.com</P>
<P>- cd /pub/communicator/4.xx/</P>
<P>Obs.: digitar bin antes de baixar</P>
<P>- ls netscape*</P>
<P>- get nome.do.arquivo</P>
<P>- Sair com quit</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>11.3 - WXFTP</P>
</B></FONT><P>&nbsp;</P>
<P>Uma &oacute;tima ferramenta gr&aacute;fica para FTP, muito simples de usar.</P>
<P>Ao ser clicado no Window Manager abre uma janela para se adicionar ou escolher um profile. Aqui eu criei um profile para upload para o Geocities, veja os passos:</P>
<P>&nbsp;</P>
<P>Profile Name: Geocities</P>
<P>Host Name/Address: ftp.oocities.com</P>
<P>User ID: ribafs (este &eacute; meu ID no geocities), voc&ecirc; pode (se for ocaso)  tamb&eacute;m usar a op&ccedil;&atilde;o Anonymous Password (aqui voc&ecirc; coloca sua senha se desejar) e Save password (marcar para guardar a sua senha)</P>
<P>Clique abaixo em save para guardar esses dados e clique em OK para conectar.</P>
<P>Querendo criar outro, basta clicar em New e seguir os passos.</P>
<P>&nbsp;</P>
<P>Veja que na outra tela tem ASCII, Binary e Auto. Quando estamos enviando ou recebendo arquivos de v&aacute;rios tipos &eacute; interessante que a op&ccedil;&atilde;o auto seja marcada.</P>
<P>&nbsp;</P>
<P>Marcar os arquivos a esquerda (pode-se usar Ctrl e Shift para selecionar v&aacute;rios) e clicar na seta para a direita para enviar os arquivos.</P>
<P>&nbsp;</P>
<P>Marcar os arquivos a direita e clicar na seta para a esquerda para fazer o download.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>10.4 - WGET</P>
</B></FONT><P>&nbsp;</P>
<P>Ferramenta tipo o GetHight, mas em modo texto. Para fazer downloads de arquivos grandes ou pequenos. Ele junta os peda&ccedil;os de downloads  interrompidos.</P>
<P>&nbsp;</P>
<P>Executar: wget /url/completa/do/arquivo</P>
<P>&nbsp;</P>
<P>Continuar o download interrompido: wget -c /url/completo/do/arquivo</P>
<P>&nbsp;</P>
<P>Fazendo mirror (baixando todos os arquivos de uma pagina):</P>
<P>&nbsp;</P>
<P>Wget –mc http://www.pagina.para.baixar.com</P>
<P>&nbsp;</P>
<P>Obs.: o arquivo ser&aacute; baixado no diret&oacute;rio de onde for executado o wget.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12 -     DICAS GERAIS</P>
</B></FONT><P>&nbsp;</P>
<P> </P>
<B><P>12.1  DESCOMPACTA&Ccedil;&Atilde;O/COMPACTA&Ccedil;&Atilde;O DE ARQUIVOS NO LINUX</P>
</B><P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.1.1 - ARQUIVOS .TAR.GZ, .TGZ E .TAR.Z:        </P>
</B></FONT><P>&nbsp;</P>
<P>tar zxpvf nome.do.zrquivo.tar.gz ou .tgz ou .tar.z</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.1.2 - ARQUIVOS .TAR:  </P>
</B></FONT><P>&nbsp;</P>
<P>&#9;tar xvf nome.do.arquivo.tar</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.1.3 - ARQUIVOS .GZ:</P>
</B></FONT><P>&nbsp;</P>
<P>        gzip -d nome.do.arquivo.gz ou</P>
<P>&nbsp;</P>
<P>        gunzip nome.do.arquivo.gz</P>
<P>&nbsp;</P>
<P> </P>
<B><FONT SIZE=4><P>12.1.4 - ARQUIVOS BZ2:</P>
</B></FONT><P>&nbsp;</P>
<P>        bunzip2 -d nome.do.arquivo.bz2</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.1.5 - LISTAR CONTE&Uacute;DO:</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;tar -tzvf  arquivo.tar.gz ou outro</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.1.6 - COMPACTA&Ccedil;&Atilde;O DE ARQUIVOS TAR.GZ</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;tar cvzf nomequalquer.tar.gz /arq/e/ou/dir/a/serem/empacotados</P>
<P>&nbsp;</P>
<P> </P>
<B><FONT SIZE=4><P>12.1.7  COMPACTA&Ccedil;&Atilde;O DE ARQUIVOS .ZIP</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;zip -r nomequalquer.zip /arq/e/ou/dir/a/serem/empacotado</P>
<P>&#9;</P>
<B><FONT SIZE=4><P>12.1.8 DESCOMPACTAR ARQUIVOS .ZIP</P>
</B></FONT><P>&nbsp;</P>
<P>&#9;unzip –d /dir/para/onde nomequalquer.zip </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>12.2 - GERENCIAMENTO DE PACOTES NO RED HAT (RPMs)</P>
</B></FONT><P>&nbsp;</P>
<P>&nbsp;</P>
<P>O RPM &eacute; um dos utilit&aacute;rios mais pr&aacute;ticos que apareceram no Linux. Originado na distribui&ccedil;&atilde;o do Linux da Red Hat, ele tem como finalidade facilitar a instala&ccedil;&atilde;o e a remo&ccedil;&atilde;o de programas no sistema Linux, facilitando tamb&eacute;m a atualiza&ccedil;&atilde;o desses programas. </P>
<P>&nbsp;</P>
<P>Com o RPM os arquivos que comp&otilde;em um determinado software s&atilde;o agrupados em um &uacute;nico pacote, contendo tamb&eacute;m todas as informa&ccedil;&otilde;es dos arquivos, como  permiss&otilde;es, diret&oacute;rios a que pertencem, al&eacute;m de fornecer uma breve descri&ccedil;&atilde;o do software em quest&atilde;o. </P>
<P>&nbsp;</P>
<P>Veja o que voc&ecirc; pode fazer com o RPM. </P>
<P>&nbsp;</P>
<P>Apresenta as informa&ccedil;&otilde;es do pacote.</P>
<P>rpm -i</P>
<P>&nbsp;</P>
<P>Para instalar um pacote use o comando: </P>
<P>rpm -i nome-versao.rpm </P>
<P>&nbsp;</P>
<P>Ex.: rpm -i koules-1.2-2.i386.rpm</P>
<P>&nbsp;</P>
<P>Obs.: pode ser tamb&eacute;m -ivh.</P>
<P>&nbsp;</P>
<P>Para remov&ecirc;-lo use: </P>
<P>rpm -e nome </P>
<P>&nbsp;</P>
<P>Ex.: rpm -e koules </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>E para atualiz&aacute;-lo para uma vers&atilde;o superior use: </P>
<P>rpm -Uvh nome-versao.rpm </P>
<P>&nbsp;</P>
<P>Ex.: rpm -Uvh koules-2.0-1.i386.rpm </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Para ver as informa&ccedil;&otilde;es sobre um pacote use o comando: </P>
<P>rpm -qpi nome-versao.rpm </P>
<P>&nbsp;</P>
<P>Ex.: rpm -qpi koules-1.2-2.i386.rpm </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Para ver as informa&ccedil;&otilde;es sobre um pacote j&aacute; instalado use o comando: </P>
<P>rpm -qi nome </P>
<P>&nbsp;</P>
<P>Ex.: rpm -qi koules </P>
<P>Instala&ccedil;&atilde;o com conflitos</P>
<P>rpm --replacepkgs</P>
<P>&nbsp;</P>
<P>Para ver a lista de arquivos que o pacote instala: </P>
<P>rpm -qpl nome-versao.rpm </P>
<P>&nbsp;</P>
<P>Ex.: rpm -qpl koules-1.2-2.i386.rpm </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Para ver a lista de arquivos instalados por um pacote: </P>
<P>rpm -ql nome </P>
<P>&nbsp;</P>
<P>Ex.: rpm -ql koules </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Para checar a integridade do pacote: </P>
<P>rpm -K --nopgp nome-versao.rpm </P>
<P>&nbsp;</P>
<P>Ex.: rpm -K --nopgp koules-1.2-2.i386.rpm </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Para saber quais s&atilde;o os pr&eacute;-requisitos para a instala&ccedil;&atilde;o de um pacote,</P>
<P>use: </P>
<P>rpm -qR nome-versao.rpm </P>
<P>&nbsp;</P>
<P>Ex.: rpm -qR koules-1.2-2.i386.rpm </P>
<P>&nbsp;</P>
<P> </P>
<P>Agora se voc&ecirc; encontrou um arquivo instalado em seu sistema e quer saber em qual pacote ele pertence digite: </P>
<P>rpm -qf nome.do.arquivo </P>
<P>&nbsp;</P>
<P>Ex.: rpm -qf /usr/bin/koules </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>E para descobrir todos os arquivos relacionados a um arquivo espec&iacute;fico, sem saber o pacote, use: </P>
<P>rpm -qdf nome.do.arquivo </P>
<P>&nbsp;</P>
<P>Ex.: rpm -qdf /usr/bin/koules </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Para listar todos os pacotes instalados em seu sistema: </P>
<P>rpm -qa | less</P>
<P>&nbsp;</P>
<P> Se voc&ecirc; deletou arquivos por acidente e n&atilde;o sabe o que deletou. Pode usar o comando abaixo para checar em todo o sistema os arquivos que est&atilde;o faltando: </P>
<P>rpm -Va </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Mesmas op&ccedil;&otilde;es no processo de pesquisas.</P>
<P>rpm -V</P>
<P>&nbsp;</P>
<P>Para verificar os pacotes instalados</P>
<P>rpm -Vf</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Um comando que uso muito &eacute; quando quero saber se um determinado arquivo que preciso est&aacute; em algum pacote que possuo. Ent&atilde;o digito o seguinte: </P>
<P>rpm -qpl *.rpm | grep arq.ext </P>
<P>&nbsp;</P>
<P>rpm -qpil *.rpm | grep -B 40 arq.ext | less </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Segue ent&atilde;o alguns exemplos interessantes: </P>
<P>rpm -qa | grep xephem </P>
<P>&nbsp;</P>
<P>rpm -ivh *.rpm </P>
<P>&nbsp;</P>
<P>rpm -qpi arq.rpm &gt; arq.txt </P>
<P>&nbsp;</P>
<P>rpm -K --nopgp *rpm </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Apresenta o status dos arquivos do pacote</P>
<P>rpm -s</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Apresenta uma lista dos arquivos de documenta&ccedil;&atilde;o.</P>
<P>rpm -d</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Apresenta uma lista dos arquivos de configura&ccedil;&atilde;o.</P>
<P>rpm -c</P>
<P>&nbsp;</P>
<P> </P>
<P>Consulta o pacote que cont&eacute;m o arquivo (file)</P>
<P>rpm -f</P>
<P>&nbsp;</P>
<P>Funciona como o par&acirc;metro -f exceto que funciona a partir do stdin.</P>
<P>rpm -F</P>
<P>&nbsp;</P>
<P> </P>
<P>(arquivo do pacote) consulta o pacote originado pelo (arquivo do pacote)</P>
<P>rpm -p</P>
<P>&nbsp;</P>
<P> </P>
<P>Funciona como o -p exceto com stdin</P>
<P>rpm -P</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Apresenta a lista de arquivos relacionados com o pacote</P>
<P>rpm -l</P>
<P>&nbsp;</P>
<P> </P>
<P>Consulte a p&aacute;gina manual do RPM (man rpm) para saber o que mais voc&ecirc;</P>
<P>pode fazer com esse comando. </P>
<P>&nbsp;</P>
<P> </P>
<P>(Da p&aacute;gina Red Hat Linux Tips e da Tira-D&uacute;vidas.)</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P> </P>
<B><FONT SIZE=4><P>12.3 - GERENCIAMENTO DE PACOTES NO SLACKWARE</P>
</B></FONT><P>&nbsp;</P>
<P>&nbsp;</P>
<P>No Slackware para gerenciar pacotes use os comandos: </P>
<P>&nbsp;</P>
<P>installpkg, removepkg makepkg, upgradepkg e pkgtool. S&atilde;o muito simples de usar.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Como usar:</P>
<P>&nbsp;</P>
<P>- installpkg nome.do.pacote.tgz</P>
<P>- removepkg nome.do.pacote.pkg</P>
<P>- pkgtool</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.4 - EXECUTANDO ARQUIVOS QUE N&Atilde;O EST&Atilde;O NO PATH</P>
</B></FONT><P>&nbsp;</P>
<P>./nome.do.arquivo</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.5 - ALTERANDO O PATH</P>
</B></FONT><P>&nbsp;</P>
<P>Para alterar o path temporariamente: PATH=$PATH:/caminho/do/arquivo</P>
<P>&nbsp;</P>
<P>Para alterar de maneira permanente deve-se acrescentar ao /etc/profile, </P>
<P>&nbsp;</P>
<P>por exemplo (ficar&aacute; dispon&iacute;vel para todos os usu&aacute;rios).</P>
<P>&nbsp;</P>
<P>Para alterar apenas para um usu&aacute;rio editar o ~/.bash_profile do usu&aacute;rio.</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.6 - USO DO GPM</P>
</B></FONT><P>&nbsp;</P>
<P>Ao instalar o Linux (na maioria das distribui&ccedil;&otilde;es, lembro que na SuSE, na Red Hat e na Slackware &eacute; assim), voc&ecirc; decide se usa ou n&atilde;o o GPM. E deve tamb&eacute;m (no Red Hat) concordar que ele fique sempre carregando no boot para poder usar automaticamente. Ou desabilite no boot e habilite quando precisar.</P>
<P>&nbsp;</P>
<P>O GPM &eacute; um utilit&aacute;rio do mouse que quebra um galh&atilde;o no modo texto (n&atilde;o funciona no X.</P>
<P>&nbsp;</P>
<P>Como funciona: por exemplo, voc&ecirc; lista os arquivos de um diret&oacute;rio e aparecem os nomes do ditos. </P>
<P>Voc&ecirc; gostaria de editar o arquivo </P>
<P>&nbsp;</P>
<P>/este/aqui/so/para/complicar/vou/fazer/arquivo.extensao</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Ent&atilde;o voc&ecirc; digita vi e espa&ccedil;o e d&aacute; um duplo clique no come&ccedil;o do path do arquivo em cima da barra antes de este (com isso ser&aacute; seleciona toda a linha com o nome do arquivo), depois Clique agora com o bot&atilde;o direito do mouse em  qualquer local (ent&atilde;o ser&aacute; colada uma c&oacute;pia da linha completa com o nome do  arquivo &agrave; direita de vi)</P>
<P>&nbsp;</P>
<P>Basta agora teclar Enter para editar o arquivo com o vi.</P>
<P>&nbsp;</P>
<P>Claro que voc&ecirc; pode tamb&eacute;m remover o arquivo, acessar o diret&oacute;rio e fazer o que bem entender com essa praticidade.</P>
<P>&nbsp;</P>
<P>Outro uso que acho demais: editar um arquivo com o vi para copiar parte desse arquivo para outro ou criar um novo. Editar o arquivo com o vi, sem teclar em nada selecionar com o mouse o trecho que deseja copiar e clicar com o bot&atilde;o direito. Ele far&aacute; uma colagem no arquivo mas n&atilde;o se preocupe, saia com Esc, ":q!" e Enter.</P>
<P>&nbsp;</P>
<P>Abra o novo arquivo com o vi, tecle em Insert, posicione o cursor do mouse onde deseja colar e clique com o bot&atilde;o direito do mouse. Saia com Esc, e ":wq" e Enter.</P>
<P>&nbsp;</P>
<P>Outro uso: selecionar mensagens de erro que est&atilde;o na tela para criar um arquivo que ser&aacute; anexado num e-mail para pedir ajuda de uma lista. Selecionar com o mouse o trecho da mensagem que deseja copiar, clicar com o bot&atilde;o direito para copiar. Ignore as mensagens de erro que aparecer&atilde;o. </P>
<P>Ent&atilde;o crie o arquivo com vi mensagens.erro e Enter. Tecle Insert, posicione o cursor do mouse no inicio e clique com o bot&atilde;o direito para colar. Adicione mais alguns coment&aacute;rios que desejar e tecle Esc, ":wq".</P>
<P>&nbsp;</P>
<P>Lembre que quando clica-se com o bot&atilde;o direito o conte&uacute;do fica na mem&oacute;ria dispon&iacute;vel at&eacute; que voc&ecirc; substitua por outro.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.7 - DESATIVAR GPM</P>
</B></FONT><P>&nbsp;</P>
<P>Algumas vezes o GPM pode causar problemas no mouse. Para desativ&aacute;-lo use o "ntsysv" ou comente o link em /etc/rc.d/rc3.d.</P>
<P>&nbsp;</P>
<B><P>12.8 - CONFIGURA&Ccedil;&Atilde;O DE IMPRESSORA NO KDE</P>
</B><P>&nbsp;</P>
<P>Aqui voc&ecirc; vai em: K - Utilit&aacute;rios - Comandos de LaserJet e configura</P>
<P>&agrave; vontade.</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.9 - INSTALA&Ccedil;&Atilde;O DE APLICATIVOS NO KDE</P>
</B></FONT><P>&nbsp;</P>
<P>Depois de instalado o aplicativo voc&ecirc; vai em: K - Sistema – Procurar Aplica&ccedil;&otilde;es. </P>
<P>&nbsp;</P>
<P>Ele criar&aacute; um Grupo de Aplicativos chamado applnk com todos os aplicativos  encontrados. No Kde 1.1 ele cria um grupo Aplicativos N&atilde;o Kde.</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><P>12<FONT SIZE=4>.10 - TECLAS DE ATALHO</P>
</B></FONT><P>&nbsp;</P>
<P>VER O MENU NO LILO: tecle Tab para ver as op&ccedil;&otilde;es do Lilo, quando do boot do Red Hat, quando aparecer Lilo:</P>
<P>&nbsp;</P>
<P>No Slackware este menu &eacute; exibido no boot.</P>
<P>&nbsp;</P>
<P>EXTRAR NO X WINDOW: startx</P>
<P>&nbsp;</P>
<P>SAIR DO X WINDOW: Ctrl+Alt+Backspace</P>
<P>&nbsp;</P>
<P>ALTERNAR ENTRE AS RESOLU&Ccedil;&Otilde;ES DO X: Ctrl+Alt++/- (Control+Alt+mais ou menos do teclado num&eacute;rico). Se for um notebook: Ctrl+Alt+Fn++/-.</P>
<P>&nbsp;</P>
<P>ACESSAR OUTROS CONSOLES: Ctrl+Alt+n (n=2 a 6). O 1 ou o no qual voc&ecirc; acessou e o 7 s&atilde;o reservados para o X.</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.11 - COMANDOS DE CONFIGURA&Ccedil;&Atilde;O DO RED HAT:</P>
</B></FONT><P>&nbsp;</P>
<P>setup - abre um menu para configura&ccedil;&atilde;o de v&aacute;rios dispositivos</P>
<P>&nbsp;</P>
<P>sndconfig - detec&ccedil;&atilde;o e configura&ccedil;&atilde;o de placas de som</P>
<P>&nbsp;</P>
<P>mouseconfig - configura&ccedil;&atilde;o do mouse</P>
<P>&nbsp;</P>
<P>kbdconfig - configura&ccedil;&atilde;o do teclado</P>
<P>&nbsp;</P>
<P>timeconfig - configura&ccedil;&atilde;o das timezones</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.12 - FORMATAR DISQUERES E TRANSFERIR O SISTEMA (Disco de boot):</P>
</B></FONT><P>&nbsp;</P>
<P>1) Formatar:</P>
<P>superformat /dev/fd0u1140</P>
<P>&nbsp;</P>
<P>2) Criar sistema de arquivos:</P>
<P>/sbin/mke2fs /dev/fd0</P>
<P>&nbsp;</P>
<P>ou</P>
<P>&nbsp;</P>
<P>3) /sbin/lilo –b /dev/fd0</P>
<P> </P>
<P>&nbsp;</P>
<P>ou</P>
<P>&nbsp;</P>
<P>cat  /boot/vmlinuz-2.0.36-2cl  &gt;  /dev/fd0&#9;(colocar o nome completo da imagem, ver /boot)</P>
<P>&nbsp;</P>
<P>ou</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>dd if=/boot/vmlinuz of=/dev/fd0 bs=8192</P>
<P>&nbsp;</P>
<P>(Do Capitulino)</P>
<P>&nbsp;</P>
<P>ou</P>
<P>&nbsp;</P>
<P>dd if=/boot/vmlinuz-2.0.36-0.7 of=/dev/fd0</P>
<P>&nbsp;</P>
<P>com o disquete no drive.</P>
<P>&nbsp;</P>
<P>logo ap&oacute;s esse comando ele ir&aacute; criar o seu disco.</P>
<P>&nbsp;</P>
<P>Agora a parte 2.. vamos colocar o lilo no seu disquete</P>
<P>&nbsp;</P>
<P>Copie o /etc/lilo.conf para um diret&oacute;rio home (ou /root)</P>
<P>&nbsp;</P>
<P>Renomeio para lilo.conf.disk e edite sua primeira linha</P>
<P>&nbsp;</P>
<P>Passe-a de "boot=/dev/hda" para "boot=/dev/fd0"</P>
<P>&nbsp;</P>
<P>Grave e no terminal (com o disquete no drive) digite:</P>
<P>&nbsp;</P>
<P>lilo -C lilo.conf.disk</P>
<P>&nbsp;</P>
<P>Pronto .. disquete de boot criado ;)</P>
<P>&nbsp;</P>
<P>(Da Denis Page)</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.13 - PERSONALIZANDO O LOGIN</P>
</B></FONT><P>&nbsp;</P>
<P>Editar /etc/rc.d/rc.local</P>
<P>&nbsp;</P>
<P> </P>
<B><FONT SIZE=4><P>12.14 - IMPRIMIR NA LINHA DE COMANDO</P>
</B></FONT><P>&nbsp;</P>
<P>lpr nome.do.arquivo</P>
<B><FONT SIZE=4><P>&nbsp;</P>
<P>12.15 - GERANDO UM ARQUIVO COM MENSAGENS DE ERRO NO STARTX:</P>
</B></FONT><P>&nbsp;</P>
<P>Caso o startx n&atilde;o esteja funcionando e queira gerar um arquivo com as mensagens de erro:</P>
<P>&nbsp;</P>
<P>Startx 2&gt;&amp; 1&gt;startx.erro</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.16 - IRQS UTILIZADAS:</P>
</B></FONT><P>&nbsp;</P>
<P>cat /proc/interrupts</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.17 - ENDERE&Ccedil;OS DAS PORTAS</P>
</B></FONT><P>&nbsp;</P>
<P>cat /proc/ioports</P>
<P>&nbsp;</P>
<P>(Duas dicas do Thadeu Penna)</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.18 - FAZER LINUX RECONHECER MAIS DE 64 MB DE RAM:</P>
</B></FONT><P>&nbsp;</P>
<P>Quando aparecer o prompt do Lilo, digite "linux mem=128M". Se funcionar  adicione esta linha ao /etc/lilo.conf</P>
<P>&nbsp;</P>
<P>(Ver /usr/src/linux/Documentation/memory.txt</P>
<P>&nbsp;</P>
<P>Ou append mem=128M no lilo ou ainda adicionar essa linha ao /etc/lilo.conf</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.19 - EXECUTANDO SOM NA LINHA DE COMANDO:</P>
</B></FONT><P>&nbsp;</P>
<P>cat som.au &gt; /dev/audio</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>12<B><FONT SIZE=4>.20 - MOUSE PARA CANHOTOS NO LINUX</P>
</B></FONT><P>&nbsp;</P>
<P>A algum tempo atras, algu&eacute;m perguntou como trocar os bot&otilde;es do mouse no X. Descobri hoje:</P>
<P>&nbsp;</P>
<P>"Destro" (default)</P>
<P>&nbsp;</P>
<P>xmodmap -e "pointer = 1 2 3"</P>
<P>&nbsp;</P>
<P>"Canhoto"</P>
<P>&nbsp;</P>
<P>xmodmap -e "pointer = 3 2 1"</P>
<P>&nbsp;</P>
<P>(Do Ricardo Yassuo Igarashi)</P>
<P>&nbsp;</P>
<P> </P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>12.21 - ELIMINANDO ALGUM PROGRAMA QUE EST&Aacute; NA MEM&Oacute;RIA</P>
</B></FONT><P>&nbsp;</P>
<P>Caso voc&ecirc; tenha executado algum programa e n&atilde;o esteja conseguindo fech&aacute;-lo voc&ecirc; pode    kill&aacute;-lo: </P>
<P>digite no promt "ps ax" e verifique a lista com todos os processos em execu&ccedil;&atilde;o. Caso n&atilde;o consiga visualizar o programa que desejado, role a tela com Shift+PageUp e observe o n&uacute;mero na coluna PID. Ent&atilde;o execute:</P>
<P>&nbsp;</P>
<P>"kill 212" (supondo que 213 seja o n&uacute;mero do PID que voc&ecirc; deseja eliminar.</P>
<P>&nbsp;</P>
<P> </P>
<P><A NAME="_Toc445960958">Truques que voc&ecirc; n&atilde;o pode viver sem saber.</A></P>
<P>&nbsp;</P>
<P>Economizando digita&ccedil;&atilde;o: Quando esta digitando comandos, voc&ecirc; pode pressionar &lt;TAB&gt; isto ir&aacute; completar a linha de comando para voc&ecirc;. Exemplo: voc&ecirc; tem que digitar gcc isto_e_um_nome_longo.c; digitando gccthi&lt;TAB&gt; ser&aacute; suficiente. Se houver ambig&uuml;idade, como outros arquivos que come&ccedil;am com os mesmos caracteres, ser&aacute; mostrado as alternativas, se n&atilde;o, digite o suficiente para resolver qualquer ambig&uuml;idade.</P>
<P>Resetando a tela: se voc&ecirc; der um more ou cat em um arquivo bin&aacute;rio, sua tela pode acabar cheia de lixo. Para arrumar isso, digite a seq&uuml;&ecirc;ncia de caracteres: echo CTRL-V ESC c RETURN.</P>
<P>&nbsp;</P>
<P>Mensagens do kernel: de uma olhada em /var/adm/messages ou /var/log/messages como root para ver o que o kernel tem a lhe dizer, incluindo as mensagens de boot. O comando dmesg tamb&eacute;m &eacute; bastante &uacute;til.</P>
<P>&nbsp;</P>
<B><FONT SIZE=4><P>13 - </FONT><FONT SIZE=4>REFER&Ecirc;NCIAS</P>
</B></FONT><P>&nbsp;</P>
<P>1 - P&aacute;gina oficial do Linux: </P>
<P>        http://www.linux.org</P>
<P>2 - P&aacute;gina da Conectiva</P>
<P>        http://www.conectiva.com.br</P>
<P>3 - The Linux Manual (o manual do Linux mais badalado na INTERNET)</P>
<P>        http://www.netdados.com.br/tlm/ (autoria de Hugo Cisneiros)</P>
<P>4 - P&aacute;gina de Linux do provedor Matrix:</P>
<P>        Linux in Brazil: http://www.linux.trix.net/</P>
<P>5 - P&aacute;gina muito boa sobre Linux:</P>
<P>        Ano 2001: http://ano2001.sti.com.br</P>
<P>6 - Um verdadeiro manancial de Respostas:</P>
<P>        Tira-D&uacute;vidas: <A HREF="http://members.xoom.com/Tiraduvida/txt.html">http://members.xoom.com/Tiraduvida/txt.html</A></P>
<P>7 – P&aacute;gina sobre acentua&ccedil;&atilde;o no Linux (doRicardo – Iga):</P>
<P>        http://lie-br/conectiva.com.br/~iga/</P>
<P>8 - Minha contribui&ccedil;&atilde;o para os iniciantes ao Linux:</P>
<P>        http://www.oocities.org/SiliconValley/Ridge/3505/</P>
<P>9- Onde existem muitos programas &uacute;teis, links e FAQs:</P>
<P>        Felipe Russo: http://members.xoom.com/linux_page </P>
<P>10- Outro usu&aacute;rio Linux que d&aacute; sua contribui&ccedil;&atilde;o:</P>
<P>        Red Hat Linux Tips: http://www.bestway.com.br/~madeira/</P>
<P>11 Slackware Sergipe (p&aacute;gina do Fred com muita coisa sobre Slackware)</P>
<P>        http://www.linuxstart/~fred/</P>
<P>12- Grande reposit&oacute;rio de pacotes RPMs:</P>
<P>        Rufus: http://rufus.w3.org/linux/RPM/index.html</P>
<P>13- Espelho brasileiro do Rufus: </P>
<P>        http://linusp.usp.br/rpm2html/</P>
<P>14- Grande reposit&oacute;rio de programas para Linux (espelho brasileiro)</P>
<P>        Linuxberg: http://amazon.Linuxberg.com/ (da Tucows)</P>
<P>15- Outro excelente reposit&oacute;rio de programas for Linux:</P>
<P>        Linux Applications: http://www.linuxapps.com</P>
<P>16- Outro excelente:</P>
<P>        Freshmeat: http://md.us.mirrors.freshmeat.net/</P>
<P>17- P&aacute;gina oficial da Red Hat:</P>
<P>        http://www.hedhat.com</P>
<P>18- P&aacute;gina oficial da Slackware:</P>
<P>        http://www.slackware.org</P>
<P>19- P&aacute;gina oficial da Debian:</P>
<P>        http://www.debian.org</P>
<P>20- P&aacute;gina oficial da SuSE:</P>
<P>        http://www.suse.com</P>
<P>21 P&aacute;gina oficial da Caldera (Open Linux):</P>
<P>        http://www.caldera.com</P>
<P>22- P&aacute;gina oficial da Easy Linux</P>
<P>        http://www.eit.de/de/easylinux.html</P>
<P>23- P&aacute;gina oficial do KDE:</P>
<P>        http://www.kde.org</P>
<P>24- P&aacute;gina da Corel/Linux:      </P>
<P>        http://linux.corel.com</P>
<P>25- Hist&oacute;rico da Lista Linux-br (muita informa&ccedil;&atilde;o sobre Linux)</P>
<P>       http://linux-br.conectiva.com.br</P>
<P>26- ftp://sunsite.unc.edu/pub/Linux</P>
<P>26- ftp://tsx-11.mit.edu/pub/linux </P>
<P>27- ftp://ftp.funet.fi/pub/Linux</P>
<P>28 -Linux Applications and Utilities Page</P>
<P>       http://www.xnet.com/~blatura/linapps.shtml</P>
<P>&nbsp;</P><script language="JavaScript" type="text/javascript">
var width  = window.innerWidth || (window.document.documentElement.clientWidth ||  window.document.body.clientWidth);
var height = window.innerHeight || (window.document.documentElement.clientHeight || window.document.body.clientHeight);
var d = document;
if (width>=639 && height>=468 || top.location.href == window.location.href) {
}
rp_account   = '9645';rp_site      = '17527';rp_zonesize  = '1527362-51';rp_slot   = 'ad_group_786919';rp_adtype    = 'js';rp_smartfile = '[SMART FILE URL]';
d.write('<script language="JavaScript" type="text/javascript"');
d.write(' src="https://ads.rubiconproject.com/ad/9645.js">');
d.write('<\/scr'+'ipt>');}</script>
</BODY>
</HTML>
</div><style> 
.zoomout { -webkit-transition: -webkit-transform 0.5s ease;
-moz-transition: -moz-transform 0.5s ease;
-o-transition: -o-transform 0.5s ease;
transition: transform 0.5s;
-ms-transition: transform 0.5s ease;}
.zoomin { 
filter: blur(0)
-webkit-transform: scaleY(1.15);
-moz-transform: scaleY(1.15);
-o-transform: scaleY(1.15);
transform: scaleYY(1.15);
-ms-transform: scaleY(1.15);
} 
#archive:hover { zoom:101%;)
</style>

<script language="JavaScript" type="text/javascript">
<!--
var width  = window.innerWidth || (window.document.documentElement.clientWidth ||  window.document.body.clientWidth);
var height = window.innerHeight || (window.document.documentElement.clientHeight || window.document.body.clientHeight);
var d = document;

if (width>=806 && height>=468 || top.location.href == window.location.href) {
d.write('<div id="archive" onMouseOver="className=\'zoomin\';this.style.zIndex=\'99\'"  onMouseOut="className=\'zoomout\';this.style.zIndex=\'5\'" style="padding-left:25px;background-image:url(https://www.oocities.org/d.jpg); background-repeat:repeat-x; filter:alpha(opacity=88); -moz-opacity:0.88 ; opacity:0.88; position:fixed; background-color:#FFFFFF; width:100%; min-width:970px;  overflow:hidden; left:0px; top:0px; font-family:times; font-size:9px; border-bottom:5px solid #f7f7f7; color:#000000;background-color:#ffffe0;z-Index:5;"><font style="font-size:16px" color="#000000"> This Page is an outdated, user-generated website brought to you by an archive</font><font style="font-family:times; font-size:9px" color="#000000">.It was mirrored from Geocities at the end of October, 2009.<br>For any questions concerning this page try to contact the respective author. (To report any malicious content send the URL to oocities(at gmail dot com). For question about the archive visit: <a style="color:#005577" href="//oocities.org" target="_new" title="geocities archive">OoCities.org</a>.</font><div onClick="archive.style.display=\'none\'"  onMouseOver="style.cursor=\'pointer\'" style="font-size:17px;position:absolute;left:3px;top:3px;color:#999;line-height:20px">[x]</div><div onClick="archive.style.display=\'none\';footer.style.display=\'none\'"  onMouseOver="style.cursor=\'pointer\'" style="font-size:19px;position:absolute;right:30px;top:0px;color:#777;line-height:20px">[x]</div></div>');
var x =  d.getElementById('content').offsetWidth;
d.write('<div id="foot" style="position:fixed;left:1018px;top:31px;z-index:10;padding-bottom:3px"><div id="ft72">');
rp_account   = '9645';
rp_site      = '17527';
rp_zonesize  = '55620-15';
rp_slot   = 's';
rp_adtype    = 'iframe';
rp_width     = '300';
rp_height    = '250';
rp_smartfile = '[SMART FILE URL]';
d.write('<script language="JavaScript" type="text/javascript"');
d.write('src="https://ads.rubiconproject.com/ad/9645.js">');
d.write('<\/scr'+'ipt></div>');
if ( height>=543) {
var cb = Math.random();
var iframe = "&fr=" + (window != top);
var ref = "";
try {
    if (window != top) {
        ref = "&rf="+escape(d.referrer);
    }
} catch (ignore) { }
d.write('<script id="rp3" language="JavaScript" type="text/javascript"');
d.write('src="https://optimized-by.rubiconproject.com/a/9645/17527/55620-15.js?cb='+cb+ref+iframe+'"></script>')
}

d.write('<div id="ft73"><span onClick="foot.style.display=\'none\'"  style="font-size:16px;position:relative;left:7px;color:#555;background-color:ccc;line-height:19px"> \[x\]close <\/span><\/div>');


if ( width-x>=440 || width>=1425) { 
d.write('<div id="footer" style="position:fixed;left:1310px;top:31px;z-index:11;padding-bottom:3px"><div id="ft74">');

var cb = Math.random();
var iframe = "&fr=" + (window != top);
var ref = "";
try {
    if (window != top) {
        ref = "&rf="+escape(d.referrer);
    }
} catch (ignore) { }
d.write('<script id="rp3" language="JavaScript" type="text/javascript"');
d.write('src="https://optimized-by.rubiconproject.com/a/9645/17527/55620-15.js?cb='+cb+ref+iframe+'">')
d.write('<\/scr'+'ipt><\/div><div id="ft75">');

var cb = Math.random();
var iframe = "&fr=" + (window != top);
var ref = "";
try {
    if (window != top) {
        ref = "&rf="+escape(d.referrer);
    }
} catch (ignore) { }
d.write('<script id="rp4" language="JavaScript" type="text/javascript"');
d.write('src="https://optimized-by.rubiconproject.com/a/9645/17527/55620-15.js?cb='+cb+ref+iframe+'">');
d.write('<\/scr'+'ipt></div></div>');
}}
-->
</script>
<script type="text/javascript">
if (x<=1015){d.getElementById('foot').style.left = x + "px";}
d.getElementById('footer').style.left = x + d.getElementById('foot').offsetWidth + "px";
</script>

<script type="text/javascript">
<!--
   var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-26808115-1']);
  _gaq.push(['_setDomainName', 'oocities.org']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();
-->
</script><script type="text/javascript"> window.google_analytics_uacct = "UA-26808115-1"; </script>




